[{"title": "Kirkfell – Sat 31st May 2025", "date": "31 May 2025", "Incident": "60 in 2025", "Type": "Full Callout — Overdue", "Location": "Kirkfell", "Weather": ["Cool", "Mist"], "Other Agencies": ["Cumbria Police", "Duddon & Furness MRT"], "Tagged": ["Overdue"], "Incident_Type": "Full Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/kirkfell-sat-31st-may-2025/", "main_text": "A call was received from Cumbria Police when a walker was reported significantly overdue. He was planning to visit the waterfalls at Ill Gill on Kirk Fell but had not returned to Wasdale Head when expected. A full callout was made to have sufficient resources to search and rescue from within the gill, including drone capability for a rapid search of the hazardous area. Extra help was given once again from Duddon MRT. However, as the team was starting the ground search, the good news was received that the walker had come back into mobile signal and was now in a taxi. He has extended his walk significantly from his stated plans, mis-navigated and ended up in the wrong valley. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 18:33 and ended at 20:53 making 2.3 hrs in total. There were 19 Wasdale team members involved and the incident occured at NY 19977 09585. Total rescuer hours: 44", "start_time": "18:33", "end_time": "20:53", "hrs": "2.3", "staff": "19", "location": "NY 19977 09585", "total_hrs": "44"}, {"title": "Scafell Pike – Sat 31st May 2025", "date": "31 May 2025", "Incident": "59 in 2025", "Type": "Alert — Lost", "Location": "Scafell Pike", "Weather": ["Cool", "Mist", "Rain", "Windy"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost", "PhoneFind"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-31st-may-2025/", "main_text": "A short alert was quickly resolved after a call was received from Cumbria Police. Two walkers had become separated from the rest of their walking party and could not be contacted. They were concerned that they were now lost. However, a PhoneFind was able to confirm their location and then the Team Leader was able to speak with them. They had re-found the path and were heading down with no need for MRT support.\nhttps://www.adventuresmart.uk/\n#BeAdventureSmart and make a good day better.\nAsk yourself three questions before you set off:\n1. Do I have the right GEAR ?\n2. Do I know what the WEATHER will be like?\n3. Am I confident that I have the KNOWLEDGE & SKILLS for the day? ", "rescue_info": " Incident started at 15:04 and ended at 15:17 making 0.2 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 203072. Total rescuer hours: 0.4", "start_time": "15:04", "end_time": "15:17", "hrs": "0.2", "staff": "2", "location": "NY 203072", "total_hrs": "0.4"}, {"title": "Sty Head – Sat 31st May 2025", "date": "31 May 2025", "Incident": "58 in 2025", "Type": "Limited Callout — Injured & Medical", "Location": "Sty Head", "Weather": ["Cool", "Mist", "Rain"], "Other Agencies": ["Keswick MRT"], "Diagnosis": "Unspecified", "Incident_Type": "Limited Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/sty-head-sat-31st-may-2025/", "main_text": "The Team Leader was called yesterday by Keswick MRT for some help as they were handling multiple callouts and were slightly short on numbers for stretcher carry from Sty Head. A party of five volunteered to help and were heading down the valley when a further call confirmed that they now had things covered, and that we were able to stand down, leaving us with more resources for potential callouts on our own ‘patch’. ", "rescue_info": " Incident started at 13:32 and ended at 14:18 making 0.8 hrs in total. There were 7 Wasdale team members involved and the incident occured at NY 219095. Total rescuer hours: 6", "start_time": "13:32", "end_time": "14:18", "hrs": "0.8", "staff": "7", "location": "NY 219095", "total_hrs": "6"}, {"title": "Cam Spout, Scafell – Fri 30th May 2025", "date": "30 May 2025", "Incident": "57 in 2025", "Type": "Full Callout — Lost", "Location": "Cam Spout, Scafell", "Weather": ["Cloudy Summits"], "Other Agencies": ["Coastguard", "Coniston MRT", "Cumbria Police", "Duddon & Furness MRT", "Lake District Mountain Rescue Search Dogs", "Rescue 199 from Prestwick"], "Tagged": ["Missing Person"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-fri-30th-may-2025/", "main_text": "A call was received yesterday evening from Cumbria Police. A young walker had separated from his family group in misty conditions shortly after beginning their descent from Scafell Pike summit. He had not been located after two and half hours, and there was growing concern for his safety. The Team Leader acted quickly to initiate search assets from many resources, including DFMRT, search dogs and a Coastguard helicopter Rescue R199 from Prestwick. A Coniston MRT team member camping locally with his family also kindly offered to help. Due to declining daylight and the possibility of a longer operation should the hasty searches be unsuccessful, formal search management was also established in readiness for a request for help from all Lake District MRTs for an escalated search on Saturday. As the hasty search was expanding, with team members searching routes all over the Scafell Massif, a 999 text message was received by Cumbria Police from two wild campers in Upper Eskdale. This indicated the name and location of the missing walker. With this excellent news, a nearby Duddon and Furness MRT search team arrived quickly, establishing that the walker had sustained minor injuries only. Rescue 199 also diverted quickly to the location and was on the ground at that location within 15 minutes of the text arriving. The walker was then flown to Brackenclose to be reunited with his very relieved and grateful family. All teams stood down and returned to their respective bases and homes. A great outcome for what was a very worrying situation. We’d like to thank all the agencies involved for their rapid deployment and teamwork. A special mention also for the wild campers for looking after the walker after they heard his shouts and having the knowledge to send a 999 text when there is no mobile phone signal. ", "rescue_info": " Incident started at 19:11 and ended at 00:51 making 5.7 hrs in total. There were 27 Wasdale team members involved and the incident occured at NY 21514 05511. Total rescuer hours: 154", "start_time": "19:11", "end_time": "00:51", "hrs": "5.7", "staff": "27", "location": "NY 21514 05511", "total_hrs": "154"}, {"title": "Brown Tongue, Scafell Pike – Mon 26th May 2025", "date": "26 May 2025", "Incident": "56 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Cloudy Summits", "Rain", "Windy"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-mon-26th-may-2025/", "main_text": "The team was called by Cumbria Police on Monday evening about two walkers who were overdue from a walk up Scafell Pike. The Team Leader attempted to make contact but this was not possible despite repeated attempts. A full team callout was made when their friends received a call saying one of the walkers was struggling to make progress, falling frequently, was very cold and still an hour away from the valley. Their location was still unknown. A hasty search was planned with the main paths being covered, and as the first team was on the hill, a further 999 call was received from a group attempting the 3 peaks who came across the two walkers. This time an exact location was received, confirming they were on the main tourist path. Once on scene the cold and exhausted walker, who had fallen multiple times, was rewarmed and reassured after a medical assessment. A transfer to the team stretcher was made to expedite the descent. Once back in the valley the walker was reassessed once more before onward transfer in a friend’s vehicle. We hope the walker is recovering well, and thanks to the passing walking group who called it in, giving us an exact location. ", "rescue_info": " Incident started at 18:53 and ended at 23:29 making 4.6 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY 19813 07341. Total rescuer hours: 78", "start_time": "18:53", "end_time": "23:29", "hrs": "4.6", "staff": "17", "location": "NY 19813 07341", "total_hrs": "78"}, {"title": "Little Hell Gate, Great Gable – Sun 25th May 2025", "date": "25 May 2025", "Incident": "55 in 2025", "Type": "Full Callout — Cragfast", "Location": "Little Hell Gate, Great Gable", "Weather": ["Rain", "Windy"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/little-hell-gate-great-gable-sun-25th-may-2025/", "main_text": "Two walkers had called Cumbria Police to ask for assistance. They appeared to be on the traverse path at Little Hell Gate and had become afraid for their safety. It was also wet and windy and they were not well equipped for these conditions, so they were becoming very cold. All-in-all, quite intimidating conditions for inexperienced walkers. The Team Leader made a full team callout to account for the worst-case scenario. The advance party got to the walkers and found them wet and cold either side of the very loose scree slope of Little Hell Gate, albeit on the correct route. After some re-warming, additional clothing and reassurance, they were thankfully both able to mobilise and walk off under the direction of team members. Once walked back down to the valley, the team made their way back to base to dry off the equipment and reset the vehicles. We hope the walkers are none the worse for their adventure, and we that they are back on the fells soon with some valuable experience behind them. ", "rescue_info": " Incident started at 15:11 and ended at 19:08 making 4 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 20801 10011. Total rescuer hours: 80", "start_time": "15:11", "end_time": "19:08", "hrs": "4", "staff": "20", "location": "NY 20801 10011", "total_hrs": "80"}, {"title": "St Bees Head – Sun 25th May 2025", "date": "25 May 2025", "Incident": "54 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "St Bees Head", "Weather": ["Windy"], "Other Agencies": ["Coastguard", "Cumbria Police"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/st-bees-head-sun-25th-may-2025/", "main_text": "A call was received from Cumbria Police about a walker who had fallen, hurt his ankle and was unable to bear weight. It was difficult initially to determine the exact location. As such, a full callout was made to either support the coastguard team if required, or if the location was determined to be MRT responsibility. Direct communication was then established with the Whitehaven coastguard team, and it transpired that they were already close to the scene and were able to deal with all aspects of the rescue. The team stood down and returned to base. ", "rescue_info": " Incident started at 13:06 and ended at 14:12 making 1.1 hrs in total. There were 18 Wasdale team members involved and the incident occured at NX 94548 13428. Total rescuer hours: 20", "start_time": "13:06", "end_time": "14:12", "hrs": "1.1", "staff": "18", "total_hrs": "20"}, {"title": "Esk Pike – Fri 23rd May 2025", "date": "23 May 2025", "Incident": "53 in 2025", "Type": "Alert — Lost", "Location": "Esk Pike", "Weather": ["Mist", "Rain"], "Other Agencies": ["Langdale Ambleside MRT"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/esk-pike-fri-23rd-may-2025/", "main_text": "A call was received on Friday evening; two walkers were reporting themselves lost in the mist on their descent from Scafell Pike. The grid reference from the police call put them on Esk Pike. This is in Langdale Ambleside’s area, so a quick handover with them was made and they dealt with the callout and later successfully rescued the walkers. ", "rescue_info": " Incident started at 20:39 and ended at 20:46 making 0.1 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 236076. Total rescuer hours: 0.1", "start_time": "20:39", "end_time": "20:46", "hrs": "0.1", "staff": "1", "location": "NY 236076", "total_hrs": "0.1"}, {"title": "Wastwater Screes – Thu 22nd May 2025", "date": "22 May 2025", "Incident": "52 in 2025", "Type": "Alert — Other", "Location": "Wastwater Screes", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cumbria Police"], "Tagged": ["False Alarm", "Screes"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/wastwater-screes-thu-22nd-may-2025/", "main_text": "A call was received from Cumbria Police when two walkers on Yewbarrow heard a scream from the opposite side of the lake, and they were concerned that someone was in trouble. The Team Leader contacted the walkers and also made further enquiries locally. Nothing further to indicate a problem emerged, and with a huge potential search area, it was agreed with the police that the log could be closed with deployment agreed if further calls were received. A false alarm with good intent. ", "rescue_info": " Incident started at 17:00 and ended at 17:33 making 0.6 hrs in total. There was 1 Wasdale team member involved. Total rescuer hours: 0.6", "start_time": "17:00", "end_time": "17:33", "hrs": "0.6", "staff": "1", "total_hrs": "0.6"}, {"title": "Scafell Pike – Tue 20th May 2025", "date": "20 May 2025", "Incident": "51 in 2025", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Clear", "Dry"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-tue-20th-may-2025/", "main_text": "A very swift resolution to two walkers being reported overdue after they had become separated from the rest of their walking group. However, very quickly they were in contact to say they had arrived at their intended destination, so no further action was needed. ", "rescue_info": " Incident started at 22:26 and ended at 22:31 making 0.1 hrs in total. There was 1 Wasdale team member involved. Total rescuer hours: 0.1", "start_time": "22:26", "end_time": "22:31", "hrs": "0.1", "staff": "1", "total_hrs": "0.1"}, {"title": "Sty Head – Sun 18th May 2025", "date": "18 May 2025", "Incident": "50 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Sty Head", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cumbria Police", "Helimed 08", "North West Air Ambulance"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/sty-head-sun-18th-may-2025/", "main_text": "A tragic callout was initiated on Sunday, when North West Ambulance Service tasked the team. A lone walker had been found by other walkers near to Sty Head; he had collapsed and was not responding. A full callout was made and helimed support quickly requested, with some team members already on the hill making themselves available to divert their planned leisure walks. Helimed 08 from Blackpool was dispatched and was first on scene, but sadly the walker was declared deceased. Team members arrived and assisted with the transfer to the helicopter. We are thankful to Helimed 08 for flying the walker back to the valley, where team members took care of him before handing over to Cumbria Police. A sad callout, and our sincere thoughts and condolences go to the walkers’ family and friends, and all those on the hill that were involved. ", "rescue_info": " Incident started at 16:18 and ended at 22:14 making 5.9 hrs in total. There were 16 Wasdale team members involved and the incident occured at NY 221094. Total rescuer hours: 94", "start_time": "16:18", "end_time": "22:14", "hrs": "5.9", "staff": "16", "location": "NY 221094", "total_hrs": "94"}, {"title": "Brown Tongue, Scafell Pike – Sat 17th May 2025", "date": "17 May 2025", "Incident": "49 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Dry", "Sunny"], "Diagnosis": "Head Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sat-17th-may-2025-3/", "main_text": "The third and last call of the day arrived as team members had just returned to base. A walker had fallen after losing consciousness and hit their head. Team members returned to the vehicles and headed back to Brackenclose. Once on scene a medical assessment was made. The walker had thankfully recovered quite well, and he was able to walk down to Brackenclose unaided, under the watchful eyes of accompanying team members. A good outcome after a busy day. Team members returned once more to base to reset the vehicles. We hope the walker recovered well. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 17:38 and ended at 20:56 making 3.3 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY 196073. Total rescuer hours: 56", "start_time": "17:38", "end_time": "20:56", "hrs": "3.3", "staff": "17", "location": "NY 196073", "total_hrs": "56"}, {"title": "Brown Tongue, Scafell Pike – Sat 17th May 2025", "date": "17 May 2025", "Incident": "48 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Dry", "Sunny", "Warm"], "Diagnosis": "Head Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sat-17th-may-2025-2/", "main_text": "The second call of the day came 4 minutes after the first, about 50m away. A walker had slipped and hit his head on a rock, suffering a deep cut. When the team arrived some good work from passing walkers had dressed the wound; a doctor was also in attendance. It was decided that the determined walker was able to continue to walk slowly down to the valley floor. This was completed without incident, and after a further check-up by the team Remote Rescue Medical Technicians, family members took him to hospital for further treatment. We wish the walker well and hope he got back to the pub later for his family dinner as planned. ", "rescue_info": " Incident started at 14:42 and ended at 17:49 making 3.1 hrs in total. There were 14 Wasdale team members involved and the incident occured at NY 198073. Total rescuer hours: 43", "start_time": "14:42", "end_time": "17:49", "hrs": "3.1", "staff": "14", "location": "NY 198073", "total_hrs": "43"}, {"title": "Brown Tongue, Scafell Pike – Sat 17th May 2025", "date": "17 May 2025", "Incident": "47 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Dry", "Sunny", "Warm"], "Diagnosis": "Leg Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sat-17th-may-2025/", "main_text": "The team was called three times on Saturday afternoon. In the first, a walker was reported to be unable to weight bear with a leg injury, having fallen three times.\nOnce on scene, an assessment was made, with the situation having improved somewhat. Severe cramping in both legs was becoming less frequent after rehydration and some food. After further rest, the walker was able to make progress by himself and, accompanied by team members, he made it safely back down to Brackenclose. A good outcome, and hopefully the walker recovered quickly. ", "rescue_info": " Incident started at 14:38 and ended at 17:48 making 3.2 hrs in total. There were 14 Wasdale team members involved and the incident occured at NY 199074. Total rescuer hours: 45", "start_time": "14:38", "end_time": "17:48", "hrs": "3.2", "staff": "14", "location": "NY 199074", "total_hrs": "45"}, {"title": "Broad Crag Col, Scafell Pike – Fri 16th May 2025", "date": "16 May 2025", "Incident": "46 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Broad Crag Col, Scafell Pike", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Coastguard", "Duddon & Furness MRT", "Rescue 199 from Prestwick"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/broad-crag-col-scafell-pike-fri-16th-may-2025/", "main_text": "A very busy weekend kicked off on Friday evening when a call was taken about a walker who had injured his ankle and could not weight bear. The location was confirmed to be high up on Broad Crag Col. With this location being very challenging for a stretcher carry, Coastguard helicopter assistance was requested. With slightly low numbers, Duddon and Furness MRT was also asked to help. On arrival to the scene, gusty conditions prevented a direct winch into the helicopter, thus requiring hard graft to stretcher to a suitable location. Some team members were thankful for a lift up by Rescue 199, with the rest ascending on foot. Once on scene, with medical care handled by the R199 paramedic, the team prepared for an uphill carry. The stretcher was eventually transferred direct into the helicopter near Ill Crag, and the walker flown to hospital. The teams descended to the valley with spectacular views and returned to their respective bases to reset vehicles and then wearily home. Thanks to Duddon and Furness MRT and to Rescue 199 for their help once again. We hope the walker recovers quickly from his injury. ", "rescue_info": " Incident started at 16:41 and ended at 23:58 making 7.3 hrs in total. There were 19 Wasdale team members involved and the incident occured at NY 217074. Total rescuer hours: 139", "start_time": "16:41", "end_time": "23:58", "hrs": "7.3", "staff": "19", "location": "NY 217074", "total_hrs": "139"}, {"title": "Black Sail – Wed 7th May 2025", "date": "7 May 2025", "Incident": "45 in 2025", "Type": "Alert — Injured & Medical", "Location": "Black Sail", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cockermouth MRT"], "Diagnosis": "Ankle Injury", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/black-sail-wed-7th-may-2025/", "main_text": "As incident 44 was ongoing on Broad Stand, a further call was received from Cumbria Police. A walker had fallen and injured his ankle. The location was near Looking Stead, and on confirming an accurate location, it was established that it was in Cockermouth MRT’s area. A quick handover was made and they successfully completed the rescue with assistance from a Coastguard helicopter. ", "rescue_info": " Incident started at 15:18 and ended at 15:44 making 0.4 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 18300 11700. Total rescuer hours: 0.8", "start_time": "15:18", "end_time": "15:44", "hrs": "0.4", "staff": "2", "location": "NY 18300 11700", "total_hrs": "0.8"}, {"title": "Broad Stand, Scafell – Wed 7th May 2025", "date": "7 May 2025", "Incident": "44 in 2025", "Type": "Full Callout — Cragfast", "Location": "Broad Stand, Scafell", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/broad-stand-scafell-wed-7th-may-2025/", "main_text": "A call was received from Cumbria Police about a walker reporting himself stuck on a crag between Sca Fell and Scafell Pike. Having established this was likely to be on Broad Stand a full callout was made. A long walk up to the summit of Sca Fell was made and then the team descended to the walker in good conditions. After a routine rescue and lower to Mickledore, the crag was de-rigged and all returned to base to check equipment and reset the vehicles. ", "rescue_info": " Incident started at 11:24 and ended at 20:11 making 8.8 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY 210068. Total rescuer hours: 150", "start_time": "11:24", "end_time": "20:11", "hrs": "8.8", "staff": "17", "location": "NY 210068", "total_hrs": "150"}, {"title": "Wastwater Screes – Sun 4th May 2025", "date": "4 May 2025", "Incident": "43 in 2025", "Type": "Alert — Other", "Location": "Wastwater Screes", "Weather": ["Cloudy Summits", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["False Alarm", "Screes"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/sun-4th-may-2025/", "main_text": "The team was notified by Cumbria Police when a caller reported that a head torch had not moved for some time on the Screes. They were concerned for the person’s safety. The Team Leader asked a team member who lived in the valley to investigate. Happily by the time they arrived at the lakeside the light had started to move. They were able to meet up with the walker and confirm that all was well. A false alarm with good intent and a happy outcome. ", "rescue_info": " Incident started at 23:26 and ended at 00:47 making 1.4 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 15667 04997. Total rescuer hours: 2.8", "start_time": "23:26", "end_time": "00:47", "hrs": "1.4", "staff": "2", "location": "NY 15667 04997", "total_hrs": "2.8"}, {"title": "Lingmell Gill Path, Scafell Pike – Sat 3rd May 2025", "date": "3 May 2025", "Incident": "42 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Gill Path, Scafell Pike", "Weather": ["Cloudy Summits", "Dry"], "Other Agencies": ["North West Ambulance Service"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-gill-path-scafell-pike-sat-3rd-may-2025/", "main_text": "The team was called when a lone walker had fainted and was then having difficulty breathing and shivering. A very kind passer-by had stopped to help and called it in. Once the team was on scene an assessment was made. She was transferred to the team stretcher and then a routine carry was made to Brackenclose. After further assessment by an awaiting ambulance crew the walker was able to be discharged. We hope the walker has recovered well and would like to recognise the walker who gave up her 3 peaks challenge to provide help to someone in need. ", "rescue_info": " Incident started at 21:04 and ended at 03:02 making 6 hrs in total. There were 13 Wasdale team members involved and the incident occured at NY 18921 07233. Total rescuer hours: 78", "start_time": "21:04", "end_time": "03:02", "hrs": "6", "staff": "13", "location": "NY 18921 07233", "total_hrs": "78"}, {"title": "Great Gable – Wed 23rd Apr 2025", "date": "23 Apr 2025", "Incident": "41 in 2025", "Type": "Alert — Overdue", "Location": "Great Gable", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cockermouth MRT"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/great-gable-wed-23rd-apr-2025/", "main_text": "A bit of a catch up on call-outs coming, after a reasonably quiet period came to an abrupt end with a flurry of call-outs recently. This was an alert from Cockermouth MRT when a walker intending to summit Red Pike (Wasdale) was reported overdue. A team member checked out Overbeck car park to look for the vehicle, which wasn’t there. Eventually Cockermouth MRT made contact with the walker around the Green Gable area, on his way back to Seathwaite. A good outcome. ", "rescue_info": " Incident started at 22:40 and ended at 23:42 making 1 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 16897 10345. Total rescuer hours: 1", "start_time": "22:40", "end_time": "23:42", "hrs": "1", "staff": "1", "location": "NY 16897 10345", "total_hrs": "1"}, {"title": "Corridor Route, Scafell Pike – Sun 20th Apr 2025", "date": "20 Apr 2025", "Incident": "40 in 2025", "Type": "Limited Callout — Lost", "Location": "Corridor Route, Scafell Pike", "Weather": ["Clear", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Limited Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/corridor-route-scafell-pike-sun-20th-apr-2025/", "main_text": "A late night call from Cumbria Police about an inexperienced walker who had become separated from his group. He had mis-navigated and ended up on some steep ground below the Corridor Route. After some difficulties in making contact directly, an accurate location was determined. As the walker was uninjured, a small party was tasked to located and then escort the walker off the fell, after which he was re-united with the rest of his group. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 21:51 and ended at 03:03 making 5.2 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY 217087. Total rescuer hours: 31", "start_time": "21:51", "end_time": "03:03", "hrs": "5.2", "staff": "6", "location": "NY 217087", "total_hrs": "31"}, {"title": "Great Gable – Sun 20th Apr 2025", "date": "20 Apr 2025", "Incident": "39 in 2025", "Type": "Alert — Other", "Location": "Great Gable", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cumbria Police"], "Tagged": ["False Alarm"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/great-gable-sun-20th-apr-2025/", "main_text": "Three separate calls were made to Cumbria Police yesterday after hearing shouts in the White Napes area of Great Gable. However, after assessing all of the information and consulting with the informants and Cumbria Police it was decided that there was insufficient evidence of an ongoing need for MR assistance. It was likely that the situation had resolved or it was a false alarm with good intent. The log was kept open in case of further information but none was forthcoming. ", "rescue_info": " Incident started at 15:30 and ended at 00:02 making 8.5 hrs in total. There were 3 Wasdale team members involved. Total rescuer hours: 26", "start_time": "15:30", "end_time": "00:02", "hrs": "8.5", "staff": "3", "total_hrs": "26"}, {"title": "Greathall Gill, Wasdale – Sun 20th Apr 2025", "date": "20 Apr 2025", "Incident": "38 in 2025", "Type": " — Injured & Medical", "Location": "Greathall Gill, Wasdale", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Leg Injury", "Incident_Type": "", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/greathall-gill-wasdale-sun-20th-apr-2025/", "main_text": "A call was received yesterday from Cumbria Police about a walker in a family group who had fallen on steep ground, suffering a leg injury that made it impossible for her to continue. The team was called out and made their way to the scene. After a medical assessment and splinting of the leg, the walker was transferred into the team stretcher. The short descent was completed safely and the walker transferred to their own vehicle for onward transfer to hospital. We hope the walker recovers quickly and is back on the fells soon. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 14:31 and ended at 17:48 making 3.3 hrs in total. There were 13 Wasdale team members involved and the incident occured at NY 143034. Total rescuer hours: 43", "start_time": "14:31", "end_time": "17:48", "hrs": "3.3", "staff": "13", "location": "NY 143034", "total_hrs": "43"}, {"title": "Calf Cove, Great End – Fri 18th Apr 2025", "date": "18 Apr 2025", "Incident": "37 in 2025", "Type": "Alert — Injured & Medical", "Location": "Calf Cove, Great End", "Weather": ["Cold", "Mild", "Rain"], "Other Agencies": ["Cockermouth MRT", "Keswick MRT", "North West Ambulance Service"], "Diagnosis": "Leg Injury", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/calf-cove-great-end-fri-18th-apr-2025/", "main_text": "North West Ambulance Service alerted the Team Leader to a walker who had possibly injured his leg high on the Scafell Massif. Communications directly with the party involved were not possible and it was unclear as to whether the walker was still walking and the severity of the problem. Eventually a location was determined to be at Calf Cove, Great End. This was in Keswick MRT’s area and so the callout was handed over. Keswick MRT then called Cockermouth for help with a possible stretcher carry, so 3 teams involved. After some time, they were stood down when a message came through to say that some other walkers had helped him off the hill. ", "rescue_info": " Incident started at 17:30 and ended at 18:36 making 1.1 hrs in total. There were 3 Wasdale team members involved and the incident occured at NY 228081. Total rescuer hours: 3.3", "start_time": "17:30", "end_time": "18:36", "hrs": "1.1", "staff": "3", "location": "NY 228081", "total_hrs": "3.3"}, {"title": "Piers Gill, Scafell Pike – Mon 14th Apr 2025", "date": "14 Apr 2025", "Incident": "36 in 2025", "Type": "Alert — Lost", "Location": "Piers Gill, Scafell Pike", "Weather": ["Cold", "Mist", "Rain"], "Tagged": ["Lost", "Piers Gill"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/piers-gill-scafell-pike-mon-14th-apr-2025/", "main_text": "A call was received on Monday evening regarding two walkers who had taken a wrong turn on their descent from Scafell Pike heading for Brackenclose. Recognising some dangerous ground near to Piers Gill and unsure of their location they wisely called for help. An accurate Phonefind put them near Lingmell crags on the West side of Piers Gill. As there is no safe descent alongside this side of the gill, the Team Leader was able to direct them back up to Lingmell Col to regain the main tourist path. Once on the path, the walkers were able to make their way back the their vehicle in the valley. A good outcome. ", "rescue_info": " Incident started at 18:03 and ended at 20:19 making 2.3 hrs in total. There were 3 Wasdale team members involved and the incident occured at NY 212080. Total rescuer hours: 7", "start_time": "18:03", "end_time": "20:19", "hrs": "2.3", "staff": "3", "location": "NY 212080", "total_hrs": "7"}, {"title": "Corridor Route, Scafell Pike – Mon 7th Apr 2025", "date": "7 Apr 2025", "Incident": "35 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Corridor Route, Scafell Pike", "Weather": ["Dry", "Sunny", "Warm"], "Diagnosis": "Knee Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/corridor-route-scafell-pike-mon-7th-apr-2025/", "main_text": "A call was received on Monday evening about a walker who had twisted her knee on the Corridor Route near Piers Gill. The injury had steadily got worse through the day, eventually becoming so painful that she could not continue. As many team members were preparing for team training on a Monday, many team members were able to attend, including a first outing on the fell for our five new members. The team made their way to the scene and assessed the walker. After some extra pain relief and splinting of the knee, a long stretcher carry was made uphill to Lingmell Col, and then down to Brackenclose. The walker was then brought back to base to be picked up by her partner in their own vehicle. We wish the walker well in her recovery and hope she is back on the fells soon. Well done also to our new members, hopefully the long carry has not put them off! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 17:11 and ended at 00:22 making 7.2 hrs in total. There were 31 Wasdale team members involved and the incident occured at NY 218013. Total rescuer hours: 223", "start_time": "17:11", "end_time": "00:22", "hrs": "7.2", "staff": "31", "location": "NY 218013", "total_hrs": "223"}, {"title": "Wasdale – Sun 6th Apr 2025", "date": "6 Apr 2025", "Incident": "34 in 2025", "Type": "Alert — Overdue", "Location": "Wasdale", "Weather": ["Dry", "Sunny", "Warm"], "Tagged": ["False Alarm", "Fell Runner", "Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/sun-6th-apr-2025/", "main_text": "A short alert was resolved quickly after an overdue fell runner was reported. However, as the Team Leader and others were gathering information on the route taken, another call confirmed she had been in touch and simply a poor mobile phone signal had prevented updates home. Happily, a false alarm with good intent. ", "rescue_info": " Incident started at 14:36 and ended at 14:53 making 0.3 hrs in total. There were 3 Wasdale team members involved. Total rescuer hours: 0.9", "start_time": "14:36", "end_time": "14:53", "hrs": "0.3", "staff": "3", "total_hrs": "0.9"}, {"title": "Brown Tongue, Scafell Pike – Sat 5th Apr 2025", "date": "5 Apr 2025", "Incident": "33 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cumbria Police", "North West Ambulance Service"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sat-5th-apr-2025/", "main_text": "A call from Cumbria Police was received about a walker on an ascent of Scafell Pike. She was reported to have collapsed and was in and out of consciousness. A passing doctor had stopped to help. A full callout was made quickly and the team responded. Once on scene a handover was received from the doctor and an assessment made. After some treatment, a routine stretcher carry was subsequently made to Brackenclose to an awaiting ambulance, before onward transfer to hospital. We wish the walker well in her recovery, and hope she returns soon to complete her walk. Thanks again to the passing doctor for his help and hope he still made the cutoff on the race he was undertaking. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 12:07 and ended at 15:49 making 3.7 hrs in total. There were 15 Wasdale team members involved and the incident occured at NY 198073. Total rescuer hours: 56", "start_time": "12:07", "end_time": "15:49", "hrs": "3.7", "staff": "15", "location": "NY 198073", "total_hrs": "56"}, {"title": "Pillar – Fri 4th Apr 2025", "date": "4 Apr 2025", "Incident": "32 in 2025", "Type": "Alert — Overdue", "Location": "Pillar", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cockermouth MRT"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/pillar-fri-4th-apr-2025/", "main_text": "A call from Cumbria Police was received regarding an overdue walker from a walk up Pillar. The walker was last known to be at the summit, and had not returned to his vehicle when expected. Due to the possibility of a descent into Ennerdale, Cockermouth MRT were alerted, however shortly afterwards the good news was received that he had turned up safe and well in Wasdale. ", "rescue_info": " Incident started at 18:02 and ended at 18:49 making 0.8 hrs in total. There were 2 Wasdale team members involved. Total rescuer hours: 1.6", "start_time": "18:02", "end_time": "18:49", "hrs": "0.8", "staff": "2", "total_hrs": "1.6"}, {"title": "Scafell Pike – Fri 4th Apr 2025", "date": "4 Apr 2025", "Incident": "31 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Scafell Pike", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Leg Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-fri-4th-apr-2025/", "main_text": "During incident 30 on Broad Stand, a further call was received from Cumbria Police. A well-equipped walker high on Scafell Pike was suffering from severe and painful cramping in his leg.\nThe Team Leader diverted some team members to the scene to assess and help. Happily the walker had recovered somewhat and was determined to make a slow walk down under his own steam. This continued without event to Brackenclose. We hope he recovered quickly. ", "rescue_info": " Incident started at 16:12 and ended at 19:36 making 3.4 hrs in total. There were 23 Wasdale team members involved and the incident occured at NY 212074. Total rescuer hours: 78", "start_time": "16:12", "end_time": "19:36", "hrs": "3.4", "staff": "23", "location": "NY 212074", "total_hrs": "78"}, {"title": "Broad Stand, Scafell – Fri 4th Apr 2025", "date": "4 Apr 2025", "Incident": "30 in 2025", "Type": "Full Callout — Cragfast", "Location": "Broad Stand, Scafell", "Weather": ["Dry", "Sunny", "Warm"], "Other Agencies": ["Duddon & Furness MRT"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/broad-stand-scafell-fri-4th-apr-2025/", "main_text": "The team was called three times on Friday by Cumbria Police. In the first alert a party of two walkers were attempting to ascend from Mickledore via Broad Stand to Sca Fell summit. They had gone off route and found themselves cragfast near Mickledore Chimney. A full team callout was made for the rope rescue. Due to slightly low numbers declared initially, Duddon and Furness MRT were asked to support, but subsequently were stood down when more team members became available. Following the hard slog up via Green How up to the top of Broad Stand, team members established a rope system for safety and descended to the walkers. They were found in a precarious position. Happily they were unhurt, and were able to make the assisted scramble to safe ground with the assistance of team members and ropes for security. Following de-rigging everyone made their way back to Brackenclose for a debrief and then to base to reset the vehicles. Thanks to Duddon and Furness MRT for their willingness to help , it is much appreciated. ", "rescue_info": " Incident started at 11:44 and ended at 19:35 making 7.9 hrs in total. There were 23 Wasdale team members involved and the incident occured at NY 21000 06800. Total rescuer hours: 182", "start_time": "11:44", "end_time": "19:35", "hrs": "7.9", "staff": "23", "location": "NY 21000 06800", "total_hrs": "182"}, {"title": "Scafell Pike – Wed 2nd Apr 2025", "date": "2 Apr 2025", "Incident": "29 in 2025", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Clear", "Cool", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-wed-2nd-apr-2025/", "main_text": "A short alert was quickly resolved after a call from Cumbria Police about a party of three walkers. They had set off at 4pm and were considered overdue and could not be contacted. The exact route was unknown, and they were not equipped to be on the fell at night. However, as the Team Leader was making initial enquiries there was another call confirming that the party had safely returned to their accommodation. ", "rescue_info": " Incident started at 21:52 and ended at 22:11 making 0.3 hrs in total. There was 1 Wasdale team member involved. Total rescuer hours: 0.3", "start_time": "21:52", "end_time": "22:11", "hrs": "0.3", "staff": "1", "total_hrs": "0.3"}, {"title": "Scafell Pike – Thu 27th Mar 2025", "date": "27 Mar 2025", "Incident": "28 in 2025", "Type": "Full Callout — Lost", "Location": "Scafell Pike", "Weather": ["Cold", "Rain", "Windy"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-thu-27th-mar-2025/", "main_text": "The team was called by Cumbria Police about a lone walker who had reached the summit of Scafell Pike but had become disoriented in the mist. With wind chill high on the tops, conditions were poor. The walker was cold and wet and was unable to navigate down. The Team Leader attempted to make contact but was unable to talk directly to the walker. A further call was also received from another walker who could hear cries for help, but could not locate them. A full call-out was initiated and the team headed down the valley. After some time contact was finally made by mobile and it transpired that the lone walker had met up with the other walkers who had then escorted him off via the tourist path back to Wasdale Head. With this good news the team was stood down and returned to base. Thanks to the walkers who helped prevent a potentially long call-out. ", "rescue_info": " Incident started at 17:12 and ended at 21:08 making 3.9 hrs in total. There were 16 Wasdale team members involved and the incident occured at NY 215072. Total rescuer hours: 62", "start_time": "17:12", "end_time": "21:08", "hrs": "3.9", "staff": "16", "location": "NY 215072", "total_hrs": "62"}, {"title": "Slight Side, Scafell – Tue 25th Mar 2025", "date": "25 Mar 2025", "Incident": "27 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Slight Side, Scafell", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Knee Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/slight-side-scafell-tue-25th-mar-2025", "main_text": "The team was called out by Cumbria Police to help a walker who had sustained a knee injury and was struggling to descend back to Wha House. The team was called out but as the walker was able to make slow progress with the assistance of other walkers, a small party was dispatched to assist. Under the watchful eye of the Team Leader with regular PhoneFinds the walker was able to complete a slow descend successfully. The Wasdale MR party met up with the group later in their descent. Our thanks to the injured walker for her determination and to the other walkers who helped. We wish her a quick recovery. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 13:28 and ended at 17:55 making 4.5 hrs in total. There were 15 Wasdale team members involved and the incident occured at NY 209048. Total rescuer hours: 68", "start_time": "13:28", "end_time": "17:55", "hrs": "4.5", "staff": "15", "location": "NY 209048", "total_hrs": "68"}]