[{"title": "Scafell – Mon 24th Mar 2025", "date": "24 Mar 2025", "Incident": "26 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Scafell", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Air Ambulance", "Coastguard", "Cumbria Police", "Helimed 58", "Rescue 199 from Prestwick"], "Diagnosis": "Multiple Injuries", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-mon-24th-mar-2025/", "main_text": "The team was called out on Monday afternoon by Cumbria Police about a serious incident involving a fallen climber. Two climbers were ascending a crag on Sca Fell, when the lead climber took a large fall. He was seriously injured, unable to communicate and ended the fall suspended on the rope below the second climber. Fortunately, the second climber was uninjured and still secure on the crag, but urgently needed assistance.\nThe team was very quickly called out and help was requested from a Coastguard helicopter. Helimed 58 also responded quickly. As the team assembled at Brackenclose and prepared the large inventory of rope rescue, medical and other equipment required for a hugely challenging technical rescue, Rescue 199 arrived overhead. With the backup plan to uplift team members high on Sca Fell, saving significant time and effort for team members to get close to the scene, the crew of Rescue 199 took a close look at whether a winch rescue was possible. After some time carefully assessing the risks to all involved, an attempt to winch was made. We don’t normally use superlatives, but with some truly amazing and heroic flying skills and teamwork, they managed to both access and then safely winch the climber directly into the helicopter from his suspended position on the end of the rope. A transfer to Helimed 58 was then completed to allow advanced medical care to be given, before then flying to a suitable hospital.\nWith the most urgent rescue completed by the helicopter crews, the rescue of the second climber still remained on what is one of the most inaccessible points of the Wasdale MR area. With the offer of further uplift assistance from Rescue 199 still a possibility (but not a guarantee), some members of the team set off on foot with heavy loads to the top of Sca Fell. However, after a refuel of the helicopter, the remaining ten team members were very grateful to get the lift up, comfortably overtaking the hill party. At this point, the technical rope rescue began, with several hundred metres of rope and countless other pieces of equipment assuring the safety of both team members and the climber. After some time, in very cold and windy conditions at height, the first rescuer was able to be lowered to the climber. She was able to very bravely and ably assist the rescue, doing most of the work herself to climb and scramble back to safe ground.\nAfter de-rigging, the long walk down to Brackenclose was completed safely and the climber re-united with awaiting family members. The team travelled back to base and spent considerable time checking equipment for damage and resetting the vehicles, before a debrief and finally being stood down to return home.\nOur thanks to both helicopter crews, and especially the crew of Rescue 199, whose actions brought the time down for the injured climber getting to definitive medical care by many hours.\nWe wish both climbers well and offer our very best wishes that the injured climber recovers fully from his injuries. ", "rescue_info": " Incident started at 14:55 and ended at 01:49 making 10.9 hrs in total. There were 26 Wasdale team members involved and the incident occured at NY207068. Total rescuer hours: 283", "start_time": "14:55", "end_time": "01:49", "hrs": "10.9", "staff": "26", "location": "NY207068", "total_hrs": "283"}, {"title": "Upper Eskdale – Sat 22nd Mar 2025", "date": "22 Mar 2025", "Incident": "25 in 2025", "Type": "Alert — Cragfast", "Location": "Upper Eskdale", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Alert", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sat-22nd-mar-2025/", "main_text": "A short alert when a call was received from Cumbria Police about a walker who was concerned for his safety, having been separated from his walking party and was on ground with loose rock. However, after a few minutes a further call was received that the party had reunited and the walker was back on safe ground. The team was stood down. ", "rescue_info": " Incident started at 14:59 and ended at 15:17 making 0.3 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 215027. Total rescuer hours: 0.3", "start_time": "14:59", "end_time": "15:17", "hrs": "0.3", "staff": "1", "location": "NY 215027", "total_hrs": "0.3"}, {"title": "Crinkle Crags – Sat 15th Mar 2025", "date": "15 Mar 2025", "Incident": "24 in 2025", "Type": "Alert — Injured & Medical", "Location": "Crinkle Crags", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Langdale Ambleside MRT"], "Diagnosis": "Medical", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/sat-15th-mar-2025/", "main_text": "A short alert when the Team Leader was notified about an unwell walker. However as further information was obtained it was determined that the location was in Langdale Ambleside MRT’s area and after a handover they successfully completed the rescue. ", "rescue_info": " Incident started at 19:14 and ended at 19:25 making 0.2 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 249054. Total rescuer hours: 0.2", "start_time": "19:14", "end_time": "19:25", "hrs": "0.2", "staff": "1", "location": "NY 249054", "total_hrs": "0.2"}, {"title": "Lords Rake, Scafell – Fri 14th Mar 2025", "date": "14 Mar 2025", "Incident": "23 in 2025", "Type": "Full Callout — Cragfast", "Location": "Lords Rake, Scafell", "Weather": ["Cold", "Dry", "Sunny"], "Other Agencies": ["Coastguard", "Cumbria Police", "Rescue 199 from Prestwick"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/lords-rake-scafell-fri-14th-mar-2025/", "main_text": "A call was received from Cumbria Police about a lone walker who had become crag fast after veering off course whilst descending Lord’s Rake. The Team Leader was able to make contact with the walker, who was stuck on steep and icy ground in a precarious spot. The team was called out and also help was requested from a Coastguard helicopter with winching capability. Fortunately Rescue 199 from Prestwick was able to respond quickly and comfortably beat team members to the scene. They were able to locate and then winch the casualty to safety from the crag before dropping him off at Brackenclose. Our thanks go to the crew of Rescue 199 for their quick response. ", "rescue_info": " Incident started at 12:48 and ended at 15:50 making 3 hrs in total. There were 19 Wasdale team members involved and the incident occured at NY 206068. Total rescuer hours: 57", "start_time": "12:48", "end_time": "15:50", "hrs": "3", "staff": "19", "location": "NY 206068", "total_hrs": "57"}, {"title": "Scafell Pike – Wed 12th Mar 2025", "date": "12 Mar 2025", "Incident": "22 in 2025", "Type": "Alert — Lost", "Location": "Scafell Pike", "Weather": ["Cold", "Showers", "Windy"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-wed-12th-mar-2025/", "main_text": "A short alert for the Team Leader when Cumbria Police was called about three walkers who had asked for help high on Scafell Pike. A poor signal meant the information received was patchy. It appeared that they may have been caught in a wintry shower or that winter conditions underfoot were causing concern. However, a short while later, a further call was received stating that they were now out of danger and did not require MR assistance. ", "rescue_info": " Incident started at 13:30 and ended at 13:57 making 0.5 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 217075. Total rescuer hours: 0.5", "start_time": "13:30", "end_time": "13:57", "hrs": "0.5", "staff": "1", "location": "NY 217075", "total_hrs": "0.5"}, {"title": "Lingmell Col, Scafell Pike – Sat 8th Mar 2025", "date": "8 Mar 2025", "Incident": "21 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police", "Great North Air Ambulance", "Helimed 58"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-col-scafell-pike-sat-8th-mar-2025-2/", "main_text": "As incident No.20 was being assessed, a further call came in from Cumbria Police. Another walker had fallen and suffered a serious ankle injury, very close to the location of the ongoing callout. The team were already mobilised, but due to the nature of the injury helicopter support was also requested. Helimed 58 from Langwathby responded quickly and they were able to land close to the scene and provide the medical assessment and care required. However, the team was still required to provide support for the stretcher carry to the helicopter. This was completed and then the team members descended in case a stretcher carry was needed for the previous callout. This was not required and so returned to base to reset the vehicles in readiness for the next tasking. We wish the walker a quick recovery from his injury and thank the Helimed 58 crew for their help. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 14:38 and ended at 19:56 making 5.3 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 211077. Total rescuer hours: 106", "start_time": "14:38", "end_time": "19:56", "hrs": "5.3", "staff": "20", "location": "NY 211077", "total_hrs": "106"}, {"title": "Lingmell Col, Scafell Pike – Sat 8th Mar 2025", "date": "8 Mar 2025", "Incident": "20 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-col-scafell-pike-sat-8th-mar-2025/", "main_text": "A call was received from Cumbria Police about a walker who had slipped on scree, injured his ankle, and was finding it difficult to continue. The Team Leader was able to make contact, and as the walker was willing and able to make slow progress, he was advised to keep moving to stay warm. The team was called out and met the walker stoically descending. After an assessment, it was agreed that it was safe to continue under his own steam. The slow walk to Brackenclose was successfully completed by the walker, escorted by some team members, with others diverted to another callout higher up on the mountain. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 14:01 and ended at 19:57 making 5.9 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 211076. Total rescuer hours: 118", "start_time": "14:01", "end_time": "19:57", "hrs": "5.9", "staff": "20", "location": "NY 211076", "total_hrs": "118"}, {"title": "Miterdale – Fri 7th Mar 2025", "date": "7 Mar 2025", "Incident": "19 in 2025", "Type": "Limited Callout — Lost", "Location": "Miterdale", "Weather": ["Clear", "Cold", "Dry"], "Tagged": ["Lost"], "Incident_Type": "Limited Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/mitredale-fri-7th-mar-2025/", "main_text": "A straightforward callout was swiftly resolved after two walkers had separated in a walk in Miterdale forest. One had become lost and needed some help to return to her vehicle as darkness was starting to fall. Two local team members volunteered to attend and were able to quickly locate the first walker and escort her down. The two walkers were then reunited at their vehicle, and the log was closed. ", "rescue_info": " Incident started at 17:57 and ended at 19:12 making 1.3 hrs in total. There were 4 Wasdale team members involved and the incident occured at NY 14700 01100. Total rescuer hours: 5", "start_time": "17:57", "end_time": "19:12", "hrs": "1.3", "staff": "4", "location": "NY 14700 01100", "total_hrs": "5"}, {"title": "Scafell Pike – Thu 6th Mar 2025", "date": "6 Mar 2025", "Incident": "18 in 2025", "Type": "Full Callout — Lost", "Location": "Scafell Pike", "Weather": ["Cloudy Summits", "Cold", "Mist", "Rain"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-thu-6th-mar-2025/", "main_text": "A full callout was initiated on Thursday after a call from Cumbria Police. Two walkers had been ascending Scafell Pike and separated at Lingmell Col when one wanted to make the summit and the other stayed behind. Visibility was poor with mist and rain and with darkness setting in, both walkers became lost with no head torches and called for help. A Phonefind located the walker at Lingmell Col, but the accuracy from the initial police call coordinates gave a reasonably wide search radius for the one higher up. Faced with the possibility of a search in poor conditions further help was requested from Duddon And Furness MRT. The team were able to locate the walker at Lingmell Col in the location expected. The second walker was also found after a brief search, however, was very cold and wet. Fortunately after a change of clothes and some rewarming he was able to also walk off back to Brackenclose to be reunited with his walking partner. Some lessons were learned by the walkers, after setting off very late in the day. Thanks to Duddon and Furness MRT for their support once again. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 18:56 and ended at 01:38 making 6.7 hrs in total. There were 18 Wasdale team members involved and the incident occured at NY 211077. Total rescuer hours: 121", "start_time": "18:56", "end_time": "01:38", "hrs": "6.7", "staff": "18", "location": "NY 211077", "total_hrs": "121"}, {"title": "Scafell Pike – Mon 3rd Mar 2025", "date": "3 Mar 2025", "Incident": "17 in 2025", "Type": "Limited Callout — Cragfast", "Location": "Scafell Pike", "Weather": ["Cloudy Summits", "Cold", "Drizzle"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Limited Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-mon-3rd-mar-2025/", "main_text": "The team was called by Cumbria Police about two inexperienced walkers who were not able to get down from the summit in dark and misty conditions and were getting increasingly cold. The Team Leader was able to talk to the walkers; the main problem was that they had no head torches to enable a safe guided ‘walk-off’. They agreed to stay put and wait for help. A limited callout was made and some members were diverted from the ongoing team training. Once on scene at the summit, head torches and extra clothing was provided and the two walkers escorted back to their vehicle at Brackenclose. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 19:20 and ended at 01:24 making 6.1 hrs in total. There were 11 Wasdale team members involved and the incident occured at NY 215073. Total rescuer hours: 67", "start_time": "19:20", "end_time": "01:24", "hrs": "6.1", "staff": "11", "location": "NY 215073", "total_hrs": "67"}, {"title": "Scafell Pike – Sun 2nd Mar 2025", "date": "2 Mar 2025", "Incident": "16 in 2025", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sun-2nd-mar-2025/", "main_text": "The Duty Team Leader was alerted when a concerned family member called Cumbria Police. A group of four inexperienced walkers had ascended Scafell Pike, but had not been contactable for many hours. Their cars were still at Seathwaite. As information was gathered, it transpired that the group were planning on camping overnight. With the local knowledge that it was quite likely that the group had no mobile signal in this area, it was deemed that no immediate response was necessary. The Keswick MRT Team Leader was also notified for awareness. In the morning, one of the walkers was able to be contacted on their descent and confirmed that they had been camping in the Sprinkling Tarn area and were all safe and well. ", "rescue_info": " Incident started at 02:03 and ended at 08:50 making 6.8 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 24195 07978. Total rescuer hours: 7", "start_time": "02:03", "end_time": "08:50", "hrs": "6.8", "staff": "1", "location": "NY 24195 07978", "total_hrs": "7"}, {"title": "Middleboot Knotts, Scafell Pike – Tue 25th Feb 2025", "date": "25 Feb 2025", "Incident": "15 in 2025", "Type": "Full Callout — Cragfast", "Location": "Middleboot Knotts, Scafell Pike", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/middleboot-knotts-scafell-pike-tue-25th-feb-2025/", "main_text": "A call was received from Cumbria Police about two walkers who were reporting themselves ‘stuck’ on their descent from Scafell Pike. The initial call coordinates put them at the ‘bad step’ on the path adjacent to the edge of Piers Gill. This is a short scramble with some exposure. A very poor mobile signal made it difficult to establish too much further information but it was clear help was needed. The team was called out and made their way to scene. Once there, the two walkers were reassured and a simple rope system was established to ensure safety and give confidence to descend to the bottom of the scramble. After they were back on safer ground the party walked off to Gavel Neese, where the team vehicles were located. Weary team members then made their way back to base. The equipment was checked and the vehicles reset ready for the next callout, before making their way home. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 21:19 and ended at 03:53 making 6.6 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 212083. Total rescuer hours: 132", "start_time": "21:19", "end_time": "03:53", "hrs": "6.6", "staff": "20", "location": "NY 212083", "total_hrs": "132"}, {"title": "Scafell Pike – Sun 23rd Feb 2025", "date": "23 Feb 2025", "Incident": "14 in 2025", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Cold", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sun-23rd-feb-2025/", "main_text": "A brief alert when the team was called by Cumbria Police about a party of three family members that were overdue and uncontactable during a walk up Scafell Pike. The Team Leader asked for car parks to be checked for the group’s vehicle, but happily as further information was being gathered contact was able to be made. All members of the party were all safe and well and got in touch when they were back in range of a mobile signal. ", "rescue_info": " Incident started at 17:39 and ended at 18:28 making 0.8 hrs in total. There was 1 Wasdale team member involved. Total rescuer hours: 0.8", "start_time": "17:39", "end_time": "18:28", "hrs": "0.8", "staff": "1", "total_hrs": "0.8"}, {"title": "Pen, Scafell Pike – Sun 16th Feb 2025", "date": "16 Feb 2025", "Incident": "13 in 2025", "Type": "Full Callout — Lost", "Location": "Pen, Scafell Pike", "Weather": ["Cold", "Dry", "Snow"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost", "PhoneFind"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/pen-scafell-pike-sun-16th-feb-2025/", "main_text": "As callout 12 was in progress another 999 call was received requesting help. Two walkers had become separated from the rest of their group and mis-navigated in misty conditions. PhoneFind established that they were near Pen off the Eskdale side of Scafell Pike summit. They were concerned for their safety and stuck on steep and icy ground. Some members of the party already on the fell agreed to ascend via Mickledore and proceeded to their location. Once on scene the walkers were reassured and assisted to descend into Upper Eskdale for an easier but longer route to safety. En route a further lost lone walker was also encountered (by good fortune) and he joined the party. After the long walk out, team members returned to base to reset the vehicles ready for the next callout. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 15:43 and ended at 21:44 making 6 hrs in total. There were 10 Wasdale team members involved and the incident occured at NY 221067. Total rescuer hours: 60", "start_time": "15:43", "end_time": "21:44", "hrs": "6", "staff": "10", "location": "NY 221067", "total_hrs": "60"}, {"title": "Lingmell Col, Scafell Pike – Sun 16th Feb 2025", "date": "16 Feb 2025", "Incident": "12 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Cold", "Dry"], "Other Agencies": ["Cumbria Police", "Helimed 63"], "Diagnosis": "Arm Injury, Head Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-col-scafell-pike-sun-16th-feb-2025/", "main_text": "A call was received from Cumbria Police regarding a walker who had fallen and injured his head and his arm. He was walking slowly downhill with other members of his group.\nThe Team Leader made contact and established that the walker had a high pain score and was still light headed so helicopter assistance was requested, alongside a full callout. Helimed 63 responded from the North East and managed to negotiate the cloud base to land close enough for the crew to walk to scene. Thankfully after an assessment the injuries were not too serious and the walker was able to walk down. Team members ascended to meet the casualty, and received a handover from the Helimed crew.\nHowever, whilst on scene another walker was passing who had also taken a fall, also with a suspected arm fracture and they were also making their own way down. With another land ambulance requested, both casualties were able to complete their descent off the fell under the watchful eyes of the team Remote Rescue Medical Technicians.\nWe wish them both a quick recovery and offer thanks to the Helimed crew for their help. ", "rescue_info": " Incident started at 13:23 and ended at 17:48 making 4.4 hrs in total. There were 13 Wasdale team members involved and the incident occured at NY 207075. Total rescuer hours: 57", "start_time": "13:23", "end_time": "17:48", "hrs": "4.4", "staff": "13", "location": "NY 207075", "total_hrs": "57"}, {"title": "Upper Eskdale – Sun 16th Feb 2025", "date": "16 Feb 2025", "Incident": "11 in 2025", "Type": "Alert — Lost", "Location": "Upper Eskdale", "Weather": ["Snow"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost", "PhoneFind"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sun-16th-feb-2025/", "main_text": "A call was received from Cumbria Police about a party of three walkers who were lost on Scafell Pike. The Team Leader was able to gain an accurate location via Phonefind, which was in Upper Eskdale, this was significantly off course for their intended destination of Wasdale. One of the walkers had a minor injury but was able to walk out, so the Team Leader guided them out over the phone and monitored with further Phonefind’s. They reached the valley safely and the log was closed later when they were back to their car. ", "rescue_info": " Incident started at 13:07 and ended at 16:32 making 3.4 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 20000 03300. Total rescuer hours: 3.4", "start_time": "13:07", "end_time": "16:32", "hrs": "3.4", "staff": "1", "location": "NY 20000 03300", "total_hrs": "3.4"}, {"title": "Scafell Pike – Sat 15th Feb 2025", "date": "15 Feb 2025", "Incident": "10 in 2025", "Type": "Alert — Lost", "Location": "Scafell Pike", "Weather": ["Snow"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-15th-feb-2025/", "main_text": "A short alert when a group of seven walkers were reporting themselves lost after aborting an ascent of Scafell Pike due to the winter conditions. However, as the Team Leader was gathering information it was confirmed that the group had fortunately met up with other walkers who were able to guide them safely back down to Seathwaite. ", "rescue_info": " Incident started at 15:50 and ended at 16:05 making 0.3 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21419 07047. Total rescuer hours: 0.3", "start_time": "15:50", "end_time": "16:05", "hrs": "0.3", "staff": "1", "location": "NY 21419 07047", "total_hrs": "0.3"}, {"title": "Slight Side, Scafell – Sat 15th Feb 2025", "date": "15 Feb 2025", "Incident": "9 in 2025", "Type": "Limited Callout — Cragfast", "Location": "Slight Side, Scafell", "Weather": ["Cold", "Dry", "Mist"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Panic Attack", "PhoneFind"], "Incident_Type": "Limited Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/slight-side-scafell-sat-15th-feb-2025/", "main_text": " busy weekend kicked off with a call from Cumbria Police on Saturday afternoon. Two well-prepared walkers had called for assistance as one of the walkers was suffering from a panic attack and was unable to make further progress. A location was obtained from PhoneFind. With no injuries reported, the Team Leader asked a small party to proceed to the scene and provide assistance. After the long walk-in, the two walkers were found just off the ridge but on some steep ground in extremely cold conditions. A rope rescue was required and successfully undertaken, bringing both walkers back to the ridge in turn. Once on safe ground, and after re-warming in a shelter with some additional layers, both were able to walk out unaided and were dropped off close by at their accommodation in Eskdale. We wish them both well. ", "rescue_info": " Incident started at 15:17 and ended at 00:10 making 8.9 hrs in total. There were 5 Wasdale team members involved and the incident occured at NY211056. Total rescuer hours: 45", "start_time": "15:17", "end_time": "00:10", "hrs": "8.9", "staff": "5", "location": "NY211056", "total_hrs": "45"}, {"title": "Rough Crag, Scafell Pike – Tue 11th Feb 2025", "date": "11 Feb 2025", "Incident": "8 in 2025", "Type": "Full Callout — Lost", "Location": "Rough Crag, Scafell Pike", "Weather": ["Cold", "Dry", "Mist"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/rough-crag-scafell-pike-tue-11th-feb-2025/", "main_text": "After a quiet period of over three weeks without a callout, a call was received from Cumbria Police. Two walkers had mis-navigated off Scafell Pike summit plateau in misty conditions and ended up beneath Rough Crag. In very cold conditions a full callout was made by the Team Leader, with several parties moving towards the walkers via different routes. Fortunately the walkers had been able to be guided down over the phone to Upper Eskdale, and the advance rescue team party met them walking out on the path. Both were safe and well and so all parties were stood down and walked back to the vehicles. ", "rescue_info": " Incident started at 16:03 and ended at 21:04 making 5 hrs in total. There were 25 Wasdale team members involved and the incident occured at NY 21800 06700. Total rescuer hours: 125", "start_time": "16:03", "end_time": "21:04", "hrs": "5", "staff": "25", "location": "NY 21800 06700", "total_hrs": "125"}, {"title": "Upper Eskdale – Sat 18th Jan 2025", "date": "18 Jan 2025", "Incident": "7 in 2025", "Type": "Alert — Overdue", "Location": "Upper Eskdale", "Weather": ["Clear", "Cool", "Dry"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sat-18th-jan-2025/", "main_text": "During callout 6, five inexperienced walkers were reported overdue by their friend after setting off for an impromptu walk up Scafell and Scafell Pike from Upper Eskdale. Most team members deployed for the ongoing callout in Wasdale were asked to hold for possible redeployment and additional team members were also asked for their availability. However, shortly after this another call was received, confirming that the party had just returned safe and well to a local hostelry, so the log was closed. ", "rescue_info": " Incident started at 20:07 and ended at 20:47 making 0.7 hrs in total. There were 7 Wasdale team members involved and the incident occured at NY 21793 02265. Total rescuer hours: 4.9", "start_time": "20:07", "end_time": "20:47", "hrs": "0.7", "staff": "7", "location": "NY 21793 02265", "total_hrs": "4.9"}, {"title": "Corridor Route, Scafell Pike – Sat 18th Jan 2025", "date": "18 Jan 2025", "Incident": "6 in 2025", "Type": "Full Callout — Cragfast", "Location": "Corridor Route, Scafell Pike", "Weather": ["Clear", "Cool", "Dark"], "Tagged": ["Cragfast", "Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/corridor-route-scafell-pike-tue-18th-feb-2025/", "main_text": "A call was received on Saturday evening about two walkers who had mis-navigated away from the Corridor Route aiming for Borrowdale and were concerned for their safety. A location was obtained from the initial police call. The Team Leader was able to contact the walkers and ensure that they were confident to stay in their current location and wait for the team. An advance party including Jess, our search dog, was tasked in advance of the first team vehicle. Four legs proved better than two, with Jess making a find and directing the rescuers to the two cold walkers. A careful route was then taken down some fairly steep terrain before completing an uneventful walk back to Gavel Neese. The walkers took a taxi ride back to Seathwaite before the team stood down after resetting the vehicles. (Huge thanks too for the Burnthwaite Farm brownies fresh out of the oven for the advance party) ", "rescue_info": " Incident started at 18:12 and ended at 22:42 making 4.5 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 21700 08600. Total rescuer hours: 90", "start_time": "18:12", "end_time": "22:42", "hrs": "4.5", "staff": "20", "location": "NY 21700 08600", "total_hrs": "90"}, {"title": "Hollowstones, Scafell Pike – Sun 12th Jan 2025", "date": "12 Jan 2025", "Incident": "5 in 2025", "Type": "Alert — Overdue", "Location": "Hollowstones, Scafell Pike", "Weather": ["Snow"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/hollowstones-scafell-pike-sun-12th-jan-2025/", "main_text": "A call was received from Cumbria Police about two walkers who were reported as being lost in the snow. They had reported this to friends who had then called the police when they became overdue. Happily, as the Team Leader was gathering information and considering calling the team out, another call was taken by the police confirming they had made it safely down to the valley and were at their vehicle. ", "rescue_info": " Incident started at 18:06 and ended at 18:37 making 0.5 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 20620 07239. Total rescuer hours: 0.5", "start_time": "18:06", "end_time": "18:37", "hrs": "0.5", "staff": "1", "location": "NY 20620 07239", "total_hrs": "0.5"}, {"title": "Birker Fell – Thu 9th Jan 2025", "date": "9 Jan 2025", "Incident": "4 in 2025", "Type": "Limited Callout — Other", "Location": "Birker Fell", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Vehicle"], "Incident_Type": "Limited Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/birker-fell-thu-9th-jan-2025/", "main_text": "A call was received from Cumbria Police to assist with helping a stranded motorist off Birker Fell and back to safe ground after a road traffic accident. A limited callout was made to take a team 4×4 vehicle to the scene and assist, however a team member in the valley was able to get to the location quickly and provide assistance to walk off. ", "rescue_info": " Incident started at 22:32 and ended at 23:47 making 1.3 hrs in total. There were 8 Wasdale team members involved and the incident occured at SD 161993. Total rescuer hours: 10", "start_time": "22:32", "end_time": "23:47", "hrs": "1.3", "staff": "8", "total_hrs": "10"}, {"title": "Scafell Pike – Mon 6th Jan 2025", "date": "6 Jan 2025", "Incident": "3 in 2025", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Cumbria Police", "Langdale Ambleside MRT"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/langdale-mon-6th-jan-2025/", "main_text": "A call was received from Cumbria Police from a relative of a lone walker. He had not been in contact for over 24 hours, having known to have been on Scafell Pike on Sunday morning. He had subsequently sent a video from an unknown location at 2pm.\nOnce the video was reviewed, it was possible that it was taken from the Rosset Gill area and as such our neighbours at Langdale Ambleside MRT were asked for their opinion. However, shortly afterwards there was another call from the informant saying that the walker was safe and well and on his way home. This news was very gratefully received by both teams and the log closed. ", "rescue_info": " Incident started at 20:52 and ended at 22:27 making 1.6 hrs in total. There were 7 Wasdale team members involved and the incident occured at NY 21784 07574. Total rescuer hours: 11", "start_time": "20:52", "end_time": "22:27", "hrs": "1.6", "staff": "7", "location": "NY 21784 07574", "total_hrs": "11"}, {"title": "Upper Eskdale – Sun 5th Jan 2025", "date": "5 Jan 2025", "Incident": "2 in 2025", "Type": "Full Callout — Lost", "Location": "Upper Eskdale", "Weather": ["Cloudy Summits", "Cold"], "Other Agencies": ["Coastguard", "Cumbria Police", "Rescue 199 from Prestwick"], "Diagnosis": "Hypothermia", "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sun-5th-jan-2025/", "main_text": "An alert was received this morning from Cumbria Police about a party of five walkers who were reporting themselves close to hypothermia. The information came via an iPhone emergency satellite message so further information was initially quite limited. Helpfully an exact location was obtained, although this was in a remote area in Upper Eskdale. Further information received via another message indicated that one person was also ill, and another had injured his ankle. They had misnavigated off Scafell Pike summit, attempting to return to Seathwaite. The Team Leader swiftly made a full callout and asked an advance party of two to make their way as quickly as possible to the location. A Coastguard helicopter from Prestwick (Rescue 199) also responded quickly. The assumption at this stage was that the walkers had been lost since the previous afternoon. Further iPhone emergency messages indicated the party was moving down the valley towards the road, although for a time it was unclear whether this was the whole group or just one or two people. Thankfully the advance party had not travelled too far when they met up with the party of five walking out. All were safe and able to complete the journey to the road and then to a local hostelry, where they could organise a taxi back to Borrowdale. The debrief ascertained that the group had set off from North Yorkshire at midnight, arrived at Seathwaite and then set off on their walk at 4am. They had made the summit of Scafell Pike but then found themselves in Upper Eskdale; cold, wet and concerned for their safety. They were not equipped properly for full winter conditions on the high fells, and were also inexperienced. At times they were waist deep in snow. To their credit, they fully acknowledged their misjudgment in this attempt and were humble and thankful for the help, fully aware this could have ended with a much worse outcome. Thanks again to the support from Coastguard helicopter Rescue199. \n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 09:23 and ended at 11:57 making 2.6 hrs in total.  Incident occured at NY 229070.", "start_time": "09:23", "end_time": "11:57", "hrs": "2.6", "location": "NY 229070"}, {"title": "Whitehaven – Thu 2nd Jan 2025", "date": "2 Jan 2025", "Incident": "1 in 2025", "Type": "Limited Callout — Injured & Medical", "Location": "Whitehaven", "Weather": ["Cold", "Dry", "Sunny"], "Other Agencies": ["North West Ambulance Service"], "Diagnosis": "Leg Injury", "Tagged": ["Ambulance Assist"], "Incident_Type": "Limited Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/whitehaven-thu-2nd-jan-2025/", "main_text": "A short ambulance assist was required for a man who had fallen and sustained a broken leg whilst visiting a cemetery in Whitehaven. The North West Ambulance Service team was on scene but needed some help for the transfer to the ambulance.  A limited callout was made and some local team members attended direct with others ready at base if further team equipment or people were needed. However, the extra help at base was not needed and the transfer to the ambulance was completed quickly under the direction of NWAS. We wish the man a speedy recovery. ", "rescue_info": " Incident started at 12:08 and ended at 13:02 making 0.9 hrs in total. There were 8 Wasdale team members involved and the incident occured at NX 97500 16600. Total rescuer hours: 7", "start_time": "12:08", "end_time": "13:02", "hrs": "0.9", "staff": "8", "total_hrs": "7"}, {"title": "Wastwater Screes – Sat 28th Dec 2024", "date": "28 Dec 2024", "Incident": "168 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Wastwater Screes", "Weather": ["Cold", "Drizzle"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Leg Injury", "Tagged": ["Boat", "Screes"], "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/wastwater-screes-sat-28th-dec-2024/", "main_text": "The 168th 999 alert for the year makes 2024 a new record for the team. Cumbria Police requested help from the team for a party of 7 walkers, one of whom had pulled a muscle whilst walking on the Screes near the lakeshore. A full callout was made, and both a boat team and a party on foot were directed to the scene. The foot party arrived first and assessed the injured walker, and another in the party who had also injured their leg. All in the walking party were cold and wet. Fortunately the injuries were not severe which enabled straightforward transfers to the boat and then journeys to the shore at the pump house. We hope the walkers recover quickly from their injuries. ", "rescue_info": " Incident started at 21:26 and ended at 02:00 making 4.6 hrs in total. There were 11 Wasdale team members involved and the incident occured at NY 157050. Total rescuer hours: 51", "start_time": "21:26", "end_time": "02:00", "hrs": "4.6", "staff": "11", "location": "NY 157050", "total_hrs": "51"}, {"title": "Brown Tongue, Scafell Pike – Thu 26th Dec 2024", "date": "26 Dec 2024", "Incident": "167 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Mild", "Mist"], "Diagnosis": "Knee Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-thu-26th-dec-2024/", "main_text": "A call was received yesterday about a lone walker who was struggling to make progress with a painful knee injury. A passing walker had stopped to help and made the call. A few minutes later further information was reported with the walker feeling unwell. A team member was already on the fell and made his way quickly down to the walker. After an assessment, and with the walker feeling better at this point, he was able to descend slowly without additional support. Most of the team members remained at base until it was confirmed that the hill party had made it safely down to Brackenclose.\nWe wish the walker well and our thanks go to the passing walker for his initial help. ", "rescue_info": " Incident started at 15:42 and ended at 17:49 making 2.1 hrs in total. There were 21 Wasdale team members involved and the incident occured at NY 19600 07400. Total rescuer hours: 44", "start_time": "15:42", "end_time": "17:49", "hrs": "2.1", "staff": "21", "location": "NY 19600 07400", "total_hrs": "44"}, {"title": "Hardknott Pass – Tue 24th Dec 2024", "date": "24 Dec 2024", "Incident": "166 in 2024", "Type": "Alert — Other", "Location": "Hardknott Pass", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Vehicle"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/hardknott-pass-tue-24th-dec-2024/", "main_text": "A call was received from Cumbria Police on Christmas Eve. A very broken mobile call was passed through with very vague details but included the words ‘Scafell’, ‘foggy’ and ‘van’. The mobile number was unconfirmed. With very little to go on, the Team Leader asked a team member to check out the Wasdale car parks, with nothing significant found. After some time, a further call was received, the informant’s van had broken down on Hardknott Pass in a precarious position. Happily the occupants were safe and well and at the nearest farm, and the prospect of a late night Christmas Eve callout averted. ", "rescue_info": " Incident started at 20:11 and ended at 22:46 making 2.6 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 23580 01507. Total rescuer hours: 5", "start_time": "20:11", "end_time": "22:46", "hrs": "2.6", "staff": "2", "location": "NY 23580 01507", "total_hrs": "5"}, {"title": "Scafell Pike – Sat 21st Dec 2024", "date": "21 Dec 2024", "Incident": "165 in 2024", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Windy"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-21st-dec-2024/", "main_text": "A short alert for the Team Leader when a walker called Cumbria Police concerned for their friends’ safety. A party of 20 walkers had set off to climb Scafell Pike, with 5 turning around, concerned about the weather and the lack of daylight remaining. As the Team Leader was gathering further information there was another call confirming that the group was all safe and nearly back at the car park. They had wisely turned around before ascending to the summit in poor conditions. ", "rescue_info": " Incident started at 15:30 and ended at 16:12 making 0.7 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 19225 07335. Total rescuer hours: 0.7", "start_time": "15:30", "end_time": "16:12", "hrs": "0.7", "staff": "1", "location": "NY 19225 07335", "total_hrs": "0.7"}, {"title": "Hollowstones, Scafell Pike – Tue 17th Dec 2024", "date": "17 Dec 2024", "Incident": "164 in 2024", "Type": "Alert — Lost", "Location": "Hollowstones, Scafell Pike", "Weather": ["Cold", "Mist"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/hollowstones-scafell-pike-tue-17th-dec-2024/", "main_text": "A call was received from Cumbria Police about a walker who had become disoriented in misty conditions on his descent from Scafell Pike. The Team Leader managed to establish an exact location via Phonefind and was able to confirm that he was now on the correct path. After a brief phone call the walker was able and willing to complete his descent unaided and contacted the police when he was safely off the fell. ", "rescue_info": " Incident started at 14:12 and ended at 15:30 making 1.3 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 207075. Total rescuer hours: 2.6", "start_time": "14:12", "end_time": "15:30", "hrs": "1.3", "staff": "2", "location": "NY 207075", "total_hrs": "2.6"}, {"title": "Lingmell Col, Scafell Pike – Sat 14th Dec 2024", "date": "14 Dec 2024", "Incident": "163 in 2024", "Type": "Alert — Lost", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Cloudy Summits", "Cold", "Windy"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/lingmell-col-scafell-pike-sat-14th-dec-2024/", "main_text": "A call was received from Cumbria Police about two walkers who had become disoriented on their descent, turning towards Piers Gill rather than Wasdale at Lingmell Col. The Team Leader managed to establish their exact location via Phonefind directed them to the correct path. Regular updates from Phonefind made this a ‘dot watching’ exercise back to the valley floor, after which the team was stood down and the log closed. ", "rescue_info": " Incident started at 17:10 and ended at 19:11 making 2 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 212078. Total rescuer hours: 2", "start_time": "17:10", "end_time": "19:11", "hrs": "2", "staff": "1", "location": "NY 212078", "total_hrs": "2"}, {"title": "Scafell – Thu 12th Dec 2024", "date": "12 Dec 2024", "Incident": "162 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Scafell", "Weather": ["Cloudy Summits", "Cold", "Dry"], "Other Agencies": ["Coastguard", "Cumbria Police", "Great North Air Ambulance", "Helimed 58", "Rescue 199 from Prestwick"], "Diagnosis": "Arm Injury", "Tagged": ["Fell Runner"], "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-thu-12th-dec-2024/", "main_text": "A call was received from Cumbria Police about a lone fell runner who had slipped on a steep descent on the flanks of Sca Fell, sustaining an extremely painful upper arm and/or shoulder injury. This rendered her unable to move at all. A callout was swiftly made and several team members were also available to travel direct to the scene. Additional support was requested from Helimed assets but unfortunately due to weather conditions and cloud cover they had to abort. Once on scene the increasingly cold runner was assessed and provided with additional shelter and insulation. A Coastguard helicopter with winching capability was then requested to help with a swift evacuation, with Rescue 199 from Prestwick quickly responding. Strong pain relief was given to the runner to make her as comfortable as possible, before transferring to a vacuum mattress (full body splint) and team stretcher in readiness for the winch evacuation. Rescue 199 arrived on scene and winched the runner on board before a transfer to hospital. Thanks to all three helicopter crews for their rapid support. We’d like also to wish the runner a very swift and full recovery. She was 42 miles into a solo Bob Graham Round attempt, so hopefully once recovered she will return to complete the challenge. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 13:29 and ended at 18:17 making 4.8 hrs in total. There were 18 Wasdale team members involved and the incident occured at NY 193072. Total rescuer hours: 86", "start_time": "13:29", "end_time": "18:17", "hrs": "4.8", "staff": "18", "location": "NY 193072", "total_hrs": "86"}, {"title": "Scafell – Sat 30th Nov 2024", "date": "30 Nov 2024", "Incident": "161 in 2024", "Type": "Alert — Cragfast", "Location": "Scafell", "Weather": ["Cloudy Summits", "Windy"], "Tagged": ["Cragfast"], "Incident_Type": "Alert", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/scafell-sat-30th-nov-2024/", "main_text": "", "rescue_info": " Incident started at 01:56 and ended at 04:47 making 2.9 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 20600 06500. Total rescuer hours: 2.9", "start_time": "01:56", "end_time": "04:47", "hrs": "2.9", "staff": "1", "location": "NY 20600 06500", "total_hrs": "2.9"}, {"title": "Wastwater Screes – Sat 16th Nov 2024", "date": "16 Nov 2024", "Incident": "160 in 2024", "Type": "Full Callout — Cragfast", "Location": "Wastwater Screes", "Weather": ["Cloudy Summits"], "Tagged": ["Boat", "Cragfast", "Screes"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/wastwater-screes-sat-16th-nov-2024/", "main_text": "", "rescue_info": " Incident started at 16:49 and ended at 20:02 making 3.2 hrs in total. There were 14 Wasdale team members involved and the incident occured at NY 15200 04600. Total rescuer hours: 45", "start_time": "16:49", "end_time": "20:02", "hrs": "3.2", "staff": "14", "location": "NY 15200 04600", "total_hrs": "45"}, {"title": "Hollowstones, Scafell Pike – Sat 16th Nov 2024", "date": "16 Nov 2024", "Incident": "159 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Hollowstones, Scafell Pike", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/sat-16th-nov-2024/", "main_text": "A call was received from Cumbria Police about a walker who had slipped, injured his ankle and was unable to bear any weight. The team was called out and made their way to the scene. On arrival the walker had continued to make progress downhill by hopping supported by his walking poles. However there was still approximately 400m to descend and so it was decided that the best course of action was to stretcher off. The ankle was splinted and the routine stretcher carry was made to Brackenclose. The walker’s friends took him to hospital for further assessment. We wish the walker well and hope that the injury heals quickly. ", "rescue_info": " Incident started at 15:44 and ended at 20:45 making 5 hrs in total. There were 15 Wasdale team members involved and the incident occured at NY 20300 07300. Total rescuer hours: 75", "start_time": "15:44", "end_time": "20:45", "hrs": "5", "staff": "15", "location": "NY 20300 07300", "total_hrs": "75"}, {"title": "Hardknott Pass – Sat 16th Nov 2024", "date": "16 Nov 2024", "Incident": "158 in 2024", "Type": "Alert — Other", "Location": "Hardknott Pass", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/hardknott-pass-sat-16th-nov-2024/", "main_text": "A call was received from Cumbria Police from a person at a campsite in Eskdale. A member of their family had not been heard from for some time after their car had come off the road on Hardknott Pass at 10pm the previous evening. The driver was an experienced walker and well prepared for camping but concern grew when he could not be contacted. The Team Leader asked a local team member to investigate but shortly afterwards the police managed to make contact. The driver was safe and well and the team was not needed to assist so the log was closed. ", "rescue_info": " Incident started at 06:01 and ended at 06:52 making 0.9 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 23000 01400. Total rescuer hours: 1.8", "start_time": "06:01", "end_time": "06:52", "hrs": "0.9", "staff": "2", "location": "NY 23000 01400", "total_hrs": "1.8"}, {"title": "Scafell Pike – Sat 9th Nov 2024", "date": "9 Nov 2024", "Incident": "157 in 2024", "Type": "Alert — Lost", "Location": "Scafell Pike", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police", "Duddon & Furness MRT"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-9th-nov-2024/", "main_text": "A call was received from Cumbria Police about two walkers who had mis-navigated on the descent from Scafell Pike. Our friends from Duddon and Furness MRT had agreed to cover the patch as many members of the team were attending the happy event of the wedding of our Medical Officer and our IT Officer. They successfully resolved the incident and were back at their base for the early evening. Thanks to Duddon and Furness MRT once again, and huge congratulations to Lucy and Paul. ", "rescue_info": " Incident started at 16:00 and ended at 16:34 making 0.6 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 23456 04387. Total rescuer hours: 0.6", "start_time": "16:00", "end_time": "16:34", "hrs": "0.6", "staff": "1", "location": "NY 23456 04387", "total_hrs": "0.6"}, {"title": "Cross Fell – Wed 6th Nov 2024", "date": "6 Nov 2024", "Incident": "156 in 2024", "Type": "Full Callout — Lost", "Location": "Cross Fell", "Weather": ["Mist"], "Other Agencies": ["Penrith MRT"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/cross-fell-wed-6th-nov-2024/", "main_text": "The team was asked to support Penrith MRT in an escalating search from the previous night. Happily, the walker was found well before WMRT  deployment onto the fell in the Pennines. A great outcome. ", "rescue_info": " Incident started at 08:23 and ended at 09:54 making 1.5 hrs in total. There were 7 Wasdale team members involved and the incident occured at NY 68712 34201. Total rescuer hours: 11", "start_time": "08:23", "end_time": "09:54", "hrs": "1.5", "staff": "7", "location": "NY 68712 34201", "total_hrs": "11"}, {"title": "Scafell Pike – Mon 4th Nov 2024", "date": "4 Nov 2024", "Incident": "155 in 2024", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Other Agencies": ["Cumbria Police"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-mon-4th-nov-2024/", "main_text": "An alert from Cumbria Police was quickly resolved when two walkers were reported overdue from a walk up Scafell Pike. As soon as a standby been sent to the team, there was a confirmation that the police had managed to contact one of the walkers. They were safe and well and almost back to the valley floor, so the team was stood down. ", "rescue_info": " Incident started at 19:22 and ended at 19:30 making 0.1 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21601 07311. Total rescuer hours: 0.1", "start_time": "19:22", "end_time": "19:30", "hrs": "0.1", "staff": "1", "location": "NY 21601 07311", "total_hrs": "0.1"}, {"title": "Mecklin Wood, Wasdale – Sat 2nd Nov 2024", "date": "2 Nov 2024", "Incident": "154 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Mecklin Wood, Wasdale", "Weather": ["Cloudy Summits", "Mist"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Knee Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/mecklin-wood-wasdale-sat-2nd-nov-2024/", "main_text": "A further call from Cumbria Police was received on Saturday as incident 153 was in progress. A walker has fallen, twisted his leg and sustained a suspected painful dislocated knee. The team arrived quickly and assessed the walker. Pain relief was administered and the injured leg splinted. A short stretcher carry was then made to the roadside after which it was agreed that the walker could be taken to hospital in a friend’s car. We wish him a quick recovery. ", "rescue_info": " Incident started at 14:46 and ended at 16:51 making 2.1 hrs in total. There were 14 Wasdale team members involved and the incident occured at NY 12000 02300. Total rescuer hours: 29", "start_time": "14:46", "end_time": "16:51", "hrs": "2.1", "staff": "14", "location": "NY 12000 02300", "total_hrs": "29"}, {"title": "Stirrup Crag, Yewbarrow – Sat 2nd Nov 2024", "date": "2 Nov 2024", "Incident": "153 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Stirrup Crag, Yewbarrow", "Weather": ["Cloudy Summits", "Mist"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/stirrup-crag-yewbarrow-sat-2nd-nov-2024/", "main_text": "The team was called on Saturday afternoon regarding a walker who had slipped, injured her ankle and was unable to mobilise further. The Team Leader initiated a full callout, and with the injured walker in mist, helicopter support was not possible. Team members made their way to the scene and then assessed the injury, gave pain relief and splinted the ankle. A stretcher carry was completed to Overbeck car park, after which a taxi was taken for onwards transfer to hospital. We wish the walker a quick recovery from her injury. ", "rescue_info": " Incident started at 13:49 and ended at 19:32 making 5.7 hrs in total. There were 21 Wasdale team members involved and the incident occured at NY 17300 09200. Total rescuer hours: 120", "start_time": "13:49", "end_time": "19:32", "hrs": "5.7", "staff": "21", "location": "NY 17300 09200", "total_hrs": "120"}, {"title": "Scafell Pike – Fri 1st Nov 2024", "date": "1 Nov 2024", "Incident": "152 in 2024", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Cloudy Summits"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-fri-1st-nov-2024/", "main_text": "A short alert was swiftly resolved after a family member reported two walkers overdue after summiting Scafell Pike earlier in the afternoon. As the Team Leader was gathering information having put the team on standby, the good news was received that the overdue walkers had been in contact and were safe and well. ", "rescue_info": " Incident started at 17:41 and ended at 17:57 making 0.3 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 21686 07043. Total rescuer hours: 0.6", "start_time": "17:41", "end_time": "17:57", "hrs": "0.3", "staff": "2", "location": "NY 21686 07043", "total_hrs": "0.6"}, {"title": "Bursting Knott, Sty Head – Wed 30th Oct 2024", "date": "30 Oct 2024", "Incident": "151 in 2024", "Type": "Limited Callout — Lost", "Location": "Bursting Knott, Sty Head", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Benighted", "Lost"], "Incident_Type": "Limited Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/bursting-knott-sty-head-wed-30th-oct-2024/", "main_text": "A call was received from Cumbria Police about a walking group of four who had taken a wrong turn on the descent from Scafell Pike, heading for Seathwaite. They were advised to continue their descent towards Wasdale as the quickest way to safety. A limited callout was made for a small party to meet them, escort them down to the team vehicle at Gavel Neese and then transfer them to Wasdale Head. They then arranged a taxi for the return to Borrowdale. ", "rescue_info": " Incident started at 18:42 and ended at 20:55 making 2.2 hrs in total. There were 5 Wasdale team members involved and the incident occured at NY 21200 09400. Total rescuer hours: 11", "start_time": "18:42", "end_time": "20:55", "hrs": "2.2", "staff": "5", "location": "NY 21200 09400", "total_hrs": "11"}, {"title": "Corridor Route, Scafell Pike – Wed 30th Oct 2024", "date": "30 Oct 2024", "Incident": "150 in 2024", "Type": "Full Callout — Other", "Location": "Corridor Route, Scafell Pike", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police", "Keswick MRT"], "Tagged": ["Benighted"], "Incident_Type": "Full Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/corridor-route-scafell-pike-wed-30th-oct-2024/", "main_text": "The team was called by Cumbria Police about two walkers who called for MRT help as the light was fading. It proved difficult for reliable communications to be established but from the phone coordinates on a second call they had made progress from Skew Gill well past Sty Head Tarn towards Seathwaite. As this was now in Keswick MRT’s area, the log was transferred across and they successfully oversaw the walkers making it back to their car safe and well. ", "rescue_info": " Incident started at 17:17 and ended at 18:02 making 0.8 hrs in total. There were 5 Wasdale team members involved and the incident occured at NY 22100 09100. Total rescuer hours: 4", "start_time": "17:17", "end_time": "18:02", "hrs": "0.8", "staff": "5", "location": "NY 22100 09100", "total_hrs": "4"}, {"title": "Great Rigg – Wed 30th Oct 2024", "date": "30 Oct 2024", "Incident": "149 in 2024", "Type": "Full Callout — Overdue", "Location": "Great Rigg", "Weather": ["Cloudy Summits"], "Other Agencies": ["Langdale Ambleside MRT"], "Tagged": ["Overdue", "Paraglider"], "Incident_Type": "Full Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/wed-30th-oct-2024/", "main_text": "The team was put on standby on Tuesday evening to be ready to assist in the callout below on Wednesday. One of our drone pilots was deployed but just as he was about to fly there was a find  and he became part of the response team. All in all a great outcome with some fantastic teamwork from all teams. We wish the casualty a quick recovery. ", "rescue_info": " Incident started at 08:00 and ended at 13:54 making 5.9 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 35552 10655. Total rescuer hours: 12", "start_time": "08:00", "end_time": "13:54", "hrs": "5.9", "staff": "2", "location": "NY 35552 10655", "total_hrs": "12"}, {"title": "Wasdale – Wed 23rd Oct 2024", "date": "23 Oct 2024", "Incident": "148 in 2024", "Type": "Alert — Other", "Location": "Wasdale", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/wasdale-wed-23rd-oct-2024/", "main_text": "The team was called briefly by Cumbria Police to assist them with a search for a missing person. A family member was concerned for their safety. However, as the Team Leader was requesting the closest team members to search car parks for a vehicle, the police confirmed that they had located him in the valley and that he was safe. ", "rescue_info": " Incident started at 20:45 and ended at 20:59 making 0.2 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 16690 06598. Total rescuer hours: 0.4", "start_time": "20:45", "end_time": "20:59", "hrs": "0.2", "staff": "2", "location": "NY 16690 06598", "total_hrs": "0.4"}, {"title": "Nether Wasdale, Wasdale – Sat 19th Oct 2024", "date": "19 Oct 2024", "Incident": "147 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Nether Wasdale, Wasdale", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/nether-wasdale-wasdale-sat-19th-oct-2024/", "main_text": "Medical support was requested by the Police to assist a male who was unwell . Unfortunately the man died from his injuries. Our thoughts go to his family and friends. ", "rescue_info": " Incident started at 12:48 and ended at 16:16 making 3.5 hrs in total. There were 18 Wasdale team members involved and the incident occured at NY 11276 04608. Total rescuer hours: 63", "start_time": "12:48", "end_time": "16:16", "hrs": "3.5", "staff": "18", "location": "NY 11276 04608", "total_hrs": "63"}, {"title": "Lingmell Col, Scafell Pike – Fri 18th Oct 2024", "date": "18 Oct 2024", "Incident": "146 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Cloudy Summits", "Windy"], "Other Agencies": ["Coastguard", "Cumbria Police", "Rescue 936 from Caernarfon"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/fri-18th-oct-2024/", "main_text": "The team was called by Cumbria Police about a walker who had become unwell after suffering from a suspected severe panic attack. She was unable to make further progress, having turned back before reaching the summit. A band of rain and continuing strong winds created a very cold environment with a risk of hypothermia. The team was called out quickly and, with Helimed support already committed elsewhere, and with a variable cloud base, a Coastguard helicopter was requested. Rescue 936 responded  from Caernarfon. An advance party managed to get on scene first but unfortunately the descending cloud base prevented direct helicopter support. Once on scene the walker was assessed and rewarmed with multiple dry insulating layers and heat blankets. After taking on water, glucose and further treatment, the walker had recovered significantly. An attempt to walk off was made with the stretcher now also ready to deploy and Rescue 936 standing by in the valley. Thankfully, the walker was able to make her own way off the fell with support from team members. She was then driven by her partner in their own vehicle for a further precautionary assessment at hospital. We hope she is fully recovered from her very difficult day on the fell. Thanks to the crew of Rescue 936 for their response, and also to the two walkers who stopped to help and gave up their extra layers, becoming pretty cold themselves by the time we arrived. ", "rescue_info": " Incident started at 14:27 and ended at 19:40 making 5.2 hrs in total. There were 16 Wasdale team members involved and the incident occured at NY 21000 07700. Total rescuer hours: 83", "start_time": "14:27", "end_time": "19:40", "hrs": "5.2", "staff": "16", "location": "NY 21000 07700", "total_hrs": "83"}, {"title": "River Irt – Sun 13th Oct 2024", "date": "13 Oct 2024", "Incident": "145 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "River Irt", "Weather": ["Clear", "Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Wrist Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/river-irt-sun-13th-oct-2024/", "main_text": "We were called today by Cumbria Police about a walker who had slipped and fallen, sustaining a  painful wrist injury. The team was called out and arrived on scene. Unusually it was possible to drive very close to the walker’s location. A full medical assessment was completed before administering pain relief and then splinting of the wrist. A short stretcher carry was made to a team vehicle, before transferring the walker to the vehicle of one of her walking group for the onward journey to hospital. We hope the walker recovers quickly from her injury. ", "rescue_info": " Incident started at 14:17 and ended at 16:44 making 2.5 hrs in total. There were 16 Wasdale team members involved and the incident occured at NY 14200 03800. Total rescuer hours: 40", "start_time": "14:17", "end_time": "16:44", "hrs": "2.5", "staff": "16", "location": "NY 14200 03800", "total_hrs": "40"}, {"title": "Brown Tongue, Scafell Pike – Sat 12th Oct 2024", "date": "12 Oct 2024", "Incident": "144 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Clear", "Windy"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sat-12th-oct-2024/", "main_text": "The team was called yesterday by Cumbria Police when a walker fell and sustained an injured ankle which prevented any further movement. A full callout was made with several team members deploying directly from the Wasdale Head Show which was in full swing. Once on scene the walker was assessed, before being given additional pain relief and splinting the ankle. A stretcher carry down to Brackenclose followed before a transfer to a car of the walking party for the transfer to hospital. Our thanks go to the many people that helped prior to our arrival. We wish the walker a speedy recovery and hope she is back on the fells soon. ", "rescue_info": " Incident started at 11:59 and ended at 16:16 making 4.3 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY 20100 07200. Total rescuer hours: 73", "start_time": "11:59", "end_time": "16:16", "hrs": "4.3", "staff": "17", "location": "NY 20100 07200", "total_hrs": "73"}, {"title": "Lingmell Gill Path, Scafell Pike – Fri 11th Oct 2024", "date": "11 Oct 2024", "Incident": "143 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Gill Path, Scafell Pike", "Weather": ["Windy"], "Other Agencies": ["North West Ambulance Service"], "Diagnosis": "Lower Leg Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-gill-path-scafell-pike-fri-11th-oct-2024/", "main_text": "A call was received yesterday evening from North West Ambulance Service about a walker who had fallen and sustained a suspected fracture of his lower leg. The team was swiftly called out and made their way to the reported location, which was below the stream crossing on Brown Tongue. Once on scene, the walker was assessed and given pain relief before realigning and splinting the injured leg. A short stretcher carry was made before handover to the ambulance crew at Brackenclose and subsequent transfer to hospital. We wish the walker a swift recovery from his injury. ", "rescue_info": " Incident started at 19:38 and ended at 22:28 making 2.8 hrs in total. There were 16 Wasdale team members involved and the incident occured at NY 18900 07200. Total rescuer hours: 45", "start_time": "19:38", "end_time": "22:28", "hrs": "2.8", "staff": "16", "location": "NY 18900 07200", "total_hrs": "45"}, {"title": "Scafell Pike – Sat 5th Oct 2024", "date": "5 Oct 2024", "Incident": "142 in 2024", "Type": "Alert — Injured & Medical", "Location": "Scafell Pike", "Weather": ["Windy"], "Diagnosis": "Multiple Injuries", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-5th-oct-2024-2/", "main_text": "A call was received about a walker who was struggling to descend from Scafell Pike. He was suffering from cramping of his legs and had also taken a fall suffering minor cuts to his hands. The Team Leader made contact and agreed that after taking on some salty food and some simple pain relief, the walker would attempt to descend by himself, helped by his walking partner. Happily, he managed to do this without needing further assistance, and the team was stood down when the pair reached the valley floor. ", "rescue_info": " Incident started at 17:43 and ended at 20:04 making 2.4 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 20600 07400. Total rescuer hours: 2.4", "start_time": "17:43", "end_time": "20:04", "hrs": "2.4", "staff": "1", "location": "NY 20600 07400", "total_hrs": "2.4"}, {"title": "Scafell Pike – Sat 5th Oct 2024", "date": "5 Oct 2024", "Incident": "141 in 2024", "Type": "Alert — Other", "Location": "Scafell Pike", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-5th-oct-2024/", "main_text": "A call was received on Saturday morning from Cumbria Police. A walker in a party of 6 was reported to be feeling ill on Scafell Pike, and couldn’t descend. However the call dropped out before any details could be obtained, including phone numbers. With no further calls received after an hour, a local team member was asked to investigate in the car parks at Brackenclose and Wasdale Head. Enquiries were made with larger groups, but no further information was obtained about anyone in need of help. The Team Leader closed the log later after agreement with the police to respond if further information emerged. ", "rescue_info": " Incident started at 06:39 and ended at 10:11 making 3.5 hrs in total. There were 3 Wasdale team members involved and the incident occured at NY 21600 07222. Total rescuer hours: 11", "start_time": "06:39", "end_time": "10:11", "hrs": "3.5", "staff": "3", "location": "NY 21600 07222", "total_hrs": "11"}, {"title": "St Bees Head – Thu 3rd Oct 2024", "date": "3 Oct 2024", "Incident": "140 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "St Bees Head", "Weather": ["Cloudy Summits"], "Other Agencies": ["North West Ambulance Service"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/st-bees-head-thu-3rd-oct-2024/", "main_text": "A call was received from North West Ambulance Service to assist with a transfer of a walker who had rolled on her ankle sustaining a painful fracture. Once the team was on scene a medical assessment was made with pain relief given followed by splinting of the ankle. The short stretcher carry was completed before handover was made to the ambulance crew for transfer to hospital. We hope the walker recovers quickly from her injury. ", "rescue_info": " Incident started at 12:02 and ended at 14:32 making 2.5 hrs in total. There were 13 Wasdale team members involved and the incident occured at NX 97600 13100. Total rescuer hours: 33", "start_time": "12:02", "end_time": "14:32", "hrs": "2.5", "staff": "13", "total_hrs": "33"}, {"title": "Mickledore, Scafell Pike – Sun 29th Sep 2024", "date": "29 Sep 2024", "Incident": "139 in 2024", "Type": "Alert — Lost", "Location": "Mickledore, Scafell Pike", "Weather": ["Cloudy Summits", "Rain"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/mickledore-scafell-pike-sat-28th-sep-2024/", "main_text": "A late night call was received from Cumbria Police regarding three 3-peakers who had taken a wrong turn on the summit plateau and ended up at Mickledore stretcher box, cold and wet. Other members of the wider group had made it back to the valley and had called it in. After discussion with the Team Leader, the group in the valley was able to relay route instructions to the Mickledore group via their radio, and then they started to walk up to meet the descending party with warm clothing and food. This was the quickest route for support and the Team Leader was also reluctant to call the team out again with two rescues not long completed on Friday evening. At this point two other walkers from a separate group arrived at Mickledore and helped to give confidence to the lost walkers that the route down the Mickledore gully was correct. The descent was completed without incident and once confirmation was received that the walkers were back in the valley the Team Leader stood down and closed the log. Thanks to the passing walkers who helped out. ", "rescue_info": " Incident started at 01:32 and ended at 03:28 making 1.9 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21000 06900. Total rescuer hours: 1.9", "start_time": "01:32", "end_time": "03:28", "hrs": "1.9", "staff": "1", "location": "NY 21000 06900", "total_hrs": "1.9"}, {"title": "Gavel Neese, Great Gable – Sat 28th Sep 2024", "date": "28 Sep 2024", "Incident": "138 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Gavel Neese, Great Gable", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Coastguard", "Rescue 199 from Prestwick"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/gavel-neese-great-gable-sat-28th-sep-2024/", "main_text": "A second call arrived from Cumbria Police on Friday. A lone walker had taken a tumble fall injuring his ankle on the Climber’s Traverse on Great Gable. He had managed to get to the Beck Head to Wasdale path but was unable to continue from there. Most of the team members responding to the previous incident were diverted to this callout as a higher urgency call, and proceeded to the reported location. Once on scene the walker was assessed and given pain relief, before splinting the ankle. He was then stretchered down to Gavel Neese. As Rescue 199 Coastguard helicopter had just finished supporting the Broad Stand incident, they were available to transfer the walker quickly to hospital. Thanks again to the Rescue 199 crew for their help. We wish the walker a swift recovery from his injuries and hope he is back on the fells soon. ", "rescue_info": " Incident started at 15:33 and ended at 20:54 making 5.4 hrs in total. There were 18 Wasdale team members involved and the incident occured at NY 20225 09792. Total rescuer hours: 97", "start_time": "15:33", "end_time": "20:54", "hrs": "5.4", "staff": "18", "location": "NY 20225 09792", "total_hrs": "97"}, {"title": "Broad Stand, Scafell – Fri 27th Sep 2024", "date": "27 Sep 2024", "Incident": "137 in 2024", "Type": "Full Callout — Cragfast", "Location": "Broad Stand, Scafell", "Weather": ["Clear", "Cloudy Summits"], "Other Agencies": ["Duddon & Furness MRT", "Rescue 199 from Prestwick"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/broad-stand-scafell-fri-27th-sep-2024/", "main_text": "In the first of two calls in quick succession yesterday, a passing walker at Mickledore reported a lone walker crag fast on Broad Stand. With no further information available a full callout was made. With a second call incoming shortly afterwards, additional support was requested from our friends at Duddon and Furness MRT to lead the incident on the hill. Coastguard helicopter Rescue 199 was asked to help, but conditions were not suitable for a pick-off by them. The next best option was an uplift of both Wasdale and Duddon and Furness team members with heavy ropes and equipment to the top of Broad Stand. From here a rope rescue was successfully performed with the uninjured walker lowered to Mickledore to awaiting team members. All other team members abseiled down and then walked back to Brackenclose in glorious Autumn colours. A good outcome. Thanks to both Duddon and Furness MRT and the Rescue 199 crew for their excellent support once again. ", "rescue_info": " Incident started at 15:13 and ended at 21:39 making 6.4 hrs in total. There were 7 Wasdale team members involved and the incident occured at NY 20965 06832. Total rescuer hours: 45", "start_time": "15:13", "end_time": "21:39", "hrs": "6.4", "staff": "7", "location": "NY 20965 06832", "total_hrs": "45"}, {"title": "Eskdale – Sun 22nd Sep 2024", "date": "22 Sep 2024", "Incident": "136 in 2024", "Type": "Alert — Other", "Location": "Eskdale", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Benighted"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/eskdale-sun-22nd-sep-2024/", "main_text": "A relatively brief callout after Cumbria Police called us about a pair of walkers benighted in Eskdale without head torches. This time Phonefind gave a nice result, with a location not too far from the Wha House car park (quite often at this time of night it turns out to be at the edge of our area with a five mile walk in!). Two local team members were asked to attend to locate and escort the walkers back to the road. It was also good practice for Jess in thick bracken and boulders with a find for her quickly made. ", "rescue_info": " Incident started at 22:22 and ended at 01:03 making 2.7 hrs in total. There were 3 Wasdale team members involved and the incident occured at NY 20200 01600. Total rescuer hours: 8", "start_time": "22:22", "end_time": "01:03", "hrs": "2.7", "staff": "3", "location": "NY 20200 01600", "total_hrs": "8"}, {"title": "Wasdale – Sat 21st Sep 2024", "date": "21 Sep 2024", "Incident": "135 in 2024", "Type": "Full Callout — Overdue", "Location": "Wasdale", "Weather": ["Cloudy Summits", "Dry"], "Other Agencies": ["Cumbria Police", "Duddon & Furness MRT", "Lake District Mountain Rescue Search Dogs"], "Tagged": ["Fell Runner", "Overdue"], "Incident_Type": "Full Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/wasdale-sat-21st-sep-2024/", "main_text": "A call was received from Cumbria Police about a fell runner who was overdue. A family member was reporting their concerns, expecting him back home by early evening. It was established that the runner was last heard from at 08:30am at the summit of Scafell Pike. He had planned to run for 26 miles, however, no details of routes were available. This gave a huge search area. As such, it became very important to locate the runner’s car to give further clues. Several local team members were tasked to search campsites and car parks in Wasdale and Eskdale to locate the car, with a ‘find’ being made at Wasdale Head. With confirmation that the runner had not left the valley, the team was called out alongside Duddon and Furness MRT. Search dogs were also mobilised. As planning and initial search routes were being mapped, it was with some relief that Cumbria Police located the runner at a camp site at Wasdale Head. It transpired that a simple miscommunication between family members had resulted in misplaced concern; the runner had intended to also camp in the valley for a second night, returning home the following day. All teams were stood down and were happy to get a relatively swift positive outcome to what could have been a very challenging search over vast areas, with very little information to plan from. A good reminder to tell someone of your route and intended return times in writing, especially if walking or running alone. Thanks to all MR teams and Cumbria Police for their support and teamwork. ", "rescue_info": " Incident started at 21:20 and ended at 00:29 making 3.2 hrs in total. There were 15 Wasdale team members involved and the incident occured at NY 18506 08520. Total rescuer hours: 48", "start_time": "21:20", "end_time": "00:29", "hrs": "3.2", "staff": "15", "location": "NY 18506 08520", "total_hrs": "48"}, {"title": "Brown Tongue, Scafell Pike – Sat 21st Sep 2024", "date": "21 Sep 2024", "Incident": "134 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Cloudy Summits", "Dry"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sat-21st-sep-2024/", "main_text": "The team was called by Cumbria Police about a walker who had slipped on his ascent of Scafell Pike, injuring his ankle and rendering him unable to bear any weight. A full callout was made and team members made their way to the scene. After an assessment and splinting of the ankle a transfer to the valley floor was made in the team stretcher. The walker was then helped to the family car for subsequent transport to hospital for further assessment and treatment. We hope he recovers quickly and is back on the fells soon. ", "rescue_info": " Incident started at 16:02 and ended at 19:50 making 3.8 hrs in total. There were 16 Wasdale team members involved and the incident occured at NY 19800 07300. Total rescuer hours: 61", "start_time": "16:02", "end_time": "19:50", "hrs": "3.8", "staff": "16", "location": "NY 19800 07300", "total_hrs": "61"}, {"title": "Great Gable – Thu 19th Sep 2024", "date": "19 Sep 2024", "Incident": "133 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Great Gable", "Weather": ["Cloudy Summits", "Dry"], "Other Agencies": ["Coastguard", "Cumbria Police", "Duddon & Furness MRT", "Rescue 936 from Caernarfon"], "Diagnosis": "Multiple Injuries", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/great-gable-sat-19th-oct-2024/", "main_text": "Cumbria Police called the team about a walker who had fallen, injured his hand and knee and was unable to bear any weight to walk further. The team was promptly called out, and due to slightly low numbers, Duddon and Furness MRT was also asked to help. It then become apparent that there was a concurrent incident with a serious traffic accident on the lakeside road.  With a possibility of being unable to get through, a Coastguard helicopter was also requested, and Rescue 936 from Caernarfon responded. One team vehicle was fortunately able to pass through the RTA and was first on scene. A full medical assessment was required as the walker had taken a significant tumble fall close to Sphinx Ridge on Great Gable, sustained a number of injuries and then stoically shuffled down the mountain to the path.  Fortunately no serious injuries were detected and after some pain relief and transferring into a full body splint, the walker was handed over to the care of the Coastguard team. The walker was winched into the helicopter for transfer to hospital. Our thanks to both Duddon and Furness MRT and the Rescue 936 team for their help once again, and also to the walkers who stopped to help and made the initial call. We wish the walker a quick recovery from his injuries. ", "rescue_info": " Incident started at 13:57 and ended at 18:24 making 4.5 hrs in total. There were 10 Wasdale team members involved and the incident occured at NY 21000 09500. Total rescuer hours: 45", "start_time": "13:57", "end_time": "18:24", "hrs": "4.5", "staff": "10", "location": "NY 21000 09500", "total_hrs": "45"}, {"title": "Wastwater Screes – Wed 18th Sep 2024", "date": "18 Sep 2024", "Incident": "132 in 2024", "Type": "Alert — Other", "Location": "Wastwater Screes", "Weather": ["Clear"], "Other Agencies": ["Cumbria Police"], "Tagged": ["False Alarm", "Screes"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/wastwater-screes-wed-18th-sep-2024/", "main_text": "A call was received from Cumbria Police when a person in a car in a lay-by at the lake became concerned about a walker and their dog on the Screes boulder fields. They had not moved for a while, and with daylight fading they were worried about their safety. The Team Leader asked two team member to attend with binoculars to investigate further, but before they were near the lake the walker started to walk at a decent pace towards the pump house. A false alarm with good intent. On-Scene Coordinator: Wasdale Mountain Rescue Team ", "rescue_info": " Incident started at 18:22 and ended at 19:17 making 0.9 hrs in total. There were 3 Wasdale team members involved and the incident occured at NY 15143 05450. Total rescuer hours: 2.7", "start_time": "18:22", "end_time": "19:17", "hrs": "0.9", "staff": "3", "location": "NY 15143 05450", "total_hrs": "2.7"}, {"title": "St Bees Head – Tue 17th Sep 2024", "date": "17 Sep 2024", "Incident": "131 in 2024", "Type": "Full Callout — Other", "Location": "St Bees Head", "Weather": ["Clear", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Missing Person"], "Incident_Type": "Full Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/st-bees-head-tue-17th-sep-2024/", "main_text": "A call was received on Tuesday evening from Cumbria Police. They were requesting support for a developing multi-agency search for a missing person. However, as team members were assembling, positive news was received that the person had been located and the team was stood down. ", "rescue_info": " Incident started at 21:28 and ended at 23:08 making 1.7 hrs in total. There were 16 Wasdale team members involved. Total rescuer hours: 27", "start_time": "21:28", "end_time": "23:08", "hrs": "1.7", "staff": "16", "total_hrs": "27"}, {"title": "Scafell – Sat 14th Sep 2024", "date": "14 Sep 2024", "Incident": "130 in 2024", "Type": "Full Callout — Overdue", "Location": "Scafell", "Weather": ["Cloudy Summits", "Cold", "Rain", "Windy"], "Other Agencies": ["Coastguard", "Cockermouth MRT", "Coniston MRT", "Duddon & Furness MRT", "Lake District Mountain Rescue Search Dogs"], "Tagged": ["Overdue"], "Incident_Type": "Full Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-sat-14th-sep-2024/", "main_text": "A call was received from Cumbria Police about a lone walker who was overdue from a walk up Sca Fell. The walker was inexperienced and not well equipped should things not go to plan. Friends were concerned for his safety as they had received a call saying he was lost at high elevation, and then not returned a few hours later. With weather conditions already challenging and forecasted to worsen, and with no contact able to be made, the Team Leader considered the search to be urgent and engaged several other teams as well as search dogs to enable a lot of ground to be covered as quickly as possible. A Coastguard helicopter was also tasked. More organised search planning was initiated should the ‘hasty’ search prove unsuccessful. Fortunately as the teams were mobilising and being assigned search routes, the good news was received that the walker had made his own way to a pub in Eskdale and was safe and well. Our thanks go to all teams for their support. A good outcome. We would like to reinforce the significance of the hazards of the high fells in poor conditions as the nights draw in. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 18:05 and ended at 23:04 making 5 hrs in total. There were 12 Wasdale team members involved. Total rescuer hours: 60", "start_time": "18:05", "end_time": "23:04", "hrs": "5", "staff": "12", "total_hrs": "60"}, {"title": "Upper Eskdale – Sun 8th Sep 2024", "date": "8 Sep 2024", "Incident": "129 in 2024", "Type": "Full Callout — Lost", "Location": "Upper Eskdale", "Weather": ["Clear", "Dry"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sun-8th-sep-2024/", "main_text": "A call was received from Cumbria Police about two walkers who were attempting to return to Langdale and had misnavigated in Upper Eskdale. As they had started very early they had not taken head torches, preventing them from safely moving further. Their location was determined from the coordinates of the police call. The team was mobilized and a small party walked to their location. After some re-warming, they were walked out to the team vehicles and then taken to a nearby car park to pick up a taxi back to Langdale. ", "rescue_info": " Incident started at 21:34 and ended at 02:58 making 5.4 hrs in total. There were 7 Wasdale team members involved and the incident occured at NY 228044. Total rescuer hours: 38", "start_time": "21:34", "end_time": "02:58", "hrs": "5.4", "staff": "7", "location": "NY 228044", "total_hrs": "38"}, {"title": "Scafell Pike Summit, Scafell Pike – Sat 7th Sep 2024", "date": "7 Sep 2024", "Incident": "128 in 2024", "Type": "Alert — Other", "Location": "Scafell Pike Summit, Scafell Pike", "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-summit-scafell-pike-sat-7th-sep-2024/", "main_text": "As the team was responding to the ankle injury in incident 127, a further call was received. A walker’s 20kg dog had damaged its paws and was struggling to descend from Scafell Pike summit. The walker was understanding of the situation and intended to move downhill as best as possible, just alerting the team if help was needed later. Passing walkers then assisted with making bandages from spare socks and vet wrap, and this improved things and allowed the dog to move again. Keswick MRT was alerted as they were descending to Seathwaite, but they were also not required to assist as the walker and his dog successfully made it down on their own. Our thanks to those who helped on the fell. ", "rescue_info": " Incident started at 14:41 and ended at 18:59 making 4.3 hrs in total. There was 1 Wasdale team member involved. Total rescuer hours: 4.3", "start_time": "14:41", "end_time": "18:59", "hrs": "4.3", "staff": "1", "total_hrs": "4.3"}, {"title": "Brown Tongue, Scafell Pike – Sat 7th Sep 2024", "date": "7 Sep 2024", "Incident": "127 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Dry", "Sunny", "Warm"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sat-7th-sep-2024/", "main_text": "The team was called on Saturday about a walker who had fallen and injured their ankle. She was unable to walk any further. The team was swiftly called out and once on scene performed a medical assessment, gave further strong pain relief, and splinted the ankle. This enabled the walker to be made comfortable for the relatively routine stretcher carry to Brackenclose when she was transferred to their vehicle for subsequent transfer to the hospital. We hope the walker’s injuries heal quickly and she is back on the fells soon. ", "rescue_info": " Incident started at 14:22 and ended at 18:18 making 3.9 hrs in total. There were 16 Wasdale team members involved and the incident occured at NY 198073. Total rescuer hours: 62", "start_time": "14:22", "end_time": "18:18", "hrs": "3.9", "staff": "16", "location": "NY 198073", "total_hrs": "62"}, {"title": "Mickledore, Scafell Pike – Mon 2nd Sep 2024", "date": "2 Sep 2024", "Incident": "126 in 2024", "Type": "Limited Callout — Lost", "Location": "Mickledore, Scafell Pike", "Tagged": ["Lost"], "Incident_Type": "Limited Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/mickledore-scafell-pike-mon-2nd-sep-2024/", "main_text": "The team was called by Cumbria Police about a walker who had become separated from his walking partner, and was now lost and exhausted. Phonefind but him on the wrong side of Mickledore for his intended descent to Wasdale. As such, a Limited Callout was made to assist. The Team Leader was also able to direct the walker back towards the stretcher box over the phone and was then able to contact his walking partner. The pair were then able to find each other in the mist and located the stretcher box. Now at a known location they were able to descend from Mickledore where they were met by team members. After some re-fuelling, the walkers were able to descend to the valley and the team stood down. #beadventuresmart and make a good day better. Ask yourself three questions before you set off:\n1. Do I have the right GEAR?\n2. Do I know what the WEATHER will be like?\n3. Am I confident I have the KNOWLEDGE & SKILLS for the day? ", "rescue_info": " Incident started at 17:19 and ended at 22:16 making 5 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY 214067. Total rescuer hours: 30", "start_time": "17:19", "end_time": "22:16", "hrs": "5", "staff": "6", "location": "NY 214067", "total_hrs": "30"}, {"title": "Scafell Pike – Sat 31st Aug 2024", "date": "31 Aug 2024", "Incident": "125 in 2024", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/sat-31st-aug-2024/", "main_text": "The team was called about two inexperienced walkers who were considered to be overdue from a walk up Scafell Pike. They had set off at 3:30pm, believing it to be a 3 hour walk from their research. As such they had little equipment with them. Fortunately as the Team Leader was gathering information, the two walkers arrived in the valley, safe and well. ", "rescue_info": " Incident started at 22:34 and ended at 22:47 making 0.2 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 19777 07402. Total rescuer hours: 0.2", "start_time": "22:34", "end_time": "22:47", "hrs": "0.2", "staff": "1", "location": "NY 19777 07402", "total_hrs": "0.2"}, {"title": "Lords Rake, Scafell – Sat 31st Aug 2024", "date": "31 Aug 2024", "Incident": "124 in 2024", "Type": "Full Callout — Other", "Location": "Lords Rake, Scafell", "Weather": ["Dry", "Sunny"], "Tagged": ["False Alarm"], "Incident_Type": "Full Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/lords-rake-scafell-sat-31st-aug-2024/", "main_text": "Keswick MRT received a call from Cumbria Police which was confirmed to be in our area and passed through quickly. A walker on the Scafell Pike summit plateau was reporting people about 1.5km away on a ridge line near Lords Rake shouting for help. An accurate bearing was also taken from his location. With no further information to go from the team was called out to investigate further. However, despite many conversations with other walkers on the ascent and then checking out Lords Rake, West Wall Traverse, and Deep Ghyll up to Sca Fell summit nothing of concern was found. It was a false alarm with good intent, but a nice day for it nonetheless with some stunning views. ", "rescue_info": " Incident started at 14:16 and ended at 18:58 making 4.7 hrs in total. There were 15 Wasdale team members involved. Total rescuer hours: 71", "start_time": "14:16", "end_time": "18:58", "hrs": "4.7", "staff": "15", "total_hrs": "71"}, {"title": "Ill Crag – Thu 29th Aug 2024", "date": "29 Aug 2024", "Incident": "123 in 2024", "Type": "Full Callout — Lost", "Location": "Ill Crag", "Weather": ["Clear", "Cool"], "Tagged": ["Benighted", "Dog Rescue"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/ill-crag-thu-29th-aug-2024/", "main_text": "The team was called by Cumbria Police about a party of three walkers and their dog. They had become benighted after a very long day out and were unable and ill-equipped to navigate themselves down to safety. Their dog was also struggling. The Team Leader discussed the situation with one of the parties and decided that from this location it would be safest to send a group to their location and guide them down to Wasdale. As such a callout was made and team members made their way to the location high on the Scafell Massif, arriving at 3 am. After some rewarming and equipping of the party in a bivvy shelter, the party started the long descent to Wasdale via Esk Hause and Sty Head. Once back in the valley, after a debrief, the party was brought back to base where a taxi was arranged to take them back to their vehicle at Wrynose Pass. The team restocked the vehicles and wearily made their way home.  https://www.adventuresmart.uk/ ", "rescue_info": " Incident started at 22:27 and ended at 08:25 making 10 hrs in total. There were 8 Wasdale team members involved and the incident occured at NY 221076. Total rescuer hours: 80", "start_time": "22:27", "end_time": "08:25", "hrs": "10", "staff": "8", "location": "NY 221076", "total_hrs": "80"}, {"title": "Hollowstones, Scafell Pike – Sun 25th Aug 2024", "date": "25 Aug 2024", "Incident": "122 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Hollowstones, Scafell Pike", "Weather": ["Cold", "Mist", "Windy"], "Other Agencies": ["Great North Air Ambulance", "Helimed 08"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/hollowstones-scafell-pike-sun-25th-aug-2024/", "main_text": "The team was called by Cumbria Police yesterday about a lone walker who had possibly suffered an asthma attack and was becoming hypothermic. He could not walk and conditions were poor with wind, rain, and cold temperatures at his location. The team was quickly called out, with an advance party also tasked with accessing the walker as soon as possible with shelter and extra clothing. Helimed 08 also responded quickly. Unfortunately, conditions were not favourable for air support and the helicopter was forced to abort. When the first team member arrived on scene the walker was in the company of at least two other groups of walkers trying to help. Shelter and warm clothing were provided and a medical assessment made. As further team members and equipment arrived the walker was treated and then packaged carefully into the team stretcher to minimise further heat loss. Heat packs, vapour barrier and winter casualty bag were applied. The stretcher carry was from a routine but lengthy location to Brackenclose, where a handover was made to the waiting land ambulance. We wish the walker well in his recovery. Our thanks to those who stayed on scene whilst team members were on their way, and especially to the two walkers who offered their own clothing and also stayed on in the team shelter in the initial stages. This increases the temperature in the shelter. The walker was also incredibly grateful to you. ", "rescue_info": " Incident started at 16:51 and ended at 22:55 making 6.1 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 206074. Total rescuer hours: 122", "start_time": "16:51", "end_time": "22:55", "hrs": "6.1", "staff": "20", "location": "NY 206074", "total_hrs": "122"}, {"title": "Great Hall Gill – Sat 24th Aug 2024", "date": "24 Aug 2024", "Incident": "121 in 2024", "Type": "Alert — Other", "Location": "Great Hall Gill", "Tagged": ["False Alarm"], "Incident_Type": "Alert", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/great-hall-gill-sat-24th-aug-2024/", "main_text": "The fourth (and last) call of the evening from Cumbria Police was regarding someone at a camp site in Nether Wasdale reporting flashing lights on a mountain to the East. They were concerned that they were flashing to request help. A local team member was asked to investigate as the original informant could now not be called back due to poor mobile phone reception. No lights could be observed to the East from Irton Pike to Brackenclose. However many could be seen on Scafell Pike which was very busy, sometimes these can appear to flash as head torches move as walkers descend. A further check was made an hour later, again with nothing seen. With the weather forecast not presenting a significant hazard overnight, the Team Leader closed the log. A false alarm with good intent. ", "rescue_info": " Incident started at 21:54 and ended at 23:18 making 1.4 hrs in total. There were 4 Wasdale team members involved. Total rescuer hours: 6", "start_time": "21:54", "end_time": "23:18", "hrs": "1.4", "staff": "4", "total_hrs": "6"}, {"title": "Lingmell Beck – Sat 24th Aug 2024", "date": "24 Aug 2024", "Incident": "120 in 2024", "Type": "Limited Callout — Other", "Location": "Lingmell Beck", "Incident_Type": "Limited Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/sat-24th-aug-2024/", "main_text": "A third call was received when a walker was reporting another group that was struggling to descend from the stream crossing on Brown Tongue. The informant was concerned that then family group was ill equipped for the conditions and the male walker was having frequent muscle spasms. They were all cold and wet and struggling to make any progress. Again, a small team was tasked from base to investigate. However, on arrival at Brackenclose, the family was located in the car park having successfully made their own way off the hill. They stood down and returned to base once more. ", "rescue_info": " Incident started at 21:28 and ended at 22:43 making 1.3 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY 18250 07455. Total rescuer hours: 8", "start_time": "21:28", "end_time": "22:43", "hrs": "1.3", "staff": "6", "location": "NY 18250 07455", "total_hrs": "8"}, {"title": "Styhead Path, Great Gable – Sat 24th Aug 2024", "date": "24 Aug 2024", "Incident": "119 in 2024", "Type": "Limited Callout — Injured & Medical", "Location": "Styhead Path, Great Gable", "Weather": ["Cloudy Summits", "Showers"], "Diagnosis": "Knee Injury, Shoulder Injury", "Tagged": ["Tumble Fall"], "Incident_Type": "Limited Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/styhead-path-great-gable-sat-24th-aug-2024/", "main_text": "A second call of the evening was received by Cumbria Police. A lone walker had taken a tumble fall on the path sustaining knee and shoulder injuries. Fortunately, both were not serious and she could continue strolling down from Sty Head towards Wasdale. A small party was tasked with locating and then assisting the walker the rest of the way. Team members were still at base from the previous callout so they were on their way quickly. The walker was located in the location expected and the team provided support to complete the descent safely to Wasdale Head, before returning to base. We wish the walker a quick recovery. ", "rescue_info": " Incident started at 21:04 and ended at 00:10 making 3.1 hrs in total. There were 8 Wasdale team members involved and the incident occured at NY213095. Total rescuer hours: 25", "start_time": "21:04", "end_time": "00:10", "hrs": "3.1", "staff": "8", "location": "NY213095", "total_hrs": "25"}, {"title": "Skew Gill, Great End – Sat 24th Aug 2024", "date": "24 Aug 2024", "Incident": "118 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Skew Gill, Great End", "Weather": ["Cloudy Summits", "Showers"], "Other Agencies": ["Rescue 199 from Prestwick"], "Diagnosis": "Head Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/skew-gill-great-end-sat-24th-aug-2024/", "main_text": "In the first incident of the day, a report was made of a walker who had fallen and hit their head and then became unwell and unable to walk. The call was made by a passing walker who had descended to get a better signal. A full callout was made, and also a request for helicopter support from a Coastguard helicopter with winching capability. Rescue 199 was already in the area responding to another incident with Keswick MRT. As the team was en route from Gavel Neese the helicopter became available and diverted to Skew Gill. The paramedic was winched directly to the location and soon afterward was able to winch the walker into the aircraft and onwards to the hospital. The team stood down and returned to base. We wish the walker well with a quick recovery. ", "rescue_info": " Incident started at 18:45 and ended at 21:50 making 3.1 hrs in total. There were 23 Wasdale team members involved and the incident occured at NY221091. Total rescuer hours: 71", "start_time": "18:45", "end_time": "21:50", "hrs": "3.1", "staff": "23", "location": "NY221091", "total_hrs": "71"}, {"title": "Piers Gill, Scafell Pike – Thu 22nd Aug 2024", "date": "22 Aug 2024", "Incident": "117 in 2024", "Type": "Full Callout — Lost", "Location": "Piers Gill, Scafell Pike", "Weather": ["Gales", "Rain", "Windy"], "Other Agencies": ["Cumbria Police", "Duddon & Furness MRT", "Lake District Mountain Rescue Search Dogs"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/piers-gill-scafell-pike-thu-22nd-aug-2024/", "main_text": "With the forecasted yellow wind warning (including storm force gusts at height) and heavy rain in full swing, a call was received from Cumbria Police. A ‘three peaks’ walking party of three had become separated after setting off from the valley at 8pm. The group of two were reporting themselves lost and thoroughly soaked, their waterproofs having succumbed to the heavy and prolonged rain. In addition, the other walker could now not be contacted and they were concerned for his safety. The Team Leader called the team out after considering the risks for all, also requesting support from Duddon and Furness MRT and Lake District Mountain Rescue Search Dogs. This gave sufficient resource for a search, especially for the uncontactable lone walker. From a conversation with the party of two, it was deemed most likely that they were at the head of Piers Gill and so teams headed up the valley to begin the ascent. It was considered too risky to attempt a ‘talk-off’ due to poor communications and their likely location. On arrival at Brackenclose there was some good news as the lone walker was located in the car park. He was taken care of and the extra resources of search dogs and Duddon and Furness MRT were able to be stood down. Team members made their way to Piers Gill and were able to locate the group of two in the expected place. They then safely negotiated challenging weather conditions and rising water levels on the descent to the valley. Again there are some lessons to learn and share, a few in particular to note here: Weather warnings will be more severe on the mountains. Team members reported some gusts risking blowing them off their feet. The mountain will be there another day. Navigation is always much more challenging in poor weather. Stick together as a group. Again it is much easier to lose track of people in poor conditions. Thankfully all off the hill safe and well. ", "rescue_info": " Incident started at 01:13 and ended at 08:35 making 7.4 hrs in total. There were 8 Wasdale team members involved and the incident occured at NY213078. Total rescuer hours: 59", "start_time": "01:13", "end_time": "08:35", "hrs": "7.4", "staff": "8", "location": "NY213078", "total_hrs": "59"}, {"title": "Sty Head – Sun 18th Aug 2024", "date": "18 Aug 2024", "Incident": "116 in 2024", "Type": "Full Callout — Other", "Location": "Sty Head", "Weather": ["Clear", "Dry"], "Other Agencies": ["Keswick MRT"], "Incident_Type": "Full Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/sty-head-sun-18th-aug-2024/", "main_text": "The third call of the day arrived with a group of four walkers who had become separated from a larger group of 40 descending to Seathwaite. After 12 hours on the hill after summiting Scafell Pike they were all cold, with one person struggling to mobilise at all. It was possible there was also a medical issue. There was also a separate call for a lone walker that was directed initially to Keswick MRT with an initial location in their area. A full callout was made in case a stretcher carry became needed, and team members made their way to the location. Once on scene, after some additional clothing, calories and reassurance, a slow walk-off proved possible with some direct assistance from team members. It was established on the descent that the group of five walkers accounted for both alerts as the lone walker had met up with the group of four. The descent to Wasdale valley was completed without incident, and the group of five taken back to base for a debrief and to pick up a taxi. However, a taxi proved impossible to source on this occasion at 4am and so two team members unselfishly stayed with the group at base until one became available at 8am. Hopefully some lessons learned about not underestimating the high fells and having capable leaders established for any sub groups that split from a larger outing. Overall a good outcome on this occasion. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 22:42 and ended at 08:00 making 9.3 hrs in total. There were 14 Wasdale team members involved and the incident occured at NY 222094. Total rescuer hours: 130", "start_time": "22:42", "end_time": "08:00", "hrs": "9.3", "staff": "14", "location": "NY 222094", "total_hrs": "130"}, {"title": "Hollowstones, Scafell Pike – Sun 18th Aug 2024", "date": "18 Aug 2024", "Incident": "115 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Hollowstones, Scafell Pike", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Coastguard", "Helimed 08", "North West Air Ambulance", "Rescue 936 from Caernarfon"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/hollowstones-scafell-pike-sun-18th-aug-2024/", "main_text": "As incident No.114 was ongoing, another call for help was received. A walker had become ill and was unable to continue to walk. Team members including two casualty carers were diverted from the ongoing callout to assess the walker. However as they were en route, information from the scene then prompted a Helimed response and H08 from Blackpool duly responded. Both parties arrived on scene at about the same time and a full assessment was made. A subsequent request for coastguard winch capability was made due to the landing site for the helicopter and the awkward terrain for the walker. However as Rescue 936 was responding, a team effort allowed the walker to access H08 and the evacuation was made to hospital more quickly. Thanks again to both helicopter crews. We hope the walker has a swift recovery and is back on the fells soon. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 13:41 and ended at 17:58 making 4.3 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY 205074. Total rescuer hours: 26", "start_time": "13:41", "end_time": "17:58", "hrs": "4.3", "staff": "6", "location": "NY 205074", "total_hrs": "26"}, {"title": "Buckbarrow, Wasdale – Sun 18th Aug 2024", "date": "18 Aug 2024", "Incident": "114 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Buckbarrow, Wasdale", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/buckbarrow-wasdale-sun-18th-aug-2024/", "main_text": "A busy Sunday started when we received a call from Cumbria Police about a walker who had sustained a painful ankle injury and was unable to walk. Her partner had carried her as far as possible before making the call. The team was called out and once on scene, after an assessment some strong pain relief was given and the ankle splinted. The walker was packaged in the team stretcher and then she was transferred down the fell to the roadside. After a handover to the crew of the land ambulance team members returned to base. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  ", "rescue_info": " Incident started at 13:04 and ended at 17:42 making 4.6 hrs in total. There were 13 Wasdale team members involved and the incident occured at NY 132068. Total rescuer hours: 60", "start_time": "13:04", "end_time": "17:42", "hrs": "4.6", "staff": "13", "location": "NY 132068", "total_hrs": "60"}, {"title": "Scafell – Tue 13th Aug 2024", "date": "13 Aug 2024", "Incident": "113 in 2024", "Type": "Alert — Lost", "Location": "Scafell", "Weather": ["Mist", "Rain"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-tue-13th-aug-2024/", "main_text": "We were called by Cumbria Police about two walkers with a dog reporting themselves soaking wet, cold and lost on Scafell Pike. However the police call coordinates put them on the flanks of Sca Fell above Black Crag. After advice from the Team Leader the walkers continued their descent downhill and once below the cloud base and within sight of the car park they were content to continue unaided and the team was stood down. ", "rescue_info": " Incident started at 15:37 and ended at 16:41 making 1.1 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 199069. Total rescuer hours: 2.2", "start_time": "15:37", "end_time": "16:41", "hrs": "1.1", "staff": "2", "location": "NY 199069", "total_hrs": "2.2"}, {"title": "Scafell Pike – Sun 11th Aug 2024", "date": "11 Aug 2024", "Incident": "112 in 2024", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Clear", "Dry"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sun-11th-aug-2024/", "main_text": "A brief alert after two walkers were reported overdue from a walk up Scafell Pike to Seathwaite. The Team Leader was able to get a reply to a text message and confirmed that they were safely off the fell but in another location. A good outcome. ", "rescue_info": " Incident started at 22:00 and ended at 22:14 making 0.2 hrs in total. There were 2 Wasdale team members involved and the incident occured at NY 21951 06948. Total rescuer hours: 0.4", "start_time": "22:00", "end_time": "22:14", "hrs": "0.2", "staff": "2", "location": "NY 21951 06948", "total_hrs": "0.4"}, {"title": "Brown Tongue, Scafell Pike – Sun 11th Aug 2024", "date": "11 Aug 2024", "Incident": "111 in 2024", "Type": "Alert — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Dry", "Sunny"], "Other Agencies": ["North West Ambulance Service"], "Diagnosis": "Ankle Injury", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sun-11th-aug-2024/", "main_text": "The team was called by North West Ambulance Service about a walker who had injured their ankle and was concerned they may not be able to complete the descent. The Team Leader made direct contact and it was agreed the walker and his three friends would try to continue, knowing help was there if needed. Progress was carefully monitored through regular Phonefinds and after a further phone call confirming good progress close to the valley floor with his friends’ assistance the team was stood down. ", "rescue_info": " Incident started at 18:30 and ended at 19:55 making 1.4 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 201073. Total rescuer hours: 1.4", "start_time": "18:30", "end_time": "19:55", "hrs": "1.4", "staff": "1", "location": "NY 201073", "total_hrs": "1.4"}, {"title": "Wastwater – Sun 11th Aug 2024", "date": "11 Aug 2024", "Incident": "110 in 2024", "Type": "Full Callout — Other", "Location": "Wastwater", "Weather": ["Clear", "Dry"], "Other Agencies": ["Cumbria Police", "North West Ambulance Service"], "Incident_Type": "Full Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/wastwater-sun-11th-aug-2024/", "main_text": "A late night call from Cumbria Police from an informant who was concerned for the safety of someone in the water who was screaming.\nCalls of this nature result in many emergency services attending, including mountain rescue as we have a boat and medical capability.\nA local team member quickly attended followed by NWAS rapid response vehicle and Cumbria Police. Once on scene it was established that there was no one currently in the water and at risk. It appeared that campers on the lake shore had had a disagreement resulting in the disturbance which had escalated.\nOnce it was established that there was no-one in danger the team was stood down along with the other emergency services. ", "rescue_info": " Incident started at 01:29 and ended at 02:38 making 1.2 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY 152055. Total rescuer hours: 7", "start_time": "01:29", "end_time": "02:38", "hrs": "1.2", "staff": "6", "location": "NY 152055", "total_hrs": "7"}, {"title": "Mitredale – Sat 10th Aug 2024", "date": "10 Aug 2024", "Incident": "109 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Miterdale", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Great North Air Ambulance", "Helimed 58", "North West Ambulance Service"], "Diagnosis": "Medical", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/mitredale-sat-10th-aug-2024/", "main_text": "An urgent call was received from North West Ambulance Service about a male walker in cardiac arrest. Helimed 58 and land ambulances were tasked by NWAS and a full callout initiated. A team member in the area was asked to attend direct. The helicopter medical crew was first on scene within about 20 minutes, quickly followed by the advance team member. Tragically, despite extensive efforts, the walker did not survive. He was carefully moved off the hill and into the care of the emergency services. Our thoughts and sincere condolences are with the walker’s family and friends. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 11:29 and ended at 14:07 making 2.6 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY 137009. Total rescuer hours: 44", "start_time": "11:29", "end_time": "14:07", "hrs": "2.6", "staff": "17", "location": "NY 137009", "total_hrs": "44"}, {"title": "Scafell Pike – Thu 8th Aug 2024", "date": "8 Aug 2024", "Incident": "108 in 2024", "Type": "Limited Callout — Other", "Location": "Scafell Pike", "Weather": ["Rain"], "Incident_Type": "Limited Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/mickledore-scafell-pike-thu-8th-aug-2024/", "main_text": "A call was received from a walker that had become separated from the rest of her walking party, and then lost the path on the summit plateau. She was cold and wet and concerned for her safety with very poor visibility. The Team Leader was able to confirm her location by Phonefind and then guide her towards the stretcher box at Mickledore. Here she took shelter, whilst a small party of team members was tasked to help. Once on scene, the walker was reassured and rewarmed before being supported down the steep section of Mickledore gully. From here steady progress was made in very wet conditions to Brackenclose where she was reunited with the rest of her walking party. The team stood down and returned to base to fill the drying room once more.     ", "rescue_info": " Incident started at 13:34 and ended at 20:28 making 6.9 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY 213071. Total rescuer hours: 41", "start_time": "13:34", "end_time": "20:28", "hrs": "6.9", "staff": "6", "location": "NY 213071", "total_hrs": "41"}, {"title": "Pillar – Tue 6th Aug 2024", "date": "6 Aug 2024", "Incident": "107 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Pillar", "Weather": ["Cloudy Summits", "Dark"], "Other Agencies": ["Cockermouth MRT", "Cumbria Police", "Rescue 199 from Prestwick"], "Diagnosis": "Multiple Injuries", "Tagged": ["Fell Runner"], "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/pillar-tue-6th-aug-2024/", "main_text": "The team was called out to support Cockermouth MRT on a difficult callout with a tragic outcome. Our sincere condolences to the friends and family of the fell runner.  Cockermouth MRT callout 50 https://www.cockermouthmrt.org.uk/rescues.html ", "rescue_info": " Incident started at 22:54 and ended at 06:45 making 7.9 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY 17369 12105. Total rescuer hours: 47", "start_time": "22:54", "end_time": "06:45", "hrs": "7.9", "staff": "6", "location": "NY 17369 12105", "total_hrs": "47"}, {"title": "Scafell Pike – Tue 6th Aug 2024", "date": "6 Aug 2024", "Incident": "106 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Scafell Pike", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police", "Duddon & Furness MRT"], "Diagnosis": "Leg Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-tue-6th-aug-2024/", "main_text": "A call was received from Cumbria Police regarding a walker reporting a deep laceration to a leg. The team was quickly called out and Duddon and Furness MRT was asked to standby to support with a location high up on the Scafell Pike summit plateau. However, the walker was very stoically able to complete his descent to Wasdale Head himself where he was met by his partner for onwards transport to further care. Team members took advantage of the location to refresh and rehydrate before returning to base. Thanks to Duddon and Furness MRT for their willingness to support us once more. We wish the walker a swift recovery. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 11:59 and ended at 15:49 making 3.8 hrs in total. There were 9 Wasdale team members involved and the incident occured at NY212073. Total rescuer hours: 34", "start_time": "11:59", "end_time": "15:49", "hrs": "3.8", "staff": "9", "location": "NY212073", "total_hrs": "34"}, {"title": "Scafell Pike – Mon 5th Aug 2024", "date": "5 Aug 2024", "Incident": "105 in 2024", "Type": "Alert — Injured & Medical", "Location": "Scafell Pike", "Weather": ["Rain"], "Other Agencies": ["North West Ambulance Service"], "Diagnosis": "Knee Injury", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-mon-5th-aug-2024/", "main_text": "A late night alert was received from North West Ambulance Service. A male walker was reporting a twisted knee on the descent from Scafell Pike. However, the coordinates from the call placed him on a road well down the valley. Further contact was not possible. After verification of the location accuracy, it was agreed with NWAS that Mountain Rescue was not currently required, and would stand down, pending further information. Nothing further was heard and the log was closed. ", "rescue_info": " Incident started at 23:51 and ended at 01:26 making 1.6 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY124054. Total rescuer hours: 1.6", "start_time": "23:51", "end_time": "01:26", "hrs": "1.6", "staff": "1", "location": "NY124054", "total_hrs": "1.6"}, {"title": "Eskdale – Sun 4th Aug 2024", "date": "4 Aug 2024", "Incident": "104 in 2024", "Type": "Alert — Lost", "Location": "Eskdale", "Weather": ["Rain"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/eskdale-sun-4th-aug-2024/", "main_text": "A brief call was received from Cumbria Police about two walkers who had arrived at a farm in Eskdale. They had left their vehicle 11 hours prior with no equipment and did not know where they were or exactly where they had started from. They had followed the river out of the valley to find the farm. In heavy rain they were understandably cold and tired and in need of energy replenishment. The farmers kindly took care of them until a taxi arrived to take them to their desired destination. Hopefully valuable lessons were learned and a good outcome given the poor conditions. ", "rescue_info": " Incident started at 20:25 and ended at 20:53 making 0.5 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21268 01408. Total rescuer hours: 0.5", "start_time": "20:25", "end_time": "20:53", "hrs": "0.5", "staff": "1", "location": "NY 21268 01408", "total_hrs": "0.5"}, {"title": "Scafell Pike – Sat 3rd Aug 2024", "date": "3 Aug 2024", "Incident": "103 in 2024", "Type": "Alert — Lost", "Location": "Scafell Pike", "Weather": ["Low Cloud"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-3rd-aug-2024-2/", "main_text": "A second alert from Cumbria Police yesterday, with a walking party of 11 people seeking assistance to get to Seathwaite having become lost on the descent on the Corridor Route from Scafell Pike. The coordinates from the call to the police put them close to the old Sty Head path in Wasdale. With the cloud base well above them, the Team Leader gave advice that the shortest route to safety was to Wasdale Head and then a taxi ride back to Borrowdale. This would be visible downhill from their location. The police relayed this message and the log was closed. ", "rescue_info": " Incident started at 20:21 and ended at 21:02 making 0.7 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21670 09054. Total rescuer hours: 0.7", "start_time": "20:21", "end_time": "21:02", "hrs": "0.7", "staff": "1", "location": "NY 21670 09054", "total_hrs": "0.7"}, {"title": "Scafell Pike – Sat 3rd Aug 2024", "date": "3 Aug 2024", "Incident": "102 in 2024", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Dry", "Low Cloud"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-3rd-aug-2024/", "main_text": "The team was alerted yesterday evening about a family party of four walkers who were overdue from a walk up Scafell Pike. Another family member called raising concern. However, as the Team Leader started to gather information, a call to one of the party connected and it was confirmed that all of the group were safe and well and nearly back to their vehicle. A patchy mobile signal explained the lack of contact before this. The team was stood down and the log closed. ", "rescue_info": " Incident started at 19:24 and ended at 19:41 making 0.3 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21609 07119. Total rescuer hours: 0.3", "start_time": "19:24", "end_time": "19:41", "hrs": "0.3", "staff": "1", "location": "NY 21609 07119", "total_hrs": "0.3"}, {"title": "Lingmell – Fri 2nd Aug 2024", "date": "2 Aug 2024", "Incident": "101 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell", "Weather": ["Cold", "Rain"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Leg Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-fri-2nd-aug-2024/", "main_text": "A call was received from Cumbria Police about a lone walker who had fallen and injured his leg, had lost the path and was not equipped for the weather, which had deteriorated significantly with torrential rain arriving. He was concerned for his safety. The initial location description was described as Lingmell Crag. A full callout was made, with a potentially serious and challenging crag rescue from the East side of Lingmell. However a subsequent accurate Phonefind put the walker on Goat Crags, and with a clear mobile phone reception, the Team Leader was able to direct the walker to the Lingmell Nose descent path. Fortunately the leg injury was not serious and the walker then made his own way safely off the fell, wet and cold, but otherwise OK. Team members who had been waiting at base were stood down having not been needed to deploy. A good outcome. ", "rescue_info": " Incident started at 20:58 and ended at 22:15 making 1.3 hrs in total. There were 12 Wasdale team members involved and the incident occured at NY 203080. Total rescuer hours: 16", "start_time": "20:58", "end_time": "22:15", "hrs": "1.3", "staff": "12", "location": "NY 203080", "total_hrs": "16"}, {"title": "Brown Tongue, Scafell Pike – Sun 28th Jul 2024", "date": "28 Jul 2024", "Incident": "100 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Clear", "Dry"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Shoulder Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-sun-28th-jul-2024/", "main_text": "The 100th alert of the year was from Cumbria Police. A walker had fallen close to the stream crossing on Brown Tongue and sustained a potentially dislocated shoulder. A full callout was made and team members quickly made their way to the scene. After an assessment some strong pain relief was administered and the walker carefully packaged into the team stretcher. He was then carefully transported to Brackenclose, after which a handover to a land ambulance crew was undertaken, before a transfer to hospital. We wish the walker well with a quick recovery from his injury. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 20:54 and ended at 01:15 making 4.4 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY 195074. Total rescuer hours: 75", "start_time": "20:54", "end_time": "01:15", "hrs": "4.4", "staff": "17", "location": "NY 195074", "total_hrs": "75"}, {"title": "Burnmoor Tarn – Sat 27th Jul 2024", "date": "27 Jul 2024", "Incident": "99 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Burnmoor Tarn", "Weather": ["Low Cloud", "Rain"], "Other Agencies": ["Cumbria Police", "Duddon & Furness MRT"], "Diagnosis": "Ankle Injury", "Tagged": ["Fell Runner"], "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/burnmoor-tarn-sat-27th-jul-2024/", "main_text": "A late night call was received from Cumbria Police. A fell runner undertaking an organised long distance event had sustained a suspected ankle fracture. After some initial uncertainty on location it was confirmed that she was on the Burnmoor Tarn path, with Wasdale the quickest access point. The team was called out, with help received from Duddon and Furness MRT due to slightly low numbers required for a stretcher carry. A race paramedic was first on scene and made an assessment and gave initial pain relief. Once the team arrived, further assessment, pain relief and splinting took place, before packaging into the team stretcher. After the stretcher carry to Brackenclose, a handover was made to a land ambulance crew for subsequent transfer to hospital. Thanks to Duddon and Furness MRT once again. We wish the fell runner a speedy recovery, and hope to see her back on the fells soon. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 00:07 and ended at 05:13 making 5.1 hrs in total. There were 6 Wasdale team members involved and the incident occured at NY184054. Total rescuer hours: 31", "start_time": "00:07", "end_time": "05:13", "hrs": "5.1", "staff": "6", "location": "NY184054", "total_hrs": "31"}, {"title": "Scafell Pike – Fri 26th Jul 2024", "date": "26 Jul 2024", "Incident": "98 in 2024", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Cloudy Summits", "Dry"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-mon-26th-aug-2024/", "main_text": "A call was received yesterday evening about a party of 12 walkers who were overdue from a walk up Scafell Pike. A friend was expecting them several hours earlier, returning to Keswick from Seathwaite. However, as the Team Leader was gathering information form the informant on the phone, a message was received from one of the party saying that they had got lost, but had re-found their route and were safe and well. The log was closed later when it was confirmed that they were safely off the fell. ", "rescue_info": " Incident started at 20:14 and ended at 21:35 making 1.4 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21487 07166. Total rescuer hours: 1.4", "start_time": "20:14", "end_time": "21:35", "hrs": "1.4", "staff": "1", "location": "NY 21487 07166", "total_hrs": "1.4"}, {"title": "Brown Tongue, Scafell Pike – Wed 24th Jul 2024", "date": "24 Jul 2024", "Incident": "97 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Brown Tongue, Scafell Pike", "Weather": ["Cold", "Mist", "Rain"], "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/brown-tongue-scafell-pike-wed-24th-jul-2024/", "main_text": "Whilst on the descent with the casualty from incident 96, team members came across two walkers who were in need of our assistance. Both had taken numerous minor falls and were cold and exhausted. They were struggling to make progress and at risk of further falls and more serious injuries. Three team members were diverted from the ongoing callout and provided reassurance, food, water, helmets and rope support to minimise the risk on the remainder of the descent. Happily they were able to complete their walk to Brackenclose, and the team members stood down. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 19:14 and ended at 22:18 making 3.1 hrs in total. There were 4 Wasdale team members involved and the incident occured at NY200073. Total rescuer hours: 12", "start_time": "19:14", "end_time": "22:18", "hrs": "3.1", "staff": "4", "location": "NY200073", "total_hrs": "12"}, {"title": "Broad Crag Col, Scafell Pike – Wed 24th Jul 2024", "date": "24 Jul 2024", "Incident": "96 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Broad Crag Col, Scafell Pike", "Weather": ["Cold", "Mist", "Rain"], "Other Agencies": ["Cumbria Police", "Duddon & Furness MRT", "Great North Air Ambulance", "Helimed 08", "Helimed 58", "North West Air Ambulance"], "Diagnosis": "Shoulder Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/broad-crag-col-scafell-pike-wed-24th-jul-2024/", "main_text": "A call was received from Cumbria Police about a walker who had fallen and potentially dislocated her shoulder. Passing walkers had stopped to help. The team was called out and due to the time it would take for the team to reach the casualty Helimed support was also requested. In the meantime the casualty party was able to carefully make their way slowly to Lingmell Col. Helimed 58 from Langwathby duly responded but was diverted to a higher priority tasking. Then Helimed 08 from Blackpool was tasked, but again was called away. Unfortunately the weather was deteriorating so the stretcher evacuation then became the only remaining option. Numbers from Wasdale were a little low for a long carry, so support was requested from Duddon and Furness MRT, and this was quickly provided. However, when team members arrived on scene, the casualty’s condition had improved somewhat, and she very stoically decided that she would attempt to continue the descent on foot. With support from team members this proved possible and a slow walk was completed to Brackenclose, where a handover to a land ambulance crew took place. The team returned to base to reset the vehicles for the next callout. Thanks to both Helimed crews and to Duddon and Furness MRT for their willingness to support once again. We wish the walker well and a quick recovery. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 15:50 and ended at 22:18 making 6.5 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY215077. Total rescuer hours: 111", "start_time": "15:50", "end_time": "22:18", "hrs": "6.5", "staff": "17", "location": "NY215077", "total_hrs": "111"}, {"title": "Ritson’s Force, Wasdale Head – Tue 23rd Jul 2024", "date": "23 Jul 2024", "Incident": "95 in 2024", "Type": "Full Callout — Injured & Medical", "Location": "Ritson's Force, Wasdale Head", "Weather": ["Clear", "Dry"], "Other Agencies": ["North West Ambulance Service"], "Diagnosis": "Knee Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/tue-23rd-jul-2024/", "main_text": "A late night call from Northwest Ambulance Service about a person who had fallen and injured their knee at Ritson’s Force, near Wasdale Head. The team was called out quickly for the unusually short walk-in to the casualty. When on scene, the casualty was assessed and treated before being packaged into the stretcher for the carry to the Wasdale Head Inn. She was then transferred to hospital by land ambulance. The team returned to base to reset the vehicles before heading home for a curtailed night’s sleep. We wish the casualty a swift recovery from her injuries. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 23:47 and ended at 03:28 making 3.7 hrs in total. There were 17 Wasdale team members involved and the incident occured at NY185093. Total rescuer hours: 63", "start_time": "23:47", "end_time": "03:28", "hrs": "3.7", "staff": "17", "location": "NY185093", "total_hrs": "63"}]