[{"title": "Buckbarrow, Wasdale – Fri 3rd Aug 2001", "date": "3 Aug 2001", "Incident": "12 in 2001", "Type": "Alert — Overdue", "Location": "Buckbarrow, Wasdale", "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/alert-in-2001-3/", "main_text": "The team leader received a call from the Police advising that a 25year old solo climber was overdue. He had set out the previous afternoon to climb on Buckbarrow. The informant was contacted at their home and more details were gained. The missing climber had left details of exactly which route he was going to climb and we had details of the vehicle he was driving.The climber was using a rope technique whereby he led, then tied off, descended to untie the lower belay, then work his way back up. With all the information available, the team leader called the full team out at 0100 hrs. Shortly after this, the informant called the team leader to say the missing climber had turned up. He had called in somewhere else before going home. The recall went out at 0115 hrs.Postscript – one of our team members who lives close to Buckbarrow, was talking to Sir Chris Bonnington that afternoon on Buckbarrow and did notice the young man making his way up to the crags. Sir Chris had remarked on the quality of the Buckbarrow routes and that the climbing he had been doing on Santa Fe that day was very good and quite challenging. ", "rescue_info": " Incident started at 00:50. ", "start_time": "00:50"}, {"title": "Scafell Pike – Sun 15th Jul 2001", "date": "15 Jul 2001", "Incident": "11 in 2001", "Type": "Limited Callout — Overdue", "Location": "Scafell Pike", "Tagged": ["Three Peaks"], "Incident_Type": "Limited Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-12-in-2001/", "main_text": "The team leader received a call from the Wasdale Head Hotel regarding three missing people (doing the three peaks). Originally a group of 7, they had split up having left the summit of Scafell Pike at around 1900 hrs. Four of them had made it back to Brackenclose by 2030 hrs. but three were still overdue. He was advised that they were two men (aged around 30) and one woman (aged around 25) and that they were poorly equipped – shorts, day sacs, no torches, therefore not really up to spending the night out, given the weather – cold, windy and wet weather, with low cloud and poor visibility.Although the team does not provide a free guiding service, the team leader had the feeling that we would probably have to go for them. He set 2300 hrs. as a further time to review the incident and one of the team members went down to Brackenclose to see if he could spot any sign of them descending Brown Tongue.The team member rang again, from his mobile phone at Brackenclose at 2315 hrs., to say he had spoken to one and that the other two would be close behind. The log on the incident was closed, having confirmed that they had made a navigational error and spent some time in Eskdale, prior to walking back over to Wasdale. ", "rescue_info": " Incident started at 21:45. ", "start_time": "21:45"}, {"title": "Pikes Crag, Scafell Pike – Sun 15th Jul 2001", "date": "15 Jul 2001", "Incident": "10 in 2001", "Type": "Callout — Injured & Medical", "Location": "Pikes Crag, Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-11-in-2001/", "main_text": "Call from Workington Police shortly before 3.30pm on Sunday afternoon, regarding a report of a climber who had fallen on Lord’s Rake. They did not have details of the injuries but could me a mobile telephone number for the informant.The Team Leader rang the informant but had to leave a message (as the number was unavailable – a very common problem!) He did ring Mill Forge as the Team Leader was opening the base and gave details which lead us to request a helicopter. The casualty had in fact fallen from below D Gully Buttress on Pike’s Crag and had fallen around a 30 meters tumble fall, sustaining head, chest, leg and arm injuries. He had been intending to do a rock climb on the crag but had apparently slipped just as he and his companion had reached the base of the crag.In total 16 members of the team responded. One of the team’s Deputy Leaders was in the vicinity of the accident when it happened and was on scene with radio communications within a few minutes. Three of the advance group were lifted and winched onto the scene by Navy Helicopter (but not before the advance had climbed to the top of Brown Tongue). Everybody else had to walk and most didn’t get to the scene before the rescue was completed. The team treated the casualty and got him ready on a stretcher, for winching to the helicopter. He was then evacuated by air to Whitehaven Hospital accompanied by one of the team doctors. The casualty was a male in his late 40’s from Ulverston. We understand he is comfortable in the West Cumberland Hospital. ", "rescue_info": " Incident started at 15:25. ", "start_time": "15:25"}, {"title": "Upper Eskdale – Sun 1st Jul 2001", "date": "1 Jul 2001", "Incident": "9 in 2001", "Type": "Alert — Lost", "Location": "Upper Eskdale", "Other Agencies": ["Langdale Ambleside MRT"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/alert-in-2001-4/", "main_text": "Call from Whitehaven Police. Two people (22yr old and 56 yr old males – lightly equipped, no torches or whistles had rung 999 to say they were lost (not injured) and needed MRT assistance to help them down. Initially, we could not call them back as their mobile number was unavailable (a common experience). At about 2015 hrs we did talk directly to them and determined that they had been onto Scafell Pike but were now trying to return to Langdale. They described going down onto Great Moss and traversing over to the Green Hole area and Crinkle Crags. From various features, we guessed they were only a few hundred metres south of ‘Three Tarns’. We therefore got them to continue northwards until they could pick up the path again and to descend to Langdale. As no one else was expecting them in Langdale (they were camping for the night) we also rang the team Leader of Langdale / Ambleside MRT to advise him what was going on, giving him details of their vehicle and where it was parked. Langdale / Ambleside confirmed they had got down alright at 2300 hrs. ", "rescue_info": " Incident started at 20:00 and ended at 23:00 making 3 hrs in total. ", "start_time": "20:00", "end_time": "23:00", "hrs": "3"}, {"title": "Scafell Pike – Tue 26th Jun 2001", "date": "26 Jun 2001", "Incident": "8 in 2001", "Type": "Limited Callout — ", "Location": "Scafell Pike", "Incident_Type": "Limited Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-10-in-2001/", "main_text": "Call from Workington Police. Two more men, reported missing by the wife of one of them, from Brampton. They had spoken to her by mobile phone at 1500 hrs. to say they were on the summit of Scafell Pike. At 1700 hrs. they had a further conversation to say they were on their way home but they had not turned up. Their vehicle was reported to be parked at Wasdale Head. We asked one of our team members based at Wasdale Head to look for the car and he confirmed it was still on the Green. He left a note on it asking them to call in if they got back and at 2100 hrs. they did so. We informed the Police and no further action was required.  ", "rescue_info": " Incident started at 20:25 and ended at 21:00 making 0.6 hrs in total. ", "start_time": "20:25", "end_time": "21:00", "hrs": "0.6"}, {"title": "St Bees Head – Sat 5th May 2001", "date": "5 May 2001", "Incident": "7 in 2001", "Type": "Callout — Injured & Medical", "Location": "St Bees Head", "Other Agencies": ["Coastguard", "RNLI"], "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-09-in-2001/", "main_text": "Female reported to have fallen amongst large rocks. Minor head injuries. Coast Guard and RNLI involved. Evacuated from the bottom of the cliffs by inshore rescue boat. Team brought her down from the cliff and transferred her to the boat. Coast Guard were compromised by foot and mouth as they approached the top of the cliff through contaminated land and had to wait for MAFF to attend and decontaminate. \" ", "rescue_info": " Incident started at 12:10. ", "start_time": "12:10"}, {"title": "Sprinkling Tarn – Sat 24th Feb 2001", "date": "24 Feb 2001", "Incident": "6 in 2001", "Type": "Alert — ", "Location": "Sprinkling Tarn", "Other Agencies": ["Keswick MRT"], "Incident_Type": "Alert", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/alert-in-2001-5/", "main_text": "One of our team doctors also came across the scene of an injured woman while out walking on Saturday 24th February. Having splinted her broken leg and administered analgesic he stayed with her until members of Keswick MRT arrived to assist. The incident was reported to the Wasdale team leader by her colleagues, who walked down into Wasdale to raise the alarm at 6pm on 24th Feb, The location, being at Sprinkling Tarn, meant that it was easier and faster for Keswick MRT to deal with).\" ", "rescue_info": " Incident started at 12:00. ", "start_time": "12:00"}, {"title": "Broad Stand, Scafell – Fri 23rd Feb 2001", "date": "23 Feb 2001", "Incident": "5 in 2001", "Type": "Callout — Injured & Medical", "Location": "Broad Stand, Scafell", "Other Agencies": ["RAF Boulmer"], "Diagnosis": "Multiple Injuries", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-08-in-2001/", "main_text": "The team leader was called just before mid-day by Whitehaven Police. They had received a 999 call from someone with a mobile phone, who reported hearing shouts for help and knew that someone else required Mountain Rescue assistance. They knew the location was at Mickledore ridge, between Scafell and Scafell Pike but phone reception had been cut at that point. Although the nature of the incident was at that time unknown, given the proximity of the accident black spot of Broad Stand, the team leader decided to do a full Team call out immediately. We were able to leave our Base at Gosforth with an advance group of members within 20 minutes of the initial call By then, we also got further information through the Police having managed to re-contact the informant – we now knew that someone had broken both legs and an arm and that he was bleeding. The location given appeared to indicate that this was indeed another Broad Stand incident and the assistance of a helicopter was therefore called for. Twenty members (including two team doctors) of Wasdale Mountain Rescue Team responded to the call. We treated a man (in his thirties and from London) who had indeed fallen around 20m from Broad Stand, Scafell, sustaining severe injuries to his feet and also breaking his right arm. He had been walking alone when the accident happened and had been lying injured for about half an hour before his shouts for help had luckily been heard by other passing walkers. Because of strong winds and difficult flying conditions at the scene, we had to carry the injured man to the nearest point the helicopter could land on. This was about a kilometre away but around 200m up hill ! The helicopter, from RAF Boulmer transferred him to West Cumberland Hospital and the Team returned to base by about 1730 hrs. A truelife rescue story has been written by two of the walkers who raised the alarm – read their story.\"You have got to help me!\" also read the rescuer’s story by one of our team members here. For additional information on Broad Stand accident black spot see …….. another true rescue story 17 April 00 and first ascent by Coleridge 1802\" ", "rescue_info": " Incident started at 12:00 and ended at 17:30 making 5.5 hrs in total. There were 20 Wasdale team members involved. Total rescuer hours: 110", "start_time": "12:00", "end_time": "17:30", "hrs": "5.5", "staff": "20", "total_hrs": "110"}, {"title": "Mickledore, Scafell Pike – Fri 16th Feb 2001", "date": "16 Feb 2001", "Incident": "4 in 2001", "Type": "Callout — Cragfast", "Location": "Mickledore, Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/incident-07-in-2001/", "main_text": "Call concerning a walker who had become stuck on a frozen snowfield in the area of Mickledore. The team were called out but the walker managed to get himself onto safe ground with the help of some passing walkers. ", "rescue_info": " Incident started at 12:50. ", "start_time": "12:50"}, {"title": "Upper Eskdale – Sat 27th Jan 2001", "date": "27 Jan 2001", "Incident": "3 in 2001", "Type": "Callout — Injured & Medical", "Location": "Upper Eskdale", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-06-in-2001/", "main_text": "Call from Whitehaven Police regarding a 57 yr. old man, reported to have chest pains and to be confused. He had been found in the Green Hole area (upper Esk) by a group of walkers. They had taken four hours to get him off the hill and back to the farm at Brotherilkeld, Eskdale but there was concern about whether his wife might also be on the hill. The Team Leader accompanied by another team member responded, immediately taking our AED (Automatic External Defibrillator) up to Eskdale, to (a) offer potentially life saving equipment and (b) to talk to the group of walkers, in the hope of establishing where the casualty had been found and whether his wife might need searching for. We also called one of the team doctors (A&E Consultant and WMRT Deputy Leader) and he attended as well. (A County Ambulance was already on it’s way but due to the remote location at the head of the valley, the Team’s response is quicker). On examining the casualty, it became apparent that his chest pain was more likely to have been caused by impact from a fall. He had bumped his head and had shredded gloves and what was left of broken glasses in his pocket. The most likely explanation for his confused condition was that he had suffered a head injury, resulting from a fall. He was therefore admitted to WCH (and was discharged on the Sunday afternoon). His wife was located at the Stickle Barn, Langdale and no further Team response was required. ", "rescue_info": " Incident started at 17:10. ", "start_time": "17:10"}, {"title": "Great End – Mon 22nd Jan 2001", "date": "22 Jan 2001", "Incident": "2 in 2001", "Type": "Callout — Lost", "Location": "Great End", "Other Agencies": ["Keswick MRT"], "Incident_Type": "Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/incident-05-in-2001/", "main_text": "Request to assist Keswick MRT in a search of Great End. A single male climber, in his twenties, was reported to be lost. He had in fact already turned up at Wasdale Head and the Police had been informed. (although the message can’t have got through to Keswick Police). A Wasdale team member went up to Great End to recover the missing person’s rucksack – which he had apparently left at the foot of one of the Great End gullies, the day before. Wasdale Base was left open to maintain radio communications for the team member. It turned out the missing person (from Canada) had been lost on Sunday and had got lost again on the Monday, while trying to recover his rucksack ", "rescue_info": " Incident started at 14:30. ", "start_time": "14:30"}, {"title": "Glaramara – Sat 6th Jan 2001", "date": "6 Jan 2001", "Incident": "1 in 2001", "Type": "Callout — Lost", "Location": "Glaramara", "Other Agencies": ["Keswick MRT"], "Incident_Type": "Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/incident-04-in-2001/", "main_text": "Support to Keswick MRT looking for a Man and his son who left Seathwaite via Grains Gill. Wasdale SARDA member asked to search Styhead to Esk Hause with a navigator from the Wasdale MRT. Millforge base opened up to provide communications. Incident finished 0230 hrs the following morning when the missing persons were located on Glaramara. ", "rescue_info": " Incident started at 23:00 and ended at 02:30 making 3.5 hrs in total. ", "start_time": "23:00", "end_time": "02:30", "hrs": "3.5"}, {"title": "Wasdale – Fri 29th Dec 2000", "date": "29 Dec 2000", "Incident": "48 in 2000", "Type": "Full Callout — Overdue", "Location": "Wasdale", "Incident_Type": "Full Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-03-in-2001/", "main_text": "Alert raised for three persons last seen going onto the fells by a local farmer at 1400 hrs. with light sacks. Their car with French number plates was left on the roadside at the cattle grid entry to Wasdale, just before Buckbarrow. The police requested a search of the lower fell area. A limited call out was made and the tracks within Blengdale forest were searched by vehicle. A dog handler searched the upper slopes of Blengdale behind Windsor farm. Footsteps were found in the snow leading towards Haycock. It was a very clear night with temperatures falling to -10 centigrade and a good covering of snow. It was decided to call off the search at 0200hrs. and resume at first light. A second, full call out was made at 0820 the following morning to search Seatallen and Haycock. SARDA lakes were also organised. At 0830 hrs a telephone call (mobile) was received from the (four) missing persons who were camping at Greendale Tarn. Well intentioned false alarm, however considering the extreme conditions and the information provided to the police and team, the decision to search was appropriate. ", "rescue_info": " Incident started at 21:25. ", "start_time": "21:25"}, {"title": "Hollowstones, Scafell Pike – Sat 25th Nov 2000", "date": "25 Nov 2000", "Incident": "47 in 2000", "Type": "Callout — Injured & Medical", "Location": "Hollowstones, Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-02-in-2001-2/", "main_text": "Saturday 25th November. The second was a walker with \"cramp\" in his legs at Hollowstones, Scafell Pike in the afternoon of Saturday 2nd December 2000. He managed to walk off the fell aided by the team although the alert was for severe cramp and inability to move. ", "rescue_info": " Incident started at 15:00. ", "start_time": "15:00"}, {"title": "Middle Fell – Mon 13th Nov 2000", "date": "13 Nov 2000", "Incident": "46 in 2000", "Type": "Callout — Other", "Location": "Middle Fell", "Tagged": ["Sheep Rescue"], "Incident_Type": "Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/incident-01-in-2001/", "main_text": "The rescue of two crag fast sheep, Middle Fell ", "rescue_info": " Incident started at 13:00. ", "start_time": "13:00"}, {"title": "Green How, Scafell – Sat 28th Oct 2000", "date": "28 Oct 2000", "Incident": "45 in 2000", "Type": "Callout — Injured & Medical", "Location": "Green How, Scafell", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-54-in-2000/", "main_text": " Call from Whitehaven Police regarding a 20 yr. old male walker who had fallen over amongst boulders, badly lacerating his face. The call had come from another member of the five strong Bradford University group, who had raised the alarm by mobile phone. The casualty was a few hundred feet down from the summit of Scafell, in an area known as Greenhow and their location was in cloud and subject to very strong winds and driving rain. When we found the group, they did have an emergency shelter over the casualty but they were in a vulnerable position, due to the extreme weather. A French girl with the group had also started to suffer from a \"panic attack\". Both her and the original casualty were treated and helped off the hill. 19 members of Wasdale MRT were involved in the rescue, which was closed at around 1900 hrs. A team member transported the group members round to Eskdale Youth Hostel where they were staying. ", "rescue_info": " Incident started at 14:45 and ended at 19:00 making 4.3 hrs in total. There were 19 Wasdale team members involved. Total rescuer hours: 82", "start_time": "14:45", "end_time": "19:00", "hrs": "4.3", "staff": "19", "total_hrs": "82"}, {"title": "Scafell Pike – Mon 23rd Oct 2000", "date": "23 Oct 2000", "Incident": "44 in 2000", "Type": "Callout — Lost", "Location": "Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/incident-53-in-2000/", "main_text": "Two adult men had rung 999 (from their mobile phone) to report becoming lost while attempting to descend from the summit of Scafell Pike. The team leader rang them back and asked them questions about the features they had passed and determined that they were probably on the footpath, at the top of Piers Gill. At this point, another walker appeared out of the mist and appeared to know where he was. The two men were told to walk back over to Hollowstones and to descend Brown Tongue – the third party was also able to point them in the right direction. Phone reception was not very good, and a number of calls had to be made until the team leader was fully satisfied that no further action was required. Whitehaven Police were informed of the action taken the log closed on the incident about ten minutes after it started. This incident again demonstrates a general trend of how walkers are starting to use mountain rescue teams (and their phones). They are reaching out for assistance at the first sign of trouble, instead of using maps, compasses and common sense to get them off the hill. ", "rescue_info": " Incident started at 16:00. ", "start_time": "16:00"}, {"title": "Scafell Pike – Sun 22nd Oct 2000", "date": "22 Oct 2000", "Incident": "43 in 2000", "Type": "Callout — Injured & Medical", "Location": "Scafell Pike", "Other Agencies": ["Keswick MRT", "Lake District Mountain Rescue Search Dogs", "Millom FSRT"], "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-51-in-2000/", "main_text": "At about 21.15 hrs – call from Whitehaven Police.  The full Wasdale Team was immediately called out followed by support from the Millom Fell and Search Team and SARDA Search Dogs. The intention being to deal with the first incident before diverting attention to the second problem. About 18 Wasdale MRT members and 10 Millom FSRT members attended and started carrying out search routes on the mountain. The fell parties were carrying enough equipment to cope with the two casualties when they were found. The Wasdale members took additional ropes and climbing gear for the second incident. This would allow them to deal with the group of missing climbers depending on how the situation developed on the hill. 5 search dogs and handlers joined the search for the injured walkers doing various routes from Wasdale, Eskdale and Keswick. An RAF helicopter was requested due to the potential seriousness of the incidents but due to the severe weather conditions it had to return to base. At about 2300 hrs. assistance was also requested from Keswick MRT, who fielded around 12 more mountain rescue personnel. The two injured walkers were eventually found at around 0130 hrs. but not on the south side of Scafell Pike. They had been totally lost when the incident happened and were found by one of the Keswick search dog handlers relatively low down on the north side of the mountain adjacent to Greta Gill.. Although the information we had received had suggested much worse casualties, both were able to walk, with assistance. They were therefore helped to walk back down to their car on the Borrowdale side. They were checked over and treated by a Doctor from Keswick. One of the casualties was transferred for further checks and treatment at Carlisle Hospital. The group of four missing climbers managed to get themselves to the top of their climb Moss Gill, which finishes almost on the summit of Scafell, and then used their two torches to navigate off the mountain. Although they completed their climb and descent without Team assistance, it took them much longer in the poor weather conditions- heavy rain, thick mist and strong gale force winds. They got back down to Wasdale safely and were fully accounted for and off the hill by around 0145 hrs. A small group of Wasdale MRT members met up with the two casualties and Keswick dog handler and assisted them back to Sty Head, where they were handed over to members of Keswick MRT. The Wasdale members left them there and returned to Wasdale and back to base. All Wasdale MRT were back at base and the incident closed shortly before 0500 hrs. Monday morning. Thanks to everybody involved from the Wasdale team – to Millom and Keswick MRTs and to the SARDA dog handlers. ", "rescue_info": " Incident started at 21:15. ", "start_time": "21:15"}, {"title": "Scafell – Sun 22nd Oct 2000", "date": "22 Oct 2000", "Incident": "43 in 2000", "Type": "Callout — Overdue", "Location": "Scafell", "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-52-in-2000/", "main_text": "In the same phone call as above, Whitehaven Police also passed on details of a group of four climbers who were reported to be long overdue, having gone to do a long rock climb on Scafell crag. (Their ages ranged up to 74 yrs and information on medical history gave extra cause for concern.) The full Wasdale Team was immediately called out followed by support from the Millom Fell and Search Team and SARDA Search Dogs. The intention being to deal with the first incident before diverting attention to the second problem. About 18 Wasdale MRT members and 10 Millom FSRT members attended and started carrying out search routes on the mountain. The fell parties were carrying enough equipment to cope with the two casualties when they were found. The Wasdale members took additional ropes and climbing gear for the second incident. This would allow them to deal with the group of missing climbers depending on how the situation developed on the hill. 5 search dogs and handlers joined the search for the injured walkers doing various routes from Wasdale, Eskdale and Keswick. An RAF helicopter was requested due to the potential seriousness of the incidents but due to the severe weather conditions it had to return to base. At about 2300 hrs. assistance was also requested from Keswick MRT, who fielded around 12 more mountain rescue personnel. The two injured walkers were eventually found at around 0130 hrs. but not on the south side of Scafell Pike. They had been totally lost when the incident happened and were found by one of the Keswick search dog handlers relatively low down on the north side of the mountain adjacent to Greta Gill.. Although the information we had received had suggested much worse casualties, both were able to walk, with assistance. They were therefore helped to walk back down to their car on the Borrowdale side. They were checked over and treated by a Doctor from Keswick. One of the casualties was transferred for further checks and treatment at Carlisle Hospital. The group of four missing climbers managed to get themselves to the top of their climb Moss Gill, which finishes almost on the summit of Scafell, and then used their two torches to navigate off the mountain. Although they completed their climb and descent without Team assistance, it took them much longer in the poor weather conditions- heavy rain, thick mist and strong gale force winds. They got back down to Wasdale safely and were fully accounted for and off the hill by around 0145 hrs. A small group of Wasdale MRT members met up with the two casualties and Keswick dog handler and assisted them back to Sty Head, where they were handed over to members of Keswick MRT. The Wasdale members left them there and returned to Wasdale and back to base. All Wasdale MRT were back at base and the incident closed shortly before 0500 hrs. Monday morning. Thanks to everybody involved from the Wasdale team – to Millom and Keswick MRTs and to the SARDA dog handlers. ", "rescue_info": " Incident started at 21:15. ", "start_time": "21:15"}, {"title": "Wastwater – Sun 15th Oct 2000", "date": "15 Oct 2000", "Incident": "41 in 2000", "Type": "Callout — Other", "Location": "Wastwater", "Other Agencies": ["Police Diving Unit"], "Tagged": ["Boat", "Diver"], "Incident_Type": "Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/incident-50-in-2000/", "main_text": "The team were called by Whitehaven Police, regarding a diver who had tragically died in a diving accident in Wastwater. Although the diver was reported to be very deep and at the bottom of the Lake, the team were asked to provided recovery support for a member of the Lancashire Police Diving Unit. Having our own rescue boat for incident support on the Screes, opposite side of the lake, we were able to have the team’s craft on scene within a short period of the callout. The officer from Lancashire was being flown (by police helicopter) to the scene. A small group \"Committee Call\" was made on the pager system, and 9 team members assisted in the incident. The police officer and dive team leader were taken out onto the lake in the launch and the diver was recovered to the shore. Incident support was concluded by 1930 hrs. ", "rescue_info": " Incident started at 17:15 and ended at 19:30 making 2.3 hrs in total. There were 9 Wasdale team members involved. Total rescuer hours: 21", "start_time": "17:15", "end_time": "19:30", "hrs": "2.3", "staff": "9", "total_hrs": "21"}, {"title": "Scafell – Sat 7th Oct 2000", "date": "7 Oct 2000", "Incident": "40 in 2000", "Type": "Callout — Lost", "Location": "Scafell", "Incident_Type": "Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/incident-48-in-2000/", "main_text": "Call from Whitehaven Police regarding a group (with a mobile phone) who were reporting themselves to be in difficulty and lost on the descent from Scafell. The team leader spoke to the lost party on the mobile and was advised that they were a group of four adults, reasonably well equipped but lost, having been on the summit of Scafell. They had been attempting to descend to Burnmoor Tarn with a final destination of Wasdale Head. They thought they were somewhere on Eskdale Fell. Their Global Satellite Positioning System (GPS) was \"playing up\" (but subsequently turned out to be wrongly pre-set). They were prepared to continue walking if given some guidance. They were asked to walk north until they could find and follow a good feature – Oliver Gill. That should have brought them down to a level where they could see Burnmoor Tarn and find their own way off the mountain. However, 15 minutes later, they rang back to say that their way was barred by a large crag. This information suggested that they were about two kilometres further north than they thought and that they were in fact at the top of Rake End Crags, a different part of Scafell. The team leader suggested they keep moving but in a different direction. However, due to the uncertainty of their navigation, they preferred to sit where they were and wait for the team. Given that there had been very heavy rain and low cloud all day and fresh winds were prevailing, there was no real option but to locate them and escort them off the mountain. Eight team members were sent to find the lost party and bring them safely down to the hospitality of the Wasdale Head Hotel. The group were taken back at the Hotel at around 2230 hrs. to see the personal account of the rescue and picture of the group see ……….. ", "rescue_info": " Incident started at 18:40 and ended at 22:30 making 3.8 hrs in total. There were 8 Wasdale team members involved. Total rescuer hours: 30", "start_time": "18:40", "end_time": "22:30", "hrs": "3.8", "staff": "8", "total_hrs": "30"}, {"title": "Scafell Pike – Sat 7th Oct 2000", "date": "7 Oct 2000", "Incident": "39 in 2000", "Type": "Callout — Overdue", "Location": "Scafell Pike", "Other Agencies": ["Lake District Mountain Rescue Search Dogs"], "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-49-in-2000/", "main_text": "Call from the Whitehaven Police at about 1715 hrs concerning a single 43 yr old man who was long overdue on Scafell Pike. The informant was at Wasdale Head. The man (from the North East) had last been seen near the summit at about 1535 hrs. when he became separated from his colleague. He did not have a map with him and we were given information about his previous medical history which gave us cause for concern. With incident 48 below, we now had two incidents on the go. A full team callout was completed and we used the remaining nine team members and one search dog to start the normal search routes onto Scafell Pike. We received early reports of a single light seen to be descending the fell slowly so we held off bringing further search teams into play until we had confirmation on whether it was our missing person. Unfortunately, at 2130 hrs we got confirmation that it wasn’t. More search dogs were called but at about 2200 hrs. The missing person turned up safe and well, having taken a difficult descent route down the wrong side of Scafell Pike via Cam Spout. He met up with another couple of walkers from Langdale who were also lost and they all walked out via Brotherilkeld, Eskdale. A local farmer agreed to transport the couple back to Langdale and then brought the missing person back to Wasdale Head. All the search parties on the hill were recalled and the Gosforth Base closed at 2345 hrs. ", "rescue_info": " Incident started at 17:15 and ended at 23:45 making 6.5 hrs in total. ", "start_time": "17:15", "end_time": "23:45", "hrs": "6.5"}, {"title": "Kern Knotts, Great Gable – Fri 22nd Sep 2000", "date": "22 Sep 2000", "Incident": "38 in 2000", "Type": "Limited Callout — ", "Location": "Kern Knotts, Great Gable", "Tagged": ["Sheep Rescue"], "Incident_Type": "Limited Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-47-in-2000/", "main_text": "Team leader and a team member carried out a sheep rescue on Kern Knots. A local farmer’s wife had rung to ask if we could get two cragfast sheep out of the right side of the crags. I’m afraid one jumped but we did get the other and lowered it to safety. ", "rescue_info": " Incident started at 09:00. There were 2 Wasdale team members involved.", "start_time": "09:00", "staff": "2"}, {"title": "Great Gable – Sun 17th Sep 2000", "date": "17 Sep 2000", "Incident": "37 in 2000", "Type": "Callout — Lost", "Location": "Great Gable", "Incident_Type": "Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/incident-46-in-2000/", "main_text": "Call via Whitehaven Police regarding three people stuck on the summit of Great Gable. They had rung (by mobile phone) to report that although they appeared to be well equipped (bivi bags, waterproofs, GPS etc) they were cold, wet and getting very cold. They did not believe they would be able to walk off unassisted if they had to sit it out until the morning. Conditions during the day had been very wet and they were not sure of their exact location as they were in cloud and darkness. Seventeen members responded to a full call out to go and locate them and escort them off. We made sure we had the backup of stretchers and dry casualty bags but found that they were able to walk off under their own steam, even if slowly. Everybody was back at Base and this incident closed at around 0500 hrs. on the Monday morning. ", "rescue_info": " Incident started at 22:20 and ended at 05:00 making 6.7 hrs in total. There were 17 Wasdale team members involved. Total rescuer hours: 114", "start_time": "22:20", "end_time": "05:00", "hrs": "6.7", "staff": "17", "total_hrs": "114"}, {"title": "Throstlegarth, Upper Eskdale – Sun 17th Sep 2000", "date": "17 Sep 2000", "Incident": "36 in 2000", "Type": "Callout — Overdue", "Location": "Throstlegarth, Upper Eskdale", "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-45-in-2000/", "main_text": "Call via the Wasdale Head Hotel to report that a man who was walking from Elterwater had not turned up. His girl friend had rung to see if he’d arrived and why he hadn’t rung her. His route would have taken him over Crinkle Crags, Bow Fell, Esk Pike and Scafell Pike, before dropping down to Wasdale Head. He was described as being 52 yrs old, healthy and reasonably well equipped and experienced. Having discussed the case with Whitehaven Police and one of the Deputy Team Leaders, we felt it appropriate to wait until first light before starting a search for him. (Then we got the incident described above.) 2000-09-18 0700Just before 7am on the Monday, I started getting other Teams involved, calling on Millom, Furness, Keswick, Langdale and SARDA dogs. At 8am I also put another bleep out for Wasdale MRT. I think we got 12 people from Millom, 12 from Furness, 11 from Keswick, 11 from Langdale, 5 dogs and about 12 from Wasdale – even though most of us had already been out all night. The missing person was found at the Throstlegarth Gorge at 10am. He had spent the night high on Scafell Pike and was cold and wet, although he was able to walk without assistance. He had made a navigational error the previous evening and had not intended to drop into Eskdale! He was looked after by one of the SARDA dog handlers and the Teams were all stood down again. Wasdale MRT closed the Base at mid day. ", "rescue_info": " Incident started at 21:00 and ended at 12:00 making 15 hrs in total. There were 12 Wasdale team members involved. Total rescuer hours: 180", "start_time": "21:00", "end_time": "12:00", "hrs": "15", "staff": "12", "total_hrs": "180"}, {"title": "Esk Hause – Thu 14th Sep 2000", "date": "14 Sep 2000", "Incident": "35 in 2000", "Type": "Alert — Injured & Medical", "Location": "Esk Hause", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-43-in-2000/", "main_text": "Call via Whitehaven Police regarding a man with a mobile phone. He had rung 999 to report that his partner was suffering from exhaustion. When the team leader rang him, he found that his partner was not seriously exhausted and that they were in fact near Esk Hawse. We finished the conversation and agreed that they should continue towards Wasdale Head, while they still had 2 hrs of remaining daylight. They rang to say they were off safely at 2030 hrs. . (postscript – it would have taken the team several hours to have reached them, by which time it was likely that she really would have been very cold and tired, sitting still waiting for us. Even then, unless she had been a real stretcher case, she would still have had to walk down. The team leader got a strong feeling that they really wanted someone to make the decision for them. He therefore advised them to eat what food they had left and continue down the mountain.) ", "rescue_info": " Incident started at 18:00. ", "start_time": "18:00"}, {"title": "Gavel Neese, Great Gable – Sun 10th Sep 2000", "date": "10 Sep 2000", "Incident": "34 in 2000", "Type": "Callout — Injured & Medical", "Location": "Gavel Neese, Great Gable", "Diagnosis": "Leg Injury", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/incident-44-in-2000/", "main_text": "Call from Burnthwaite Farm. Two people had reported someone with a broken leg and gave the location as between Beck Head and Gavel Knees. Being near the farm when the Team Leader got the message, he went directly to the scene of the incident and alerted the team through the pager system. We found a 47 yr old woman from near Preston, on the path that leads down to Wasdale from Beck Head. She had slipped on the path and had broken her right ankle. She was carried off the hill and transferred to an ambulance, before being taken to West Cumberland Hospital. 21 team members were involved and we finished the incident at around 1930 hrs. A warm, wet day with low cloud making it cold for anyone sitting still for any length of time. ", "rescue_info": " Incident started at 16:20 and ended at 19:30 making 3.2 hrs in total. There were 21 Wasdale team members involved. Total rescuer hours: 67", "start_time": "16:20", "end_time": "19:30", "hrs": "3.2", "staff": "21", "total_hrs": "67"}, {"title": "Eskdale – Fri 8th Sep 2000", "date": "8 Sep 2000", "Incident": "33 in 2000", "Type": "Callout — Overdue", "Location": "Eskdale", "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-42-in-2000/", "main_text": "Friday 55 years old lady was reported long overdue between Great Moss (Eskdale) and Hardknott. The husband was at the Brotherilkeld phone box and then started to search up the valley towards Lincove bridge. The lady was found by him just as the team were assembling at Millforge. Incident stood down. ", "rescue_info": " Incident started at 20:00. ", "start_time": "20:00"}, {"title": "Scafell Pike – Thu 7th Sep 2000", "date": "7 Sep 2000", "Incident": "32 in 2000", "Type": "Callout — Overdue", "Location": "Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-41-in-2000/", "main_text": "Call from Whitehaven police. Two informants were at the Wasdale Head National Trust car park and had reported a missing person. He was last seen at 1300 hrs crossing the stream at the bottom of Brown Tongue leading up to Scafell. The person had a history of mental health but did not have any medication with them. SARDA dogs coordinator was called at 1830 hrs and we were doing the team callout when confirmation came in that the missing person had turned up. The team callout was suspended and SARDA was stood down. ", "rescue_info": " Incident started at 17:15. ", "start_time": "17:15"}, {"title": "Unknown Location – Mon 28th Aug 2000", "date": "28 Aug 2000", "Incident": "31 in 2000", "Type": "Limited Callout — Overdue", "Location": "Unknown Location", "Incident_Type": "Limited Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/incident-40-in-2000/", "main_text": "The team leader was called directly from the Wasdale Head Inn by a Wasdale team member. A lady was extremely concerned that her husband had not returned from a walk somewhere in Wasdale. They were here on holiday (from Jersey) and were staying with friends at Bigrigg. Her husband had left Bigrigg at 0830 hrs, intending to do a two to three hour walk and return by lunch time. However, although his car was at the Green, we had no indication of where he might have chosen to go. The police were asked to send an officer to Wasdale Head to talk to the lady and determine the answers to some crucial questions e.g. : where might he have gone. The police officer arrived at Wasdale at around 1730 hrs. and having spoken to the wife, determined that the missing person was indeed at risk. The team leader discussed the details with his deputy and agreed the Team should be called to do a search of the most likely areas, before nightfall. At 1810 hrs. we were waiting five more minutes before doing a full call out – the Policeman was going to open the missing person’s car, looking for notes or clues as to where he might have gone. At 1815 hrs, as the Policeman was searching the vehicle, the missing person turned up. He had gone for a longer walk than originally planned and was safe and well. A small number of team members were involved during the period up to the missing person turning up including numerous telephone calls. ", "rescue_info": " Incident started at 16:00. ", "start_time": "16:00"}, {"title": "Scafell Pike – Sun 20th Aug 2000", "date": "20 Aug 2000", "Incident": "30 in 2000", "Type": "Callout — ", "Location": "Scafell Pike", "Tagged": ["Three Peaks"], "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-39-in-2000/", "main_text": "Three males set off to walk up Scafell Pike as part of their 3-peaks challenge late in the afternoon. They left Burnthwaite heading for Styhead then turned to the south, crossing the beck and proceeding up Lingmel crags. Two turned back due to the ‘steepness of the rocks’. The third male carried on but failed to return. He was dressed in shorts and ‘T’ shirt. The full team were called out but he turned up safe and well after coming down Brown Tongue. The team were stood down and the base closed before midnight. ", "rescue_info": " Incident started at 21:30 and ended at 23:50 making 2.3 hrs in total. ", "start_time": "21:30", "end_time": "23:50", "hrs": "2.3"}, {"title": "Incident 38 in 2000", "Incident": "29 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-38-in-2000/", "main_text": "The team leader was asked for a dog handler and navigator to search upper Eskdale (Green Hole area) and up to Bowfell. Having opened the base and got the search team organised he then found that the two missing people (aged 72 and 16) had left Langdale earlier the previous day, with the intention of doing Scafell Pike and returning to Langdale. They had made a series of mobile phone calls between 1700 hrs and 2300 hrs, reporting that they were stuck somewhere on \"the band ", "rescue_info": " Incident started at 02:30. ", "start_time": "02:30"}, {"title": "Incident 37 in 2000", "Incident": "28 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-37-in-2000/", "main_text": "It started with a call from Whitehaven Police, reporting three people missing, having not come back to their hotel in Eskdale. The Team Leader spoke to the hotel manager and found that the three missing people were one female (aged 31) and two males, aged 30 and 74 ! They were probably going to walk up Scafell and had left after breakfast that morning. They hadn’t actually left details of their intended route at the hotel but were reported overdue when the wife of one of them hadn’t been rung that evening. By 2320 hrs. their car was found to be parked further up Eskdale (at Wha House car park) and it quickly became apparent that they must indeed be on the hill. We chose to call in the help of three search dogs and got a further group of 4 WMRT people to search towards Ling Cove Bridge, Cam Spout etc. We did not do a full team callout, intending to keep the team in reserve until first light, if necessary. Well done to \"Dog Roger ", "rescue_info": " Incident started at 23:00. ", "start_time": "23:00"}, {"title": "Incident 36 in 2000", "Incident": "27 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-36-in-2000/", "main_text": "One of the Deputy Team Leaders was called shortly before 1900 hrs. regarding a report of a 52 year old man from Dunblain, who had collapsed part way up Harter Fell, Eskdale. The man’s son had raised the alarm, having run down to the nearest farm to summon assistance. 16 members of the team attended the incident and also requested the help of an RAF helicopter. The casualty was transferred by helicopter to the West Cumberland Hospital for further diagnosis and treatment. All members were back at base and Mill Forge closed by around 2200 hrs. ", "rescue_info": " Incident started at 19:00. ", "start_time": "19:00"}, {"title": "Incident 32 in 2000", "Incident": "26 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-32-in-2000/", "main_text": "Call from Whitehaven Police asking for assistance to an Ambulance crew at Woodend, Egremont. A woman from Egremont had been walking in Clints Quarry, with her husband and their dog. She had slipped on the path, fallen over and broken her right ankle. A short carry using the Bell stretcher but over steep banks and through trees got us back to the road relatively quickly…. Just a little further and slippier than would have been sensible for two ambulance people to do on their own. We are always happy to assist them in such situations. (It shows a good spirit of co-operation exists between the Ambulance crews and the Team ) 10 team members were at the scene and three more at base. ", "rescue_info": " Incident started at 14:00. ", "start_time": "14:00"}, {"title": "Incident 35 in 2000", "Incident": "0 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-35-in-2000/", "main_text": "Call from the Team Leader of Keswick MRT, regarding a 30 yr old male walker who was doing the 4 x 3,000fts. He had completed Skiddaw in the morning and left Seathwaite approx 1330 hrs. Although he had originally been with others, they had left him on his own and had last seen him at the top of Lord’s Rake, just below the summit of Scafell, at 1630 hrs. He was reported long overdue, having not turned up at the next check point at Thirlmere. His route would have been down Foxes Tarn, to Mickledore and over Scafell Pike. Keswick MRT and Search Dogs were going out to look for him. Wasdale MRT would cover the Scafells. A light was seen in Wythburn valley and Keswick MRT were able to confirm a find (safe and well) by 0030 hrs. A recall was sent out to team members and Mill Forge closed.   Incident0 in 2000 TypeCallout — LocationUnknown Location COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 FUNDRAISER ALERT Read more… Incident0 in 2000 TypeCallout — LocationUnknown LocationSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details to follow Read more… Incident0 in 2000 TypeCallout — LocationUnknown Location Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Thank you Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Incident 34 in 2000", "Incident": "25 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-34-in-2000/", "main_text": "The team leader was called by Whitehaven Police, regarding a 48 yr old woman from Middlesborough who had tumbled down boulders/scree near Lord’s Rake, Scafell. She was reported to have suffered significant cuts to her head and also had bruising and cuts to the rest of her body, arms and legs. Although the incident had been reported by mobile phone, the informant was no longer at the scene. It was not possible to maintain up to date information on the casualty’s condition (particularly conscious level) so a helicopter was requested. 16 members of the team attended. Our \"advance\" group got to the casualty at the same time that the helicopter arrived on scene (approx 1745 hrs.) The lady was treated for her injuries at the scene and transferred by helicopter to West Cumberland Hospital. Team members were all back at our base in Gosforth by around 1930 hrs. ", "rescue_info": " Incident started at 16:20. ", "start_time": "16:20"}, {"title": "Incident 33 in 2000", "Incident": "24 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-33-in-2000/", "main_text": "Call out for a 28 yr old male walker with a reported ankle injury part way up Scafell Pike. He had been taking part in a 3 Peaks Challenge event and had in fact been suffering with a knee injury as he ascended the Pike (having done Ben Nevis earlier in the day). The pain in his knee had got worse and he become unable to walk any further. He was on the footpath, half way between the top of Brown Tongue and Lingmel Col. His leg was splinted and he was carried down to Brackenclose by stretcher, arriving at around 0400 hrs. His colleagues used their own transport to either take him to hospital or continue on there way to Snowdon. The Mill Forge rescue base at Gosforth was closed down around 0500 hrs. 13 team members on the hill and 1 at base. There were many other people out doing the 3 Peaks event that night and many of them were having real difficulty on the extremely slippery path down Brown Tongue – Not much sign of people sticking to the code of practice, which does ask them not to do the mountain during the hours of darkness. ", "rescue_info": " Incident started at 00:15. ", "start_time": "00:15"}, {"title": "Incident 31 in 2000", "Incident": "23 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-31-in-2000/", "main_text": "Call from Whitehaven Police at 1800 hrs. They had received a 999 call from two lads (18 and 19 yr old) who reported being stuck on steep ground on the West side of Yewbarrow. When the Team Leader eventually managed to get in touch with them (by mobile phone) they gave me what appeared to be a map reference (from their GPS) but in a format which was new to the team – i.e.: North, 54 degrees, West, 3 degrees etc. They also described where they had left their car and what route they had taken and told me what lakes etc they could see from their location. The team leader believed they were on the side of Yewbarrow and given that there is no easy way off, that doesn’t involve going down craggy ground, he thought it best to ask a small group of team members to go and assist them. He therefore did a committee group alert and 11 members attended (4 on the base/radio relays and 7 on the hill) Fortunately one of the team members managed to interpret their map reference and determined that they might actually be on the side of Lingmel – a different mountain! Further telephone conversations managed to glean enough information to suggest they were on the side of Kirkfell, yet another different mountain !! We finally managed to sight them not far down from the summit of Kirkfell and got to them at about 8.30pm. They were simply frightened to continue without assistance and were on steep loose scree. We put them in helmets and harnesses and assisted them to walk down. Very slow going, with us getting back to Wasdale Head at 10.30pm. The moral of the story : we are seeing an increasing trend that when people use their mobile phones to summon assistance, a lot of them don’t actually know where they are! We can cope better if those people admit to being lost, rather than give us what appears to confident information on their location, only for us to find that they’re on a different mountain. This same situation has occurred several times over the last few months and it potentially makes the time taken to find and help people much longer. ", "rescue_info": " Incident started at 18:00. ", "start_time": "18:00"}, {"title": "Incident 30 in 2000", "Incident": "22 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-30-in-2000/", "main_text": "Call from Whitehaven Police at 11.40 am. They had received a 999 call from someone (with a mobile phone), reporting that a 44 yr old man had collapsed with hypothermia, somewhere between Broad Crag and the summit of Scafell Pike. As the Team was en route to Wasdale, further conversations with the informant advised that the casualty had now become unconscious and that he was very cold. Weather at the scene was cold, windy and extremely wet, and they were in thick cloud. There were a total of seven adults at the casualty site and a further seven members from the group were descending towards Wasdale Head. We found the group near the top of Piers Ghyll and worked on re-warming the casualty for about an hour, before carrying him on a stretcher down to a point on Lingmel Nose, where an RAF helicopter could get in to lift him to safety. He was flown to West Cumberland Hospital, where he made a full recovery. (Although he did make a quick recovery, he had been unresponsive prior to the Team arriving and had got so cold that he’d stopped shivering – i.e.: a sign that his body core temperature was below 30 degrees C. He certainly required assistance !!) As well as being warmed, he was treated with oxygen and his condition was monitored with the Propac. We also had a portable Automatic External Defibrillator with us, just in case he’d gone into Ventricular Fibulation. Due to the high winds, rain and low cloud, the helicopter had some difficulty getting near the casualty’s location (at Piers Gill). They were only able to get in to the pick up point during a break in the clouds and had to get him on board as quickly as possible. One of our team members twisted his ankle on the way down and we did think we might have to also carry him off. However, to all our relief, he managed to walk down under his own steam. Most team members were back at base by around 5.30pm but I think it was about 6.30pm when it was finally closed. also see newspaper article with picture…… ", "rescue_info": " Incident started at 11:40. ", "start_time": "11:40"}, {"title": "Incident 29 in 2000", "Incident": "21 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-29-in-2000/", "main_text": "A 50 yr old man was reported to be suffering a \"panic attack\" and to be stuck in a gully (in thick mist) somewhere on the descent from Great Gable’s summit. ….probably around White Napes. The team leader put out a full team call out and 17 members attended. We were not entirely sure whether they were on the slope above the Beck Head path or on the Napes but found them part way down Arrowhead Gully, Great Napes. We put him in a harness and helmet and belayed him back up the gulley (about 200ft) while we assisted his climbing. We then used tape slings either side of the harness to assist him to walk back down. Back at Mill Forge just in time to see the penalty!! England v Romania 2:3 – European Cup (Probably a mercy that we hadn’t had to watch the whole match) ", "rescue_info": " Incident started at 16:40. ", "start_time": "16:40"}, {"title": "Incident 28 in 2000", "Incident": "20 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-28-in-2000/", "main_text": "Call from Whitehaven Police regarding a man (28 yrs old) who had fallen approx. 15 ft while trying to climb up Hardknott Ghyll (to the right of the road, looking up Hardknott Pass from Eskdale). 20 team members attended and dealt with his injuries before carrying him down the gully bed, to a point where we could then raise him out of the gully and back to the road. (A wet carry through pools and over greasy rocks, with the stretcher being passed between members rather than being able to carry it. Just as well it was a fine, warm day – hottest June day on record in the UK) The casualty was treated for a back injury and possible internal injuries by team members/doctors (including an A&E Consultant, an Anaesthetist and a nurse). The casualty was transferred to West Cumberland Hospital by Ambulance. The rescue was completed and Mill Forge base closed at about 1900 hrs. ", "rescue_info": " Incident started at 16:00. ", "start_time": "16:00"}, {"title": "Incident 27 in 2000", "Incident": "19 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-27-in-2000/", "main_text": "Call from Howard Christie at Wasdale Head, reporting that organisers were worried about four participants in a three peaks challenge event. Three men and one woman, all late twenties / early thirties had left Wasdale Head at 1400 hrs, wearing light clothing. One member in particular was reported to be very experienced but one member of the group had not been feeling well, probably not fully recovered from doing Ben Nevis. They had waterproof clothing with them, torches, map and compass and a rope and even had a radio, although no contact could be made. The Wasdale Team Leader decided to wait until 2300 hrs before asking Search Dogs etc to go and look for them and expected that they had simply made a navigational error, probably going down on the Eskdale side of the fell. (Logic that a group of four could split up if one had suffered incapacity for some reason. Also that hundreds of people were already searching the paths for us – doing the peaks event). MRT’s do not guide people off the hills and only respond if they consider, given the specific facts of each situation, there is a realistic probability that someone is at risk of coming to harm. At 2235 hrs the Wasdale team leader was on the phone to Howard Christie when they turned up. They had indeed made a navigational error and had eventually been assisted onto the correct route down by other 3 peaks participants. Several phone calls were involved, checking Eskdale and speaking on two occasions to the informant resulted in a good hour and half workload for the team. This was therefore logged with Police and listed as an incident (standard rescue team policy to ensure that all incidents are properly recorded for statistics and insurance purposes) ", "rescue_info": " Incident started at 21:10. ", "start_time": "21:10"}, {"title": "Incident 26 in 2000", "Incident": "18 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-26-in-2000/", "main_text": "Call from Whitehaven Police regarding shouts for help and whistles from the Screes. Informant was at the Wasdale Youth Hostel. This report was quickly followed up by further 999 calls from two others with mobiles, who reported they could hear shouts that someone was unconscious, reason unknown. 14 members attended and carried the woman (in her twenties) off the scree path and into the team’s boat. She was transferred across the lake to a waiting ambulance and taken to West Cumberland Hospital. She had suffered a \"funny turn\" and been unconscious/unresponsive for about an hour, although when treated by the team she was conscious although very cold. The lady had experienced similar symptoms before. Members were back at base and Mill Forge closed by around 2000 hrs. ", "rescue_info": " Incident started at 17:45. ", "start_time": "17:45"}, {"title": "Incident 25 in 2000", "Incident": "17 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-25-in-2000/", "main_text": "Call from Howard at Wasdale Head. A woman (approx 35 yrs old) had slipped while descending from Ill Ghyll Head, towards Wasdale Head, National Trust car park at Brackenclose. She had either broken or badly sprained her ankle but had managed to get part way down on her own, until her husband felt it better to get further assistance. 13 members attended and carried her down to a waiting Ambulance, for transfer to West Cumberland Hospital. Her left leg was splinted but no analgesic was necessary. The lady was not far bellow the old huts on the Burnmoor Tarn path when we the team reached her. It wasn’t a long carry and members were back at base by about 1930 hrs. ", "rescue_info": " Incident started at 17:50. ", "start_time": "17:50"}, {"title": "Incident 24 in 2000", "Incident": "16 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-24-in-2000/", "main_text": "all from Whitehaven Police at 09.30 am. Three women (aged between 35 and 45) had used a mobile phone to call 999 for assistance. They reported that they had lost the path in thick mist and were lost, probably somewhere between Broad Crag and Scafell Pike. They were apparently well equipped but were worried about how they would get back to a mini bus (and husband) at the Old Dungeon Ghyll, Langdale. The Police had advised them to stay put until they were contacted by the MRT. Julian Carradice, WMRT Team Leader tried to contact them but could only get an answer phone service (a common problem !!!) Without any further information he told the Police that he would not immediately turn the Team out. He would only initiate a call out if he believed there was a reasonable likelihood that people were at risk. He guessed that they were not far off the path and that once people started to walk along what is a main route to Scafell Pike, they would probably be able to contact somebody who would be in a position to assist them navigate. Julian kept trying to contact them every 10 to 15 minutes and eventually got through at about 10.30 am. During his conversation with them, he got them to get their compass and map out and to tell him in what direction certain features lay, relative to their position. e.g.. they could see Sellafield, they could see a valley to their north (Wasdale) and they could see crags in front of them, to their west (crags above Piers Ghyll/corridor route). Julian told them to walk south east for no more than two hundred meters until they came across the path on Broad Crag. (They had been going from Langdale and were still heading for the summit of the Pike when they got off route) Julian rang them again after 10 to 15 minutes and confirmed that they had regained the path. He then convinced them to head back towards Langdale and that they would warm up as they did this (they had been out since 05.30 am and were very cold and wet.) Julian had further contact with them on two more occasions until he knew they were safely back at Esk Hause. At this point the three ladies were now much happier and knew where they were going. (Last contact with them at 11.30 am). May 2000 ", "rescue_info": " Incident started at 09:30. ", "start_time": "09:30"}, {"title": "Incident 23 in 2000", "Incident": "15 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-23-in-2000/", "main_text": "Call from the police that a walker doing the three peaks had failed to return to the main party at Seathwaite at 1730 hrs. The police provided further information at 2115 hrs to advise that the missing person had turned up safe and well. No team members were put out onto the fell. Whilst this incident was being dealt with the second one came in. ", "rescue_info": " Incident started at 21:00. ", "start_time": "21:00"}, {"title": "Incident 22 in 2000", "Incident": "14 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-22-in-2000/", "main_text": "Team received a call from the police to say there was a lady with a suspected fractured / sprained ankle below Wind Gap, Pillar in the Mosedale valley. She was located just over the stream crossing below the main scree. She had a very badly dislocated ankle which was immobilised in an inflatable splint before she was carried out by stretcher to Wasdale Head. A very warm and clear night but wet underfoot. APRIL 2000 ", "rescue_info": " Incident started at 20:38. ", "start_time": "20:38"}, {"title": "Incident 21 in 2000", "Incident": "13 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-21-in-2000/", "main_text": "A group of three team members out for a days walking were planning to check out the ascent / descent routes on Broad Stand, Scafell due to it being one of the Valley’s accident black spots. When they appeared at Mickledore they were approached by a group wanting to borrow a mobile telephone to call out the local mountain rescue team. A man was cragfast below the corner on Broad Stand. Although well equipped and with a rope, he had realised that the route was too dangerous and could not move either up or down. The man was lowered off the crag without further problems. Was this the quickest response to a call-out? On the scene within 3 minutes of the call for help… rescue completed within 20 minutes. See true life rescue story…….. ", "rescue_info": " Incident started at 12:45. ", "start_time": "12:45"}, {"title": "Incident 20 in 2000", "Incident": "12 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-20-in-2000/", "main_text": "Call via Whitehaven Police. A lady at Kendal police station reported that her husband and daughter were long overdue from a days walking on Scafell Pike. The last contact with them was by mobile phone at 1440 hrs. when they were on their descent from the summit. Team were mobilised but the missing couple reported in at 2300 hrs. before the groups got out onto the fell. ", "rescue_info": " Incident started at 21:30. ", "start_time": "21:30"}, {"title": "Incident 19 in 2000", "Incident": "11 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-19-in-2000/", "main_text": "Lady suffered a broken ankle near Eel Tarn, Eskdale. Her ankle was immobilised in a Sam splint and she was carried down to the ambulance at the Woolpack Inn and transported to West Cumberland Hospital. ", "rescue_info": " Incident started at 17:25. ", "start_time": "17:25"}, {"title": "Incident 18 in 2000", "Incident": "10 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-18-in-2000/", "main_text": "Mobile telephone call from an informant, two females in their late 40’s were lost on Scafell. A glorious day but they had no idea where they were, they could see a lake with buildings in the background. Incident was closed at 1715hrs. as they didn’t really need the team. ", "rescue_info": " Incident started at 16:15. ", "start_time": "16:15"}, {"title": "Incident 17 in 2000", "Incident": "9 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-17-in-2000/", "main_text": "Party of three males set out to climb the grade 2 scramble, Eagle nest Gulley. One climber went ahead of the others and became cragfast. The alarm was raised by mobile phone. Under the wet and slushy snow conditions it was a serious scramble for the team. He was helped out of the gulley and safely returned to Seathwaite. ", "rescue_info": " Incident started at 14:45. ", "start_time": "14:45"}, {"title": "Incident 16 in 2000", "Incident": "8 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-16-in-2000/", "main_text": "Report came in from Whitehaven police of a 46 yr. old male walker hit by a boulder, 200 m below the summit of Scafell Pike. Whilst mobilising the team and getting up the valley, locations changed to Lingmel col then to the Woolworth boulder before we finally established that the group were located 100m below Mickledore just down from Rakes Progress. The casualty had a deep wound just above the left hip.. He was placed in a vacuum mattress and stretchered down to Brackenclose. A&E Whitehaven later confirmed the injury as a puncture wound with significant muscle damage. (Note: two team members were hit/hurt by falling rocks during the rescue due to the very poor condition of the scree in this area. One of the team members received a nasty gash but it was not serious) ………………..See true life rescue story…….. ", "rescue_info": " Incident started at 15:00. ", "start_time": "15:00"}, {"title": "Incident 15 in 2000", "Incident": "7 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-15-in-2000/", "main_text": "Call received from Whitehaven police that a man returning from the Woolpack had seen a green flare on Slightside. It was a very clear night and no further action was taken. Well intentioned false alarm. ", "rescue_info": " Incident started at 01:15. ", "start_time": "01:15"}, {"title": "Incident 14 in 2000", "Incident": "6 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-14-in-2000/", "main_text": "Call received from Whitehaven police to rescue a 25 year old male cragfast on the Wastwater. The walker was removed from the bottom of the Screes Gully and assisted back down to the Wastwater pumphouse. 9 team members involves for a duration of 3 hours. ", "rescue_info": " Incident started at 12:40. ", "start_time": "12:40"}, {"title": "Incident 13 in 2000", "Incident": "5 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-13-in-2000/", "main_text": "Call received from Whitehaven police to attend a lady in her mid fifties who had slipped and broken her ankle whilst descending path from Whin Rigg. 18 team members involved for 2 hours. ", "rescue_info": " Incident started at 15:00. ", "start_time": "15:00"}, {"title": "Incident 12 in 2000", "Incident": "4 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-12-in-2000/", "main_text": "Two sheep stuck on the crags on Buckbarrow. Successfully retrieved without loss or injury. 4 members for 2 hours. ", "rescue_info": " Incident started at 13:00. ", "start_time": "13:00"}, {"title": "Unknown Location – Fri 25th Feb 2000", "date": "25 Feb 2000", "Incident": "3 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-12-in-2000-2/", "main_text": "25 year old male fell but was reported overdue then turned up 30 minutes later from walking on Scafell. He sustained a gashed head. 2 team members were involved in the early stages of the investigation. ", "rescue_info": " Incident started at 17:00. ", "start_time": "17:00"}, {"title": "Unknown Location – Sat 1st Jan 2000", "date": "1 Jan 2000", "Incident": "2 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-06-in-2000/", "main_text": "Father and 4 children reported overdue from a walk up Scafell Pike. They were reported as well equipped and experienced but had to spend the night on the fell following a navigational error. They were found returning to their vehicle at the NT car park at 1000 hours 2000-01-02. Warmed and fed at Wasdale Head Inn. ", "rescue_info": " Incident started at 13:59. ", "start_time": "13:59"}, {"title": "Incident 05 in 2000", "Incident": "1 in 2000", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-05-in-2000/", "main_text": "Received a request to assist Langdale/Ambleside in a search for a couple doing Crinkle Crags from the Langdale campsite. Were found ok in the three tarns area at approximately 0300 hrs. ", "rescue_info": " Incident started at 00:00. ", "start_time": "00:00"}, {"title": "Unknown Location – Thu 30th Dec 1999", "date": "30 Dec 1999", "Incident": "3 in 1999", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-04-in-2000/", "main_text": "Two men were reported overdue having set off from Irton Pike quarry intending to walk over the Screes to Brackenclose by 1530 hrs. Howard found them near Cross Walls walking back along the road. ", "rescue_info": " Incident started at 17:30. ", "start_time": "17:30"}, {"title": "Unknown Location – Mon 20th Dec 1999", "date": "20 Dec 1999", "Incident": "2 in 1999", "Type": "Callout — ", "Location": "Burnmoor Tarn", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-02-in-2000/", "main_text": "A 57 years old male suffered an ankle injury between Burnmoor Tarn and Wasdale. His wife descended to Burnmoor Inn to raise the alarm. Was carried off to safety. ", "rescue_info": " Incident started at 15:10. ", "start_time": "15:10"}, {"title": "Unknown Location – Sun 28th Nov 1999", "date": "28 Nov 1999", "Incident": "1 in 1999", "Type": "Callout — ", "Location": "Unknown Location", "Incident_Type": "Callout", "Incident_Cause": "", "url": "https://www.wmrt.org.uk/incidents/incident-01-in-2000/", "main_text": "A father and son had not returned to their vehicle at Burnthwaite. Route not known but it was known that they were inexperienced. and not well equipped. They were eventually found at 0250 hrs in Calf Cove by Keswick team. ", "rescue_info": " Incident started at 22:00. ", "start_time": "22:00"}, {"title": "Great Gable – Tue 24th Aug 1971", "date": "24 Aug 1971", "Incident": "6 in 1971", "Type": "Callout — Injured & Medical", "Location": "Great Gable", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/great-gable-tue-24th-aug-1971/", "main_text": "Boy injured whilst scree running Great Hell Gate screes.   Incident6 in 1971 TypeCallout — Injured & Medical LocationGreat Gable COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 Read more… Incident6 in 1971 TypeCallout — Injured & Medical LocationGreat GableSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More Read more… Incident6 in 1971 TypeCallout — Injured & Medical LocationGreat Gable Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Scafell – Wed 11th Aug 1971", "date": "11 Aug 1971", "Incident": "5 in 1971", "Type": "Callout — Overdue", "Location": "Scafell", "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-wed-11th-aug-1971/", "main_text": "3 fell-walkers missing overnight on Scafell. Found next morning near Burnmoor Tarn.   Incident5 in 1971 TypeCallout — Overdue LocationScafell COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 FUNDRAISER ALERT Read more… Incident5 in 1971 TypeCallout — Overdue LocationScafellSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details to follow Read more… Incident5 in 1971 TypeCallout — Overdue LocationScafell Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Thank you Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Beck Head, Great Gable – Wed 11th Aug 1971", "date": "11 Aug 1971", "Incident": "5 in 1971", "Type": "Callout — Injured & Medical", "Location": "Beck Head, Great Gable", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/beck-head-great-gable-wed-11th-aug-1971/", "main_text": "Fell-walker fell and injured knee, near Beck Head. Team carried down.   Incident5 in 1971 TypeCallout — Injured & Medical LocationBeck Head, Great Gable COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th Read more… Incident5 in 1971 TypeCallout — Injured & Medical LocationBeck Head, Great GableSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Read more… Incident5 in 1971 TypeCallout — Injured & Medical LocationBeck Head, Great Gable Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Scafell – Sat 10th Apr 1971", "date": "10 Apr 1971", "Incident": "3 in 1971", "Type": "Callout — Injured & Medical", "Location": "Scafell", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-sat-10th-apr-1971/", "main_text": "Fell-walker slipped on snow patch. Concussion and abrasions. Carried down on stretcher.   Incident3 in 1971 TypeCallout — Injured & Medical LocationScafell COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 Read more… Incident3 in 1971 TypeCallout — Injured & Medical LocationScafellSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details Read more… Incident3 in 1971 TypeCallout — Injured & Medical LocationScafell Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Mosedale – Fri 9th Apr 1971", "date": "9 Apr 1971", "Incident": "2 in 1971", "Type": "Callout — Injured & Medical", "Location": "Mosedale", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/mosedale-fri-9th-apr-1971/", "main_text": "Fell-walker slipped whilst crossing stream. Broken collar bone.   Incident2 in 1971 TypeCallout — Injured & Medical LocationMosedale COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 Read more… Incident2 in 1971 TypeCallout — Injured & Medical LocationMosedaleSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details Read more… Incident2 in 1971 TypeCallout — Injured & Medical LocationMosedale Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Pillar – Sun 14th Mar 1971", "date": "14 Mar 1971", "Incident": "1 in 1971", "Type": "Callout — Cragfast", "Location": "Pillar", "Incident_Type": "Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/pillar-sun-14th-mar-1971/", "main_text": "Rescue of 3 climbers on Pillar Rock summit and suffering from exposure.   Incident1 in 1971 TypeCallout — Cragfast LocationPillar COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 FUNDRAISER ALERT Read more… Incident1 in 1971 TypeCallout — Cragfast LocationPillarSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details to follow Read more… Incident1 in 1971 TypeCallout — Cragfast LocationPillar Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Thank you Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Pillar – Sun 6th Dec 1970", "date": "6 Dec 1970", "Incident": "10 in 1970", "Type": "Callout — Cragfast", "Location": "Pillar", "Incident_Type": "Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/pillar-sun-6th-dec-1970/", "main_text": "Night search of Mosedale and High Level Route followed by rescue of 2 climbers from New West, Pillar Rock   Incident10 in 1970 TypeCallout — Cragfast LocationPillar COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 FUNDRAISER ALERT Read more… Incident10 in 1970 TypeCallout — Cragfast LocationPillarSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details to follow Read more… Incident10 in 1970 TypeCallout — Cragfast LocationPillar Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Thank you Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Mickledore, Scafell Pike – Sun 27th Sep 1970", "date": "27 Sep 1970", "Incident": "9 in 1970", "Type": "Callout — Injured & Medical", "Location": "Mickledore, Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/mickledore-scafell-pike-sun-27th-sep-1970/", "main_text": "Fell walker attempting to climb Mickledore Chimney. Head injuries and broken ribs. Team carried down.   Incident9 in 1970 TypeCallout — Injured & Medical LocationMickledore, Scafell Pike COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May Read more… Incident9 in 1970 TypeCallout — Injured & Medical LocationMickledore, Scafell PikeSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! Read more… Incident9 in 1970 TypeCallout — Injured & Medical LocationMickledore, Scafell Pike Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Great End – Wed 26th Aug 1970", "date": "26 Aug 1970", "Incident": "8 in 1970", "Type": "Callout — Injured & Medical", "Location": "Great End", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/great-end-wed-26th-aug-1970/", "main_text": "Team helped to carry a fell-walker with an injured leg from the Band on Great End.   Incident8 in 1970 TypeCallout — Injured & Medical LocationGreat End COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 Read more… Incident8 in 1970 TypeCallout — Injured & Medical LocationGreat EndSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More Read more… Incident8 in 1970 TypeCallout — Injured & Medical LocationGreat End Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Sty Head – Sat 25th Jul 1970", "date": "25 Jul 1970", "Incident": "7 in 1970", "Type": "Callout — Injured & Medical", "Location": "Sty Head", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/sty-head-sat-25th-jul-1970/", "main_text": "First aid given to a youth who had slipped on the valley route up to Sty Head   Incident7 in 1970 TypeCallout — Injured & Medical LocationSty Head COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 Read more… Incident7 in 1970 TypeCallout — Injured & Medical LocationSty HeadSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More Read more… Incident7 in 1970 TypeCallout — Injured & Medical LocationSty Head Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Scafell – Wed 22nd Jul 1970", "date": "22 Jul 1970", "Incident": "6 in 1970", "Type": "Callout — Overdue", "Location": "Scafell", "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-wed-22nd-jul-1970/", "main_text": "Three day search for a youth lost from a party on Scafell. Found alive by Keswick MRT near Foxes Tarn   Incident6 in 1970 TypeCallout — Overdue LocationScafell COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 FUNDRAISER ALERT Read more… Incident6 in 1970 TypeCallout — Overdue LocationScafellSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details to follow Read more… Incident6 in 1970 TypeCallout — Overdue LocationScafell Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Thank you Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Greta Gill – Tue 14th Jul 1970", "date": "14 Jul 1970", "Incident": "5 in 1970", "Type": "Callout — Other", "Location": "Greta Gill, Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Other", "url": "https://www.wmrt.org.uk/incidents/greta-gill-tue-14th-jul-1970/", "main_text": "Report of shouts and smoke in the vicinity of Greta Gill investigated. False alarm   Incident5 in 1970 TypeCallout — Other LocationGreta Gill, Scafell Pike COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 Read more… Incident5 in 1970 TypeCallout — Other LocationGreta Gill, Scafell PikeSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More Read more… Incident5 in 1970 TypeCallout — Other LocationGreta Gill, Scafell Pike Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Sty Head – Thu 11th Jun 1970", "date": "11 Jun 1970", "Incident": "4 in 1970", "Type": "Callout — Overdue", "Location": "Sty Head", "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/sty-head-thu-11th-jun-1970/", "main_text": "Night search of Sty Head for missing fell walker who turned up just before team set out.   Incident4 in 1970 TypeCallout — Overdue LocationSty Head COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 FUNDRAISER Read more… Incident4 in 1970 TypeCallout — Overdue LocationSty HeadSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details to Read more… Incident4 in 1970 TypeCallout — Overdue LocationSty Head Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Thank Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Lords Rake – Sat 4th Apr 1970", "date": "4 Apr 1970", "Incident": "3 in 1970", "Type": "Callout — Injured & Medical", "Location": "Lords Rake, Scafell", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lords-rake-sat-4th-apr-1970/", "main_text": "Fell-walker with broken leg carried from the scree below Lords Rake.   Incident3 in 1970 TypeCallout — Injured & Medical LocationLords Rake, Scafell COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May Read more… Incident3 in 1970 TypeCallout — Injured & Medical LocationLords Rake, ScafellSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! Read more… Incident3 in 1970 TypeCallout — Injured & Medical LocationLords Rake, Scafell Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Shamrock – Fri 27th Mar 1970", "date": "27 Mar 1970", "Incident": "2 in 1970", "Type": "Callout — Injured & Medical", "Location": "Shamrock, Scafell", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/shamrock-fri-27th-mar-1970/", "main_text": "A search and carry of a dead fell walker who had fallen from Shamrock in snow conditions.   Incident2 in 1970 TypeCallout — Injured & Medical LocationShamrock, Scafell COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 Read more… Incident2 in 1970 TypeCallout — Injured & Medical LocationShamrock, ScafellSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More Read more… Incident2 in 1970 TypeCallout — Injured & Medical LocationShamrock, Scafell Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Great End – Sat 7th Mar 1970", "date": "7 Mar 1970", "Incident": "1 in 1970", "Type": "Callout — Cragfast", "Location": "Great End", "Incident_Type": "Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/great-end-sat-7th-mar-1970/", "main_text": "Two cragfast climbers rescued in bad snow and weather conditions from A buttress Great End.   Incident1 in 1970 TypeCallout — Cragfast LocationGreat End COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 🔥 FUNDRAISER Read more… Incident1 in 1970 TypeCallout — Cragfast LocationGreat EndSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More details to Read more… Incident1 in 1970 TypeCallout — Cragfast LocationGreat End Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the towns. Thank Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Green Crag, Eskdale – Thu 1st Jan 1970", "date": "1 Jan 1970", "Incident": "2 in  19:", "Type": "Alert — Overdue", "Location": "Green Crag, Eskdale", "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/green-crag-eskdale-thu-1st-jan-1970/", "main_text": "We were called by Police about a walker reported overdue after a trip to Eskdale. The walker had become separated from his companion who raised the alarm when he did not show up. The walker was then confirmed to have returned home while we were investigating further. ", "rescue_info": " Incident started at 19:41 and ended at 21:30 making 1.8 hrs in total. ", "start_time": "19:41", "end_time": "21:30", "hrs": "1.8"}, {"title": "Scafell Crag – Mon 1st Sep 1969", "date": "1 Sep 1969", "Incident": "3 in 1969", "Type": "Callout — Injured & Medical", "Location": "Scafell Crag, Scafell", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-crag-mon-1st-sep-1969/", "main_text": "Climber fell from Botterill’s Slab, Scafell. Severe bruising. Team carried down.   Incident3 in 1969 TypeCallout — Injured & Medical LocationScafell Crag, Scafell COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May Read more… Incident3 in 1969 TypeCallout — Injured & Medical LocationScafell Crag, ScafellSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! Read more… Incident3 in 1969 TypeCallout — Injured & Medical LocationScafell Crag, Scafell Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Esk Hause – Mon 21st Apr 1969", "date": "21 Apr 1969", "Incident": "2 in 1969", "Type": "Callout — Overdue", "Location": "Esk Hause", "Other Agencies": ["Keswick MRT"], "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/esk-hause-mon-21st-apr-1969/", "main_text": "Night search in snow for a party of youths. Found in Langstrath by Keswick MRT.   Incident2 in 1969 TypeCallout — Overdue LocationEsk HauseOther AgenciesKeswick MRT COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May 2025 Read more… Incident2 in 1969 TypeCallout — Overdue LocationEsk HauseOther AgenciesKeswick MRTSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! More Read more… Incident2 in 1969 TypeCallout — Overdue LocationEsk HauseOther AgenciesKeswick MRT Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in the Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Hollowstones – Tue 25th Mar 1969", "date": "25 Mar 1969", "Incident": "1 in 1969", "Type": "Callout — Injured & Medical", "Location": "Hollowstones, Scafell Pike", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/hollowstones-tue-25th-mar-1969/", "main_text": "Woman fell going from Mickledore to Hollow Stones on hard snow. Head injuries. Team carried down.    Incident1 in 1969 TypeCallout — Injured & Medical LocationHollowstones, Scafell Pike COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May Read more… Incident1 in 1969 TypeCallout — Injured & Medical LocationHollowstones, Scafell PikeSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! Read more… Incident1 in 1969 TypeCallout — Injured & Medical LocationHollowstones, Scafell Pike Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Corridor Route – Sun 20th Oct 1968", "date": "20 Oct 1968", "Incident": "2 in 1968", "Type": "Callout — Overdue", "Location": "Corridor Route, Scafell Pike", "Other Agencies": ["Keswick MRT"], "Incident_Type": "Callout", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/corridor-route-sun-20th-oct-1968/", "main_text": "Search for missing fell- walker. Found dead by Keswick M.R.T. near Greta Ghyll on corridor route.   Incident2 in 1968 TypeCallout — Overdue LocationCorridor Route, Scafell PikeOther AgenciesKeswick MRT COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th Read more… Incident2 in 1968 TypeCallout — Overdue LocationCorridor Route, Scafell PikeOther AgenciesKeswick MRTSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Read more… Incident2 in 1968 TypeCallout — Overdue LocationCorridor Route, Scafell PikeOther AgenciesKeswick MRT Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}, {"title": "Broad Stand – Mon 7th Oct 1968", "date": "7 Oct 1968", "Incident": "1 in 1968", "Type": "Callout — Injured & Medical", "Location": "Broad Stand, Scafell", "Incident_Type": "Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/broad-stand-mon-7th-oct-1968/", "main_text": "Man (fellwelker) killed whilst descending Broad Stand. Team carried him down.   Incident1 in 1968 TypeCallout — Injured & Medical LocationBroad Stand, Scafell COME TO THE RESCUE!! …Family Fun Day with Your Local Heroes… Hosted by Wasdale Mountain Rescue Team and Wasdale Head Inn 📅 10th May Read more… Incident1 in 1968 TypeCallout — Injured & Medical LocationBroad Stand, ScafellSave The Date! Something BIG is about to happen! Be prepared for a day full of family fun with your favourite Wasdale Mountain Rescue Team! Read more… Incident1 in 1968 TypeCallout — Injured & Medical LocationBroad Stand, Scafell Members of the team were in Egremont on Saturday 7 December and in Whitehaven on Saturday 21 December for the annual fundraising event in Read more… Join your local heroes for a fun-filled family day out on 10th May – full of activities, demos, talent show, live music and more! ", "rescue_info": " "}]