[{"title": "Scafell – Mon 24th Mar 2025", "date": "24 Mar 2025", "Incident": "26 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Scafell", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Air Ambulance", "Coastguard", "Cumbria Police", "Helimed 58", "Rescue 199 from Prestwick"], "Diagnosis": "Multiple Injuries", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/scafell-mon-24th-mar-2025/", "main_text": "The team was called out on Monday afternoon by Cumbria Police about a serious incident involving a fallen climber. Two climbers were ascending a crag on Sca Fell, when the lead climber took a large fall. He was seriously injured, unable to communicate and ended the fall suspended on the rope below the second climber. Fortunately, the second climber was uninjured and still secure on the crag, but urgently needed assistance.\nThe team was very quickly called out and help was requested from a Coastguard helicopter. Helimed 58 also responded quickly. As the team assembled at Brackenclose and prepared the large inventory of rope rescue, medical and other equipment required for a hugely challenging technical rescue, Rescue 199 arrived overhead. With the backup plan to uplift team members high on Sca Fell, saving significant time and effort for team members to get close to the scene, the crew of Rescue 199 took a close look at whether a winch rescue was possible. After some time carefully assessing the risks to all involved, an attempt to winch was made. We don’t normally use superlatives, but with some truly amazing and heroic flying skills and teamwork, they managed to both access and then safely winch the climber directly into the helicopter from his suspended position on the end of the rope. A transfer to Helimed 58 was then completed to allow advanced medical care to be given, before then flying to a suitable hospital.\nWith the most urgent rescue completed by the helicopter crews, the rescue of the second climber still remained on what is one of the most inaccessible points of the Wasdale MR area. With the offer of further uplift assistance from Rescue 199 still a possibility (but not a guarantee), some members of the team set off on foot with heavy loads to the top of Sca Fell. However, after a refuel of the helicopter, the remaining ten team members were very grateful to get the lift up, comfortably overtaking the hill party. At this point, the technical rope rescue began, with several hundred metres of rope and countless other pieces of equipment assuring the safety of both team members and the climber. After some time, in very cold and windy conditions at height, the first rescuer was able to be lowered to the climber. She was able to very bravely and ably assist the rescue, doing most of the work herself to climb and scramble back to safe ground.\nAfter de-rigging, the long walk down to Brackenclose was completed safely and the climber re-united with awaiting family members. The team travelled back to base and spent considerable time checking equipment for damage and resetting the vehicles, before a debrief and finally being stood down to return home.\nOur thanks to both helicopter crews, and especially the crew of Rescue 199, whose actions brought the time down for the injured climber getting to definitive medical care by many hours.\nWe wish both climbers well and offer our very best wishes that the injured climber recovers fully from his injuries. ", "rescue_info": " Incident started at 14:55 and ended at 01:49 making 10.9 hrs in total. There were 26 Wasdale team members involved and the incident occured at NY207068. Total rescuer hours: 283", "start_time": "14:55", "end_time": "01:49", "hrs": "10.9", "staff": "26", "location": "NY207068", "total_hrs": "283"}, {"title": "Upper Eskdale – Sat 22nd Mar 2025", "date": "22 Mar 2025", "Incident": "25 in 2025", "Type": "Alert — Cragfast", "Location": "Upper Eskdale", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Alert", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sat-22nd-mar-2025/", "main_text": "A short alert when a call was received from Cumbria Police about a walker who was concerned for his safety, having been separated from his walking party and was on ground with loose rock. However, after a few minutes a further call was received that the party had reunited and the walker was back on safe ground. The team was stood down. ", "rescue_info": " Incident started at 14:59 and ended at 15:17 making 0.3 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 215027. Total rescuer hours: 0.3", "start_time": "14:59", "end_time": "15:17", "hrs": "0.3", "staff": "1", "location": "NY 215027", "total_hrs": "0.3"}, {"title": "Crinkle Crags – Sat 15th Mar 2025", "date": "15 Mar 2025", "Incident": "24 in 2025", "Type": "Alert — Injured & Medical", "Location": "Crinkle Crags", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Langdale Ambleside MRT"], "Diagnosis": "Medical", "Incident_Type": "Alert", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/sat-15th-mar-2025/", "main_text": "A short alert when the Team Leader was notified about an unwell walker. However as further information was obtained it was determined that the location was in Langdale Ambleside MRT’s area and after a handover they successfully completed the rescue. ", "rescue_info": " Incident started at 19:14 and ended at 19:25 making 0.2 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 249054. Total rescuer hours: 0.2", "start_time": "19:14", "end_time": "19:25", "hrs": "0.2", "staff": "1", "location": "NY 249054", "total_hrs": "0.2"}, {"title": "Lords Rake, Scafell – Fri 14th Mar 2025", "date": "14 Mar 2025", "Incident": "23 in 2025", "Type": "Full Callout — Cragfast", "Location": "Lords Rake, Scafell", "Weather": ["Cold", "Dry", "Sunny"], "Other Agencies": ["Coastguard", "Cumbria Police", "Rescue 199 from Prestwick"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/lords-rake-scafell-fri-14th-mar-2025/", "main_text": "A call was received from Cumbria Police about a lone walker who had become crag fast after veering off course whilst descending Lord’s Rake. The Team Leader was able to make contact with the walker, who was stuck on steep and icy ground in a precarious spot. The team was called out and also help was requested from a Coastguard helicopter with winching capability. Fortunately Rescue 199 from Prestwick was able to respond quickly and comfortably beat team members to the scene. They were able to locate and then winch the casualty to safety from the crag before dropping him off at Brackenclose. Our thanks go to the crew of Rescue 199 for their quick response. ", "rescue_info": " Incident started at 12:48 and ended at 15:50 making 3 hrs in total. There were 19 Wasdale team members involved and the incident occured at NY 206068. Total rescuer hours: 57", "start_time": "12:48", "end_time": "15:50", "hrs": "3", "staff": "19", "location": "NY 206068", "total_hrs": "57"}, {"title": "Scafell Pike – Wed 12th Mar 2025", "date": "12 Mar 2025", "Incident": "22 in 2025", "Type": "Alert — Lost", "Location": "Scafell Pike", "Weather": ["Cold", "Showers", "Windy"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-wed-12th-mar-2025/", "main_text": "A short alert for the Team Leader when Cumbria Police was called about three walkers who had asked for help high on Scafell Pike. A poor signal meant the information received was patchy. It appeared that they may have been caught in a wintry shower or that winter conditions underfoot were causing concern. However, a short while later, a further call was received stating that they were now out of danger and did not require MR assistance. ", "rescue_info": " Incident started at 13:30 and ended at 13:57 making 0.5 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 217075. Total rescuer hours: 0.5", "start_time": "13:30", "end_time": "13:57", "hrs": "0.5", "staff": "1", "location": "NY 217075", "total_hrs": "0.5"}, {"title": "Lingmell Col, Scafell Pike – Sat 8th Mar 2025", "date": "8 Mar 2025", "Incident": "21 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police", "Great North Air Ambulance", "Helimed 58"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-col-scafell-pike-sat-8th-mar-2025-2/", "main_text": "As incident No.20 was being assessed, a further call came in from Cumbria Police. Another walker had fallen and suffered a serious ankle injury, very close to the location of the ongoing callout. The team were already mobilised, but due to the nature of the injury helicopter support was also requested. Helimed 58 from Langwathby responded quickly and they were able to land close to the scene and provide the medical assessment and care required. However, the team was still required to provide support for the stretcher carry to the helicopter. This was completed and then the team members descended in case a stretcher carry was needed for the previous callout. This was not required and so returned to base to reset the vehicles in readiness for the next tasking. We wish the walker a quick recovery from his injury and thank the Helimed 58 crew for their help. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 14:38 and ended at 19:56 making 5.3 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 211077. Total rescuer hours: 106", "start_time": "14:38", "end_time": "19:56", "hrs": "5.3", "staff": "20", "location": "NY 211077", "total_hrs": "106"}, {"title": "Lingmell Col, Scafell Pike – Sat 8th Mar 2025", "date": "8 Mar 2025", "Incident": "20 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Dry", "Sunny"], "Other Agencies": ["Cumbria Police"], "Diagnosis": "Ankle Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-col-scafell-pike-sat-8th-mar-2025/", "main_text": "A call was received from Cumbria Police about a walker who had slipped on scree, injured his ankle, and was finding it difficult to continue. The Team Leader was able to make contact, and as the walker was willing and able to make slow progress, he was advised to keep moving to stay warm. The team was called out and met the walker stoically descending. After an assessment, it was agreed that it was safe to continue under his own steam. The slow walk to Brackenclose was successfully completed by the walker, escorted by some team members, with others diverted to another callout higher up on the mountain. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 14:01 and ended at 19:57 making 5.9 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 211076. Total rescuer hours: 118", "start_time": "14:01", "end_time": "19:57", "hrs": "5.9", "staff": "20", "location": "NY 211076", "total_hrs": "118"}, {"title": "Miterdale – Fri 7th Mar 2025", "date": "7 Mar 2025", "Incident": "19 in 2025", "Type": "Limited Callout — Lost", "Location": "Miterdale", "Weather": ["Clear", "Cold", "Dry"], "Tagged": ["Lost"], "Incident_Type": "Limited Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/mitredale-fri-7th-mar-2025/", "main_text": "A straightforward callout was swiftly resolved after two walkers had separated in a walk in Miterdale forest. One had become lost and needed some help to return to her vehicle as darkness was starting to fall. Two local team members volunteered to attend and were able to quickly locate the first walker and escort her down. The two walkers were then reunited at their vehicle, and the log was closed. ", "rescue_info": " Incident started at 17:57 and ended at 19:12 making 1.3 hrs in total. There were 4 Wasdale team members involved and the incident occured at NY 14700 01100. Total rescuer hours: 5", "start_time": "17:57", "end_time": "19:12", "hrs": "1.3", "staff": "4", "location": "NY 14700 01100", "total_hrs": "5"}, {"title": "Scafell Pike – Thu 6th Mar 2025", "date": "6 Mar 2025", "Incident": "18 in 2025", "Type": "Full Callout — Lost", "Location": "Scafell Pike", "Weather": ["Cloudy Summits", "Cold", "Mist", "Rain"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-thu-6th-mar-2025/", "main_text": "A full callout was initiated on Thursday after a call from Cumbria Police. Two walkers had been ascending Scafell Pike and separated at Lingmell Col when one wanted to make the summit and the other stayed behind. Visibility was poor with mist and rain and with darkness setting in, both walkers became lost with no head torches and called for help. A Phonefind located the walker at Lingmell Col, but the accuracy from the initial police call coordinates gave a reasonably wide search radius for the one higher up. Faced with the possibility of a search in poor conditions further help was requested from Duddon And Furness MRT. The team were able to locate the walker at Lingmell Col in the location expected. The second walker was also found after a brief search, however, was very cold and wet. Fortunately after a change of clothes and some rewarming he was able to also walk off back to Brackenclose to be reunited with his walking partner. Some lessons were learned by the walkers, after setting off very late in the day. Thanks to Duddon and Furness MRT for their support once again. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 18:56 and ended at 01:38 making 6.7 hrs in total. There were 18 Wasdale team members involved and the incident occured at NY 211077. Total rescuer hours: 121", "start_time": "18:56", "end_time": "01:38", "hrs": "6.7", "staff": "18", "location": "NY 211077", "total_hrs": "121"}, {"title": "Scafell Pike – Mon 3rd Mar 2025", "date": "3 Mar 2025", "Incident": "17 in 2025", "Type": "Limited Callout — Cragfast", "Location": "Scafell Pike", "Weather": ["Cloudy Summits", "Cold", "Drizzle"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Limited Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-mon-3rd-mar-2025/", "main_text": "The team was called by Cumbria Police about two inexperienced walkers who were not able to get down from the summit in dark and misty conditions and were getting increasingly cold. The Team Leader was able to talk to the walkers; the main problem was that they had no head torches to enable a safe guided ‘walk-off’. They agreed to stay put and wait for help. A limited callout was made and some members were diverted from the ongoing team training. Once on scene at the summit, head torches and extra clothing was provided and the two walkers escorted back to their vehicle at Brackenclose. \n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 19:20 and ended at 01:24 making 6.1 hrs in total. There were 11 Wasdale team members involved and the incident occured at NY 215073. Total rescuer hours: 67", "start_time": "19:20", "end_time": "01:24", "hrs": "6.1", "staff": "11", "location": "NY 215073", "total_hrs": "67"}, {"title": "Scafell Pike – Sun 2nd Mar 2025", "date": "2 Mar 2025", "Incident": "16 in 2025", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Cloudy Summits"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sun-2nd-mar-2025/", "main_text": "The Duty Team Leader was alerted when a concerned family member called Cumbria Police. A group of four inexperienced walkers had ascended Scafell Pike, but had not been contactable for many hours. Their cars were still at Seathwaite. As information was gathered, it transpired that the group were planning on camping overnight. With the local knowledge that it was quite likely that the group had no mobile signal in this area, it was deemed that no immediate response was necessary. The Keswick MRT Team Leader was also notified for awareness. In the morning, one of the walkers was able to be contacted on their descent and confirmed that they had been camping in the Sprinkling Tarn area and were all safe and well. ", "rescue_info": " Incident started at 02:03 and ended at 08:50 making 6.8 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 24195 07978. Total rescuer hours: 7", "start_time": "02:03", "end_time": "08:50", "hrs": "6.8", "staff": "1", "location": "NY 24195 07978", "total_hrs": "7"}, {"title": "Middleboot Knotts, Scafell Pike – Tue 25th Feb 2025", "date": "25 Feb 2025", "Incident": "15 in 2025", "Type": "Full Callout — Cragfast", "Location": "Middleboot Knotts, Scafell Pike", "Weather": ["Clear", "Cold", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Cragfast"], "Incident_Type": "Full Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/middleboot-knotts-scafell-pike-tue-25th-feb-2025/", "main_text": "A call was received from Cumbria Police about two walkers who were reporting themselves ‘stuck’ on their descent from Scafell Pike. The initial call coordinates put them at the ‘bad step’ on the path adjacent to the edge of Piers Gill. This is a short scramble with some exposure. A very poor mobile signal made it difficult to establish too much further information but it was clear help was needed. The team was called out and made their way to scene. Once there, the two walkers were reassured and a simple rope system was established to ensure safety and give confidence to descend to the bottom of the scramble. After they were back on safer ground the party walked off to Gavel Neese, where the team vehicles were located. Weary team members then made their way back to base. The equipment was checked and the vehicles reset ready for the next callout, before making their way home. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "rescue_info": " Incident started at 21:19 and ended at 03:53 making 6.6 hrs in total. There were 20 Wasdale team members involved and the incident occured at NY 212083. Total rescuer hours: 132", "start_time": "21:19", "end_time": "03:53", "hrs": "6.6", "staff": "20", "location": "NY 212083", "total_hrs": "132"}, {"title": "Scafell Pike – Sun 23rd Feb 2025", "date": "23 Feb 2025", "Incident": "14 in 2025", "Type": "Alert — Overdue", "Location": "Scafell Pike", "Weather": ["Cold", "Dry"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sun-23rd-feb-2025/", "main_text": "A brief alert when the team was called by Cumbria Police about a party of three family members that were overdue and uncontactable during a walk up Scafell Pike. The Team Leader asked for car parks to be checked for the group’s vehicle, but happily as further information was being gathered contact was able to be made. All members of the party were all safe and well and got in touch when they were back in range of a mobile signal. ", "rescue_info": " Incident started at 17:39 and ended at 18:28 making 0.8 hrs in total. There was 1 Wasdale team member involved. Total rescuer hours: 0.8", "start_time": "17:39", "end_time": "18:28", "hrs": "0.8", "staff": "1", "total_hrs": "0.8"}, {"title": "Pen, Scafell Pike – Sun 16th Feb 2025", "date": "16 Feb 2025", "Incident": "13 in 2025", "Type": "Full Callout — Lost", "Location": "Pen, Scafell Pike", "Weather": ["Cold", "Dry", "Snow"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost", "PhoneFind"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/pen-scafell-pike-sun-16th-feb-2025/", "main_text": "As callout 12 was in progress another 999 call was received requesting help. Two walkers had become separated from the rest of their group and mis-navigated in misty conditions. PhoneFind established that they were near Pen off the Eskdale side of Scafell Pike summit. They were concerned for their safety and stuck on steep and icy ground. Some members of the party already on the fell agreed to ascend via Mickledore and proceeded to their location. Once on scene the walkers were reassured and assisted to descend into Upper Eskdale for an easier but longer route to safety. En route a further lost lone walker was also encountered (by good fortune) and he joined the party. After the long walk out, team members returned to base to reset the vehicles ready for the next callout. \n\n\n\n\n\n\n ", "rescue_info": " Incident started at 15:43 and ended at 21:44 making 6 hrs in total. There were 10 Wasdale team members involved and the incident occured at NY 221067. Total rescuer hours: 60", "start_time": "15:43", "end_time": "21:44", "hrs": "6", "staff": "10", "location": "NY 221067", "total_hrs": "60"}, {"title": "Lingmell Col, Scafell Pike – Sun 16th Feb 2025", "date": "16 Feb 2025", "Incident": "12 in 2025", "Type": "Full Callout — Injured & Medical", "Location": "Lingmell Col, Scafell Pike", "Weather": ["Cold", "Dry"], "Other Agencies": ["Cumbria Police", "Helimed 63"], "Diagnosis": "Arm Injury, Head Injury", "Incident_Type": "Full Callout", "Incident_Cause": "Injured & Medical", "url": "https://www.wmrt.org.uk/incidents/lingmell-col-scafell-pike-sun-16th-feb-2025/", "main_text": "A call was received from Cumbria Police regarding a walker who had fallen and injured his head and his arm. He was walking slowly downhill with other members of his group.\nThe Team Leader made contact and established that the walker had a high pain score and was still light headed so helicopter assistance was requested, alongside a full callout. Helimed 63 responded from the North East and managed to negotiate the cloud base to land close enough for the crew to walk to scene. Thankfully after an assessment the injuries were not too serious and the walker was able to walk down. Team members ascended to meet the casualty, and received a handover from the Helimed crew.\nHowever, whilst on scene another walker was passing who had also taken a fall, also with a suspected arm fracture and they were also making their own way down. With another land ambulance requested, both casualties were able to complete their descent off the fell under the watchful eyes of the team Remote Rescue Medical Technicians.\nWe wish them both a quick recovery and offer thanks to the Helimed crew for their help. ", "rescue_info": " Incident started at 13:23 and ended at 17:48 making 4.4 hrs in total. There were 13 Wasdale team members involved and the incident occured at NY 207075. Total rescuer hours: 57", "start_time": "13:23", "end_time": "17:48", "hrs": "4.4", "staff": "13", "location": "NY 207075", "total_hrs": "57"}, {"title": "Upper Eskdale – Sun 16th Feb 2025", "date": "16 Feb 2025", "Incident": "11 in 2025", "Type": "Alert — Lost", "Location": "Upper Eskdale", "Weather": ["Snow"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost", "PhoneFind"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sun-16th-feb-2025/", "main_text": "A call was received from Cumbria Police about a party of three walkers who were lost on Scafell Pike. The Team Leader was able to gain an accurate location via Phonefind, which was in Upper Eskdale, this was significantly off course for their intended destination of Wasdale. One of the walkers had a minor injury but was able to walk out, so the Team Leader guided them out over the phone and monitored with further Phonefind’s. They reached the valley safely and the log was closed later when they were back to their car. ", "rescue_info": " Incident started at 13:07 and ended at 16:32 making 3.4 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 20000 03300. Total rescuer hours: 3.4", "start_time": "13:07", "end_time": "16:32", "hrs": "3.4", "staff": "1", "location": "NY 20000 03300", "total_hrs": "3.4"}, {"title": "Scafell Pike – Sat 15th Feb 2025", "date": "15 Feb 2025", "Incident": "10 in 2025", "Type": "Alert — Lost", "Location": "Scafell Pike", "Weather": ["Snow"], "Tagged": ["Lost"], "Incident_Type": "Alert", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/scafell-pike-sat-15th-feb-2025/", "main_text": "A short alert when a group of seven walkers were reporting themselves lost after aborting an ascent of Scafell Pike due to the winter conditions. However, as the Team Leader was gathering information it was confirmed that the group had fortunately met up with other walkers who were able to guide them safely back down to Seathwaite. ", "rescue_info": " Incident started at 15:50 and ended at 16:05 making 0.3 hrs in total. There was 1 Wasdale team member involved and the incident occured at NY 21419 07047. Total rescuer hours: 0.3", "start_time": "15:50", "end_time": "16:05", "hrs": "0.3", "staff": "1", "location": "NY 21419 07047", "total_hrs": "0.3"}, {"title": "Slight Side, Scafell – Sat 15th Feb 2025", "date": "15 Feb 2025", "Incident": "9 in 2025", "Type": "Limited Callout — Cragfast", "Location": "Slight Side, Scafell", "Weather": ["Cold", "Dry", "Mist"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Panic Attack", "PhoneFind"], "Incident_Type": "Limited Callout", "Incident_Cause": "Cragfast", "url": "https://www.wmrt.org.uk/incidents/slight-side-scafell-sat-15th-feb-2025/", "main_text": " busy weekend kicked off with a call from Cumbria Police on Saturday afternoon. Two well-prepared walkers had called for assistance as one of the walkers was suffering from a panic attack and was unable to make further progress. A location was obtained from PhoneFind. With no injuries reported, the Team Leader asked a small party to proceed to the scene and provide assistance. After the long walk-in, the two walkers were found just off the ridge but on some steep ground in extremely cold conditions. A rope rescue was required and successfully undertaken, bringing both walkers back to the ridge in turn. Once on safe ground, and after re-warming in a shelter with some additional layers, both were able to walk out unaided and were dropped off close by at their accommodation in Eskdale. We wish them both well. ", "rescue_info": " Incident started at 15:17 and ended at 00:10 making 8.9 hrs in total. There were 5 Wasdale team members involved and the incident occured at NY211056. Total rescuer hours: 45", "start_time": "15:17", "end_time": "00:10", "hrs": "8.9", "staff": "5", "location": "NY211056", "total_hrs": "45"}, {"title": "Rough Crag, Scafell Pike – Tue 11th Feb 2025", "date": "11 Feb 2025", "Incident": "8 in 2025", "Type": "Full Callout — Lost", "Location": "Rough Crag, Scafell Pike", "Weather": ["Cold", "Dry", "Mist"], "Other Agencies": ["Cumbria Police"], "Tagged": ["Lost"], "Incident_Type": "Full Callout", "Incident_Cause": "Lost", "url": "https://www.wmrt.org.uk/incidents/rough-crag-scafell-pike-tue-11th-feb-2025/", "main_text": "After a quiet period of over three weeks without a callout, a call was received from Cumbria Police. Two walkers had mis-navigated off Scafell Pike summit plateau in misty conditions and ended up beneath Rough Crag. In very cold conditions a full callout was made by the Team Leader, with several parties moving towards the walkers via different routes. Fortunately the walkers had been able to be guided down over the phone to Upper Eskdale, and the advance rescue team party met them walking out on the path. Both were safe and well and so all parties were stood down and walked back to the vehicles. ", "rescue_info": " Incident started at 16:03 and ended at 21:04 making 5 hrs in total. There were 25 Wasdale team members involved and the incident occured at NY 21800 06700. Total rescuer hours: 125", "start_time": "16:03", "end_time": "21:04", "hrs": "5", "staff": "25", "location": "NY 21800 06700", "total_hrs": "125"}, {"title": "Upper Eskdale – Sat 18th Jan 2025", "date": "18 Jan 2025", "Incident": "7 in 2025", "Type": "Alert — Overdue", "Location": "Upper Eskdale", "Weather": ["Clear", "Cool", "Dry"], "Tagged": ["Overdue"], "Incident_Type": "Alert", "Incident_Cause": "Overdue", "url": "https://www.wmrt.org.uk/incidents/upper-eskdale-sat-18th-jan-2025/", "main_text": "During callout 6, five inexperienced walkers were reported overdue by their friend after setting off for an impromptu walk up Scafell and Scafell Pike from Upper Eskdale. Most team members deployed for the ongoing callout in Wasdale were asked to hold for possible redeployment and additional team members were also asked for their availability. However, shortly after this another call was received, confirming that the party had just returned safe and well to a local hostelry, so the log was closed. ", "rescue_info": " Incident started at 20:07 and ended at 20:47 making 0.7 hrs in total. There were 7 Wasdale team members involved and the incident occured at NY 21793 02265. Total rescuer hours: 4.9", "start_time": "20:07", "end_time": "20:47", "hrs": "0.7", "staff": "7", "location": "NY 21793 02265", "total_hrs": "4.9"}]